
<!DOCTYPE HTML>
<html>
 <head>
   

<link type="text/css" href="/site_static/css/booki.css" rel="Stylesheet" >
<link type="text/css" href="/site_static/js/jquery/themes/base/jquery.ui.all.css" rel="Stylesheet" >
<link type="text/css" href="/site_static/js/jquery/themes/smoothness/jquery.ui.all.css" rel="Stylesheet" >
<script type="text/javascript" src="/site_static/js/jquery/jquery-1.4.4.js"></script>
<script type="text/javascript" src="/site_static/js/jquery/ui/jquery-ui-1.8.10.custom.js"></script>
<script type="text/javascript" src="/site_static/js/jquery.json-1.3.js"></script>
<script type="text/javascript" src="/site_static/js/booki.js"></script>
<script src="/site_static/js/messaging.js" type="text/javascript"></script>   
<script type="text/javascript" src="/site_static/js/general.js"></script>
<link href="/site_static/css/jquery.bubblepopup.v2.3.1.css" rel="stylesheet" type="text/css" />
<link type="text/css" href="/site_static/css/jquery-ui_overrides.css" rel="Stylesheet" >
<script src="/site_static/js/jquery.bubblepopup.v2.3.1.min.js" type="text/javascript"></script>

<link rel="SHORTCUT ICON" href="http://write.flossmanuals.net/site_static/images/favicon.ico" type="image/x-icon">
<meta property="og:site_name" content="FLOSS Manuals"/><meta name="description" content="Free Manuals for Freedom"/>

<script type="text/javascript">
  $(function() {
      $.booki.sputnikDispatcherURL = "/_sputnik/";

      $("#dialog-sputnik-error").dialog({
          modal: true,
          autoOpen: false,
          buttons: {
            Ok: function() {
               $(this).dialog('close');
               window.location = '.';
            }
          }
      });
  
      $("FORM.messagefield").messagefield('init', {'view_post': '/messaging/post' });  
  });
</script>


   
 <title>/chapter: Editointi / Blender suomeksi</title>
 <link type="text/css" href="/site_static/css/draft.css" rel="Stylesheet" />

 <link rel="alternate" type="application/rss+xml" title="RSS feed for Blender suomeksi" href="/feeds/rss/book/blender-suomeksi/" /> 
 <link rel="alternate" type="application/atom+xml" title="Atom feed for Blender suomeksi" href="/feeds/atom/book/blender-suomeksi/" /> 

 <link rel="alternate" type="application/rss+xml" title="RSS feed for chapter EDITOINTI" href="/feeds/rss/chapter/blender-suomeksi/blender-suomeksi/" /> 
 <link rel="alternate" type="application/atom+xml" title="Atom feed for chapter EDITOINTI" href="/feeds/atom/chapter/blender-suomeksi/blender-suomeksi/" /> 
 
 <script type="text/javascript" src="/site_static/js/draft.js"></script>


   <link type="text/css" href="/static/css/_user.css" rel="Stylesheet" >
 </head>
<body>

<div class="topbar"> 
  <div class="logotext"><a href="http://write.flossmanuals.net/">FLOSS Manuals</a> </div>

  <div class="meta-bar">
    
    <ul>
      <li>
        <a href="/accounts/signin/?redirect=/blender-suomeksi/_draft/_v/1.0/editointi/">Sign In / Create Account</a>
      </li>
    </ul>
    
    <div style="padding-top: 10px; padding-right: 15px;">
      <br/>
      

<script>
  $(function() {
    var $frm = $("FORM[name=changelang]");
	
    $("A[href=#]", $frm).click(function() {
        var lang = $(this).attr("class").substr(4);
	
        $("INPUT[name=language]", $frm).val(lang);
        $frm.submit();
	
        return false;
    });
  });
 </script>

<form name="changelang" method="POST" action="/accounts/i18n/setlang/?language=en-us">
  <input type="hidden" name="language" value="en-us">
  
    &nbsp;English&nbsp;|
  
  
  
    &nbsp;<a class="langes" href="#">Español</a>&nbsp;|
  

  
    &nbsp;<a class="langfr" href="#">Français</a>&nbsp;|
  
	
  
    &nbsp;<a class="langit" href="#">Italiano</a>&nbsp;|
  
	
  
    &nbsp;<a class="langpt" href="#">Português</a>&nbsp;|
  
	
  
    &nbsp;<a class="langru" href="#">Русский</a>&nbsp;|
  
	
  
    &nbsp;<a class="langsq" href="#">Shqip</a>
  	
</form>

    </div>
    
    
  </div><!-- End of .meta-bar -->
</div><!-- End top bar -->

<div class="menubar shadow">
  
  
  <div class="navbox">
    <ul>
      <li><a href="/list-books/">Books</a></li>
      <li><a href="/list-groups/">Groups</a></li>
      <li><a href="/list-people/">People</a></li>
    </ul>      
  </div><!-- End of .navbox -->       
</div>

<div class="content-container">
  <div class="content shadow">
    <!-- Content box and the drop shadow-->
    

<h2>Blender suomeksi</h2>
<div class="padded">
 <div id="bookmenu" style="background: url(/site_static/images/draft_bg.png) repeat !important;"> 
  <ul>
   
    
      <li><b>Johdanto</b></li>
    
   
    
      <li><a href="/blender-suomeksi/_draft/_v/1.0/johdanto/">JOHDANTO</a></li>
    
   
    
      <li><b>Asennus</b></li>
    
   
    
      <li><a href="/blender-suomeksi/_draft/_v/1.0/asennus-windowsiin/">ASENNUS WINDOWSIIN</a></li>
    
   
    
      <li><b>Käytännöt</b></li>
    
   
    
      <li><a href="/blender-suomeksi/_draft/_v/1.0/kaytannot/">KÄYTÄNNÖT</a></li>
    
   
    
      <li><b>Käyttöliittymä</b></li>
    
   
    
      <li><a href="/blender-suomeksi/_draft/_v/1.0/kayttoliittyma/">KÄYTTÖLIITTYMÄ</a></li>
    
   
    
      <li><b>Asetukset</b></li>
    
   
    
      <li><a href="/blender-suomeksi/_draft/_v/1.0/asetukset/">ASETUKSET</a></li>
    
   
    
      <li><b>Editointi</b></li>
    
   
    
      <li><a href="/blender-suomeksi/_draft/_v/1.0/editointi/">EDITOINTI</a></li>
    
   
    
      <li><a href="/blender-suomeksi/_draft/_v/1.0/esineen-luominen/">ESINEEN LUOMINEN</a></li>
    
   
    
      <li><b>Tekstuurit</b></li>
    
   
    
      <li><a href="/blender-suomeksi/_draft/_v/1.0/teksturointi/">TEKSTUROINTI</a></li>
    
   
    
      <li><b>Renderöinti</b></li>
    
   
    
      <li><a href="/blender-suomeksi/_draft/_v/1.0/renderointi/">RENDERÖINTI</a></li>
    
   
    
      <li><b>Tekijät</b></li>
    
   
    
      <li><a href="/blender-suomeksi/_draft/_v/1.0/tekijat/">TEKIJÄT</a></li>
    
   
  </ul>
 </div>
 <div id="bookcontent"   style="background: url(/site_static/images/draft_bg.png) repeat !important;">
   

  <h1><span style="font-size: 2em;">ESINEIDEN EDITOINTI</span></h1>
<p>T&auml;ss&auml; luvussa esitell&auml;&auml;n useimmissa kolmiulotteisissa mallinnusohjelmissa k&auml;ytett&auml;v&auml;t perustekniikat. Niill&auml; p&auml;&auml;see alkuun omien projektien mallinnuksessa.</p>
<p>Varmista ensin, ett&auml; kohtauksessasi on objekti. Blenderiss&auml; objektina on oletusarvoisesti kuutio, jonka Blender tarjoaa k&auml;ynnist&auml;ess&auml;si sen.</p>
<p><img src="static/ScreenHunter_59%20Apr.%2016%2020.31.gif" alt="" /></p>
<p><em>Blenderin oletusarvoinen kuutio.</em></p>
<h2>Valintatilat</h2>
<p>Paina <strong>A-n&auml;pp&auml;int&auml;</strong> objektisi p&auml;&auml;ll&auml;, jotta varmistat, ett&auml; solmuja, tahkoja tai reunoja ei ole valittu. Valitsematon tahko on v&auml;rilt&auml;&auml;n siniharmaa.&nbsp;</p>
<p>Huomaa, ett&auml; kuvaikkunan pohjalla - ja vain editointitilassa - on muutama kuvake, jotka n&auml;ytt&auml;v&auml;t t&auml;lt&auml;:&nbsp;</p>
<p><img src="static/ScreenHunter_60%20Apr.%2016%2020.35.gif" alt="" /></p>
<p>Jos et n&auml;e n&auml;it&auml; ikoneita kuvaikkunasi alaosassa, et ole editointitilassa. Voit siirty&auml; valikosta editointitilaan.</p>
<p><img src="static/ScreenHunter_61%20Apr.%2016%2020.36.gif" alt="" /></p>
<p>N&auml;m&auml; ikonit esitt&auml;v&auml;t eri tyyppist&auml; verkkodataa, jonka voimme valita. Solmuja edustaa pisteikoni, reunoja viistoviivaikoni ja tahkoja kolmioikoni. Huomaa, ett&auml; kun valitset reunan, valitset kaksi solmua. Kun valitset tahkon, valitset kolme tai useampia solmuja (ja siten kolme tai useampia reunoja).</p>
<p>Yrit&auml; napsauttaa tahkonvalintaikonia. Huomaa, kuinka pieni musta neli&ouml; ilmestyy kuution jokaiselle tahkolle. Napsauta <strong>OHN </strong>jotain tahkoa ja siit&auml; tulee valittu. Kun tahko on valittu, sen reunoista tulee oransseja.</p>
<p><img src="static/ScreenHunter_62%20Apr.%2016%2020.40.gif" alt="" /></p>
<p>Yrit&auml; samaa sek&auml; reunojen ett&auml; solmujen valintatiloissa ja huomaa, kuinka solmujen ja reunojen v&auml;rit muuttuvat, kun ne valitaan.</p>
<p>Monta tahkoa, reunaa tai solmua voidaan valita k&auml;ytt&auml;en<strong> SHIFT+OHN</strong>-yhdistelm&auml;&auml;.</p>
<p>Harjoittele tahkojen tai reunojen siirt&auml;mist&auml; valitsemalla ne <strong>G-n&auml;pp&auml;imell&auml;</strong> ja siirt&auml;m&auml;ll&auml; hiiren kursoria ymp&auml;riins&auml;.</p>
<p><img src="static/ScreenHunter_63%20Apr.%2016%2020.42.gif" alt="" />&nbsp;</p>
<p><strong>VHN </strong>tai <strong>rivinvaihto </strong>vahvistaa uuden sijainnin tahkolle. <strong>OHN </strong>tai <strong>ESC-n&auml;pp&auml;in</strong> peruuttaa liikkeen. <strong>CTRL-Z-n&auml;pp&auml;in</strong> kumoaa viimeisen toiminnon, kuten aina.</p>
<h2>Globaalit ja paikalliset akselit</h2>
<p>Monet alla olevista editointitekniikoista viittaavat akseleihin X, Y ja Z. Ennen ty&ouml;skentely&auml; akseleiden kanssa kolmiulotteisessa ymp&auml;rist&ouml;ss&auml; on t&auml;rke&auml;&auml; muistaa, ett&auml; objekteilla ja tahkoilla voi olla sek&auml; paikallisia ett&auml; globaaleja akseleita.&nbsp;</p>
<p>Globaalit akselit p&auml;tev&auml;t koko kohtaukseen ja kaikkeen sen sis&auml;ll&auml; olevaan. Niit&auml; ei voi muuttaa, aivan kuin tosimaailman it&auml; ja l&auml;nsi eiv&auml;t muuta suuntaa.</p>
<p>Paikalliset akselit edustavat kuitenkin vain esineen tai esineen osan sijaintia. Paikallisia akseleita voi ajatella termeill&auml; edess&auml;, takana, vasemmalla ja oikealla. Paikalliset akselit ovat suhteellisia, ne riippuvat siit&auml;, mihin suuntaan objekti on k&auml;&auml;nnetty. Esimerkiksi objektin paikallinen X-akseli voisi osoittaa globaalia Z-akselia pitkin.</p>
<p>Ennen kuin k&auml;yt&auml;t muutosta (esimerkiksi kierityst&auml; tai skaalausta) p&auml;&auml;t&auml;, tahdotko tehd&auml; sen k&auml;ytt&auml;en valintasi paikallista akselistoa vai kohtauksesi globaalia akselistoa. Voit valita ty&ouml;skenteletk&ouml; globaalin vai lokaalin suunnistuksen parissa k&auml;ytt&auml;en muutossuunnistusta (Transform Orientation) alasvetovalikosta jokaisen kuvaikkunan pohjalla.</p>
<p>T&auml;m&auml; alasvetovalikko on n&auml;kyvill&auml; alla olevassa kuvassa:</p>
<p><img src="static/ScreenHunter_65%20Apr.%2016%2020.55.gif" alt="" /></p>
<p>Alasvetovalikossa:</p>
<p><strong>View </strong>- n&auml;kym&auml;</p>
<p><strong>Normal </strong>- normaali</p>
<p><strong>Gimbal</strong> - gimbaali</p>
<p><strong>Local </strong>- paikallinen</p>
<p><strong>Global </strong>- globaali</p>
<h2>Kieritys</h2>
<h3>Vapaa kieritys hiirell&auml;</h3>
<p>Mit&auml; tahansa tahkojen yhdistelm&auml;&auml; voidaan kieritt&auml;&auml; vapaasti painamalla <strong>R-n&auml;pp&auml;int&auml;</strong>, jota seuraa joukko vapaita hiiren liikkeit&auml;. T&auml;m&auml; on luonnollisesti hyvin ep&auml;tarkkaa, varsinkin jos se tehd&auml;&auml;n perspektiivin&auml;kym&auml;ss&auml;.</p>
<p><img src="static/ScreenHunter_66%20Apr.%2016%2020.59.gif" alt="" /></p>
<h3>Numerokieritys</h3>
<p>Tahkoja voidaan kieritt&auml;&auml; my&ouml;s annettua akselia pitkin antamalla asteluku numeroilla m&auml;&auml;riteltyn&auml;. Tehd&auml;ksesi t&auml;m&auml;n valitse tahkot, joita tahdot kieritt&auml;&auml;, paina <strong>R-n&auml;pp&auml;int&auml;</strong>, valitse akseli, jota tahdot kieritt&auml;&auml; ymp&auml;riins&auml;, ja kirjoita sitten asteluku.</p>
<p>Jos esimerkiksi tahdon kieritt&auml;&auml; tahkoa 45 astetta globaalin Z-akselin ymp&auml;ri, painan <strong>R-n&auml;pp&auml;int&auml;</strong>, <strong>Z-n&auml;pp&auml;int&auml;,</strong> <strong>NUMERO-4</strong> ja <strong>NUMERO-5</strong>.</p>
<p><strong>T&auml;rke&auml;&auml;:</strong> kun kierit&auml;t objekteja tai verkkoja k&auml;ytt&auml;en numeroita, kierit&auml;t noita osia suhteellisesti, et absoluuttisesti! Esimerkiksi <strong>R-n&auml;pp&auml;in </strong>ja<strong> Y-n&auml;pp&auml;in</strong> ja <strong>NUMERO-45</strong> merkitsee: "kierit&auml; Y-akselin ymp&auml;ri toiset 45 astetta."</p>
<div class="c2">
<h2>S&auml;&auml;nn&ouml;nmukainen ja s&auml;&auml;nn&ouml;t&ouml;n skaalaus</h2>
</div>
<p>S&auml;&auml;nn&ouml;nmukainen skaalaus viittaa tapaan skaalata sama m&auml;&auml;r&auml; kaikilla akseleilla samaan aikaan. T&auml;m&auml; on oletusarvona Blenderiss&auml;. S&auml;&auml;nn&ouml;t&ouml;n skaalaus merkitsee valinnaista skaalausta vain yhdell&auml; tai kahdella akselilla. Esimerkiksi tehd&auml;ksesi esineest&auml; kaksi kertaa pidemm&auml;n tai yht&auml; leve&auml;n kuin korkean, voisit k&auml;ytt&auml;&auml; s&auml;&auml;nn&ouml;t&ouml;nt&auml; skaalausta vain yht&auml; akselia pitkin.</p>
<h3>S&auml;&auml;nn&ouml;nmukainen skaalaus: hiiri</h3>
<p>T&auml;m&auml;n tekeminen hiirell&auml; on aika hankalaa, mutta se on hyvin k&auml;tev&auml;&auml;, kun olet tottunut siihen. T&auml;m&auml; tekniikka vaatii kertomaan Blenderille mit&auml; akselia pitkin tahdot skaalata hiiren liikkeell&auml;.</p>
<p>Valitse objektisi kaikki tahkot tai joitain niist&auml; (kaikkien valitseminen tekee t&auml;st&auml; harjoituksesta selke&auml;mm&auml;n). Siirr&auml; nyt hiiresi kursoria akselia pitkin, jolla tahdot skaalata tahkosi, ja paina <strong>KHN </strong>alas.</p>
<p><img src="static/ScreenHunter_67%20Apr.%2016%2021.06.gif" alt="" /></p>
<p>Tahkot skaalautuvat vain sit&auml; akselia pitkin. Jos esimerkiksi tahdot skaalata koko verkkosi vain Y-akselia pitkin kun siirryt n&auml;k&ouml;kulmaan ylh&auml;&auml;lt&auml; (ortografiseen tietenkin), siirr&auml; hiirt&auml; ylh&auml;&auml;lt&auml; alas -suunnassa ja paina <strong>KHN</strong>. Kuten tavallista, <strong>rivinvaihto </strong>tai <strong>OHN </strong>vahvistaa t&auml;m&auml;n muutoksen.</p>
<h3>S&auml;&auml;nn&ouml;t&ouml;n skaalaus: numerot</h3>
<p>T&auml;m&auml; tekniikka on hyvin samanlainen kuin s&auml;&auml;nn&ouml;nmukainen skaalaus numeroilla, joka on selostettu yll&auml;, mutta sinun t&auml;ytyy kertoa Blenderille mit&auml; akselia pitkin tahdot skaalata.</p>
<p>Valitse tahkot, joita tahdot skaalata, paina<strong> S-n&auml;pp&auml;int&auml;</strong>, valitse akseli, ja kirjoita sitten skaalan kerroinnumero. Esimerkiksi: skaalataksesi kahdesti Z-akselia pitkin painaisit <strong>S-n&auml;pp&auml;in</strong> ja <strong>Z-n&auml;pp&auml;in </strong>ja <strong>NUMERO-2</strong>.</p>
<h3>S&auml;&auml;nn&ouml;t&ouml;n rajoittunut skaalaus: numerot</h3>
<p>On my&ouml;s mahdollista laittaa Blender skaalaamaan kaikkia paitsi yht&auml; akselia pitkin. Skaalataksesi X ja Y -akseleita pitkin ja est&auml;&auml;ksesi skaalauksen Z-akselia pitkin, paina <strong>S-n&auml;pp&auml;in</strong> ja <strong>SHFT+Z-n&auml;pp&auml;in</strong> ja <strong>NUMERO-2</strong>.</p>
<div class="c2">
<h2>Alueiden valinta</h2>
</div>
<p>Kaksi valintaty&ouml;kalun kaltaista valintatilaa on tarjolla. N&auml;m&auml; ovat erityisen hy&ouml;dyllisi&auml; solmujen ja/tai tahkojen valitsemiseen yksityiskohtaisissa verkoissa. Niit&auml; voidaan k&auml;ytt&auml;&auml; my&ouml;s valitsemaan useita objekteja objektitilassa. Luonnollisesti t&auml;m&auml; tekniikka on kaikkein hy&ouml;dyllisin sinulle, kun objektissasi on monta solmua. Valitse objektisi ja mene editointitilaan.</p>
<h3>Laatikkovalinta</h3>
<p>Kun kursorisi on kuvaikkunan p&auml;&auml;ll&auml;, jonka tahdot valita, paina <strong>B-n&auml;pp&auml;int&auml;</strong>. Huomaa, ett&auml; hiiren kursori muuttuu t&auml;ht&auml;imeksi, josta l&auml;htee kohtisuoria pisteytettyj&auml; viivoja. Nyt voit painaa <strong>VHN </strong>ja vet&auml;&auml; valintaty&ouml;kalun objektisi verkon elementtien yli. <strong>ESC </strong>poistuu laatikkovalinnasta.</p>
<h2>Solmujen, reunojen ja tahkojen luominen ja valinta</h2>
<h3>Solmujen, reunojen ja tahkojen poistaminen.</h3>
<p>Usein tahdot poistaa elementtej&auml; editoinnin aikana. Voit esimerkiksi haluta poistaa tahkon mutta j&auml;tt&auml;&auml; vain reunat tai poistaa kaiken koko valinnasta. Tehd&auml;ksesi t&auml;m&auml;n valitse alue, jonka tahdot poistaa, ja paina <strong>DEL </strong>tai <strong>X-n&auml;pp&auml;int&auml;</strong>. Ilmestyy valikko, jossa on lista poistovaihtoehdoista. Valitse yksi hiirell&auml; tai <strong>nuolin&auml;pp&auml;imill&auml; </strong>ja paina <strong>VHN </strong>tai <strong>rivinvaihto</strong>.</p>
<p><img src="static/ScreenHunter_68%20Apr.%2016%2021.12.gif" alt="" /></p>
<h3>Solmujen, reunojen tai tahkojen tekeminen ilman kahdentamista.</h3>
<p>Blenderill&auml; voi piirt&auml;&auml; uusia verkkoelementtej&auml; hyvin nopeasti. T&auml;m&auml;n tekemiseen on monta tapaa. Kuvaan t&auml;ss&auml; useimmin k&auml;ytetyt.</p>
<h3>Solmujen lis&auml;&auml;minen</h3>
<p><strong>CTRL-n&auml;pp&auml;imen </strong>pit&auml;minen alhaalla kun painat <strong>VHN </strong>kuvaikkunassa lis&auml;&auml; solmuja kursorin alle. N&auml;it&auml; solmuja yhdist&auml;v&auml;t reunat.</p>
<p><img src="static/ScreenHunter_69%20Apr.%2016%2021.15.gif" alt="" /></p>
<h3>Yhden tahkon lis&auml;&auml;minen</h3>
<p>Sek&auml; reunat ett&auml; tahkot riippuvat solmuista. Reunat tarvitsevat kaksi solmua ollakseen olemassa ja tahkot v&auml;hint&auml;&auml;n kolme solmua. Lis&auml;&auml;ksesi yhden tahkon, tee n&auml;in:</p>
<ul>
<li>Valitse mitk&auml; tahansa kolmesta tai nelj&auml;st&auml; solmusta ja paina<strong> F-n&auml;pp&auml;int&auml;</strong>. Tahko luodaan automaattisesti.</li>
<li>Valitse mitk&auml; tahansa kaksi reunaa tai kolme jatkuvaa reunaa ja paina <strong>F-n&auml;pp&auml;int&auml;</strong>. Kolme jatkumatonta reunaa ei tee tahkoa, sen sijaan n&auml;et valikon, jossa kysyt&auml;&auml;n tahdotko tehd&auml; FGon-erikoispinnan.</li>
</ul>
<div class="c2">
<h2>Jakaminen osiin</h2>
<p>&nbsp;</p>
</div>
<p>Yhden tai useampia tahkoja voi jakaa osiin useammalla eri tavalla. Ensinn&auml;kin, valitse tahkot, jotka tahdot jakaa osiin. Napsauta <strong>Mesh Tools</strong> -ikkunan kohdassa <strong>Add </strong>nappia <strong>Subdivide</strong>.</p>
<p><img src="static/ScreenHunter_72%20Apr.%2016%2021.29.gif" alt="" /></p>
<p>Aina napsauttaessasi <strong>Subdivide</strong>-nappulaa valitut tahkot leikataan kahtia.</p>
<p><img src="static/ScreenHunter_73%20Apr.%2016%2021.30.gif" alt="" /></p>
<div class="c2">
<h2>Ekstruusio</h2>
<p>&nbsp;</p>
</div>
<p>Ekstruusio on hyvin suosittu editointimenetelm&auml;, jota k&auml;ytet&auml;&auml;n usein verkkomallinnuksessa. Toisin kuin monet muut menetelm&auml;t, ekstruusio itse asiassa lis&auml;&auml; verkkodataa alkuper&auml;iseen verkkoon. Tahkoja, reunoja ja jopa solmuja voidaan ekstrusoida.</p>
<p><img src="static/ScreenHunter_75%20Apr.%2016%2021.34.gif" alt="" /></p>
<p><strong>Huomaa: </strong></p>
<ul>
<li>Jos ekstrusoit nelj&auml;n reunan tahkoa, nelj&auml; lis&auml;tahkoa luodaan, yksi jokaiselle uuden ekstrusoidun osan "puolelle".</li>
<li>Jos ekstrusoit reunaa, yksi uusi tahko luodaan.</li>
<li>Jos ekstusoit solmua, yksi lis&auml;reuna luodaan.&nbsp;</li>
</ul>
<p>&nbsp;</p>
<h3>Ekstruusio: hiiri</h3>
<p>Yhden tahkon ekstruusiota varten valitse tahko, paina <strong>E-n&auml;pp&auml;int&auml;</strong> ja siirr&auml; hiirt&auml;. Tahko ekstrusoituu normaalia pitkin (eli pystysuoraan tahkon pintaa kohden). Pid&auml; <strong>CTRL-n&auml;pp&auml;int&auml; </strong>pohjassa ja hiiri rajoittaa (lukitsee) ekstruusion ruudukon yksik&ouml;ihin.</p>
<h3>Ekstruusio: numerot</h3>
<p>Valitse tahko, paina<strong> E-n&auml;pp&auml;int&auml;</strong> ja kirjoita numero. Ekstrusoidaksesi esimerkiksi tahkon kaksi kokonaista ruudukkoyhdikk&ouml;&auml; normaalia pitkin, paina<strong> E-n&auml;pp&auml;int&auml;</strong> ja<strong> NUMERO-2</strong> ja paina <strong>rivinvaihtoa </strong>vahvistaaksesi muutoksen.</p>
<h2>Tahkojen erottaminen ("osittaminen")</h2>
<p>Joskus on hy&ouml;dyllist&auml; voida erottaa valitut tahkot muista verkossa, jolloin syntyy uusi objekti. Tee t&auml;m&auml; k&auml;ytt&auml;en <strong>P-n&auml;pp&auml;int&auml;</strong>. T&auml;ll&ouml;in n&auml;kyviin ilmestyy valikko.</p>
<p><img src="static/ScreenHunter_76%20Apr.%2016%2021.51.gif" alt="" /></p>
<p>T&auml;ss&auml; tapauksessa voit valita kohdan <strong>Selection</strong>.</p>
<p>Uusille objekteille annetaan automaattisesti uusi nimi perustuen alkuper&auml;isen objektin nimeen. N&auml;et uuden objektin kohdassa <strong>Scene</strong>.</p>
<p><img src="static/ScreenHunter_77%20Apr.%2016%2021.54.gif" alt="" /></p>
<div class="c2">
<h2>Kaksintaminen</h2>
<p>&nbsp;</p>
</div>
<p>Valitut tahkot, reunat tai solmut voidaan kaksintaa nopeasti painamalla <strong>SHIFT+D</strong>-n&auml;pp&auml;imi&auml;. Kun ne on keksinnettu ne ovat automaattisesti nappaustilassa, joten voit siirt&auml;&auml; hiirt&auml; siirt&auml;&auml;ksesi kopion toisaalle. Jos et tee t&auml;t&auml;, kopio pysyy tarkalleen alkuper&auml;isen sijainnissa, etk&auml; n&auml;e uutta kopiota!</p>
<p><img src="static/ScreenHunter_78%20Apr.%2016%2021.56.gif" alt="" /></p>
<div class="c3">&nbsp;</div>
<div class="c2">
<h2>Objektien liitt&auml;minen</h2>
<p>&nbsp;</p>
</div>
<p>Yksi objekti voidaan liitt&auml;&auml; toiseen (jolloin luodaan uusi objekti) k&auml;ytt&auml;m&auml;ll&auml; <strong>CTRL+J-n&auml;pp&auml;imi&auml;</strong>.</p>
<h2>Verkkojen ja pintojen tasoittaminen</h2>
<p>Tasoitusnappulan (<strong>Smooth Vertex</strong>) painaminen editointipaneelin verkkoty&ouml;kalupalkissa (<strong>Mesh Tools</strong>) antaa verkosta orgaanisemman vaikutelman lis&auml;&auml;m&auml;ll&auml; solmujen v&auml;lisi&auml; kulmia. Mit&auml; enemm&auml;n painat nappia, sit&auml; tasaisempi verkosta tulee. Lis&auml;ksi, mit&auml; enemm&auml;n verkkoja, sit&auml; tasaisempi siit&auml; voi tulla. Alla oleva kuva n&auml;ytt&auml;&auml;, mist&auml; tasoitusnappula l&ouml;ytyy.</p>
<p class="c4"><img src="static/ScreenHunter_79%20Apr.%2016%2022.04.gif" alt="" /> &nbsp;</p>
<p class="c4">&nbsp;</p>
<div class="c2">
<h2>Siivoaminen</h2>
<p>&nbsp;</p>
</div>
<p>Usein editoinnin aikana Blenderiss&auml; tapahtuu pikku vahinkoja, jotka johtavat solmujen kahdentamiseen.</p>
<p>Yksi yleinen esimerkki t&auml;st&auml; on ekstruusion aikana tapahtuva vahinko: valitset tahkon ekstruudattavaksi ja painat<strong> E-n&auml;pp&auml;int&auml;</strong>, mutta muutat mielt&auml;si, joten peruutat ekstruusion. Olet juuri luonut kokonaisen tahkon, joka on juuri vanhan tahkon p&auml;&auml;ll&auml;. Toinen esimerkki on, ett&auml; valitset koko verkon <strong>A-n&auml;pp&auml;imell&auml;</strong>, ja kopioit sen <strong>SHIFT+D-n&auml;pp&auml;imell&auml;</strong>. Sen sijaan ett&auml; siit&auml;isit sen oikeaan sijaintiin, j&auml;t&auml;t sen juurikin alkuper&auml;isen p&auml;&auml;lle, jolloin monia tupla-tahkoja j&auml;&auml; j&auml;ljelle (ja samalla tietenkin my&ouml;s kaksinkertaistettuja solmuja ja reunoja). N&auml;m&auml; kaksinkertaiset tahkot, reunat ja solmut ovat n&auml;kym&auml;tt&ouml;mi&auml; silm&auml;lle.</p>
<p>On hyv&auml; tapa puhdistaa n&auml;m&auml; tupatut solmut k&auml;ytt&auml;en poista tuplat -nappia (<strong>Remove Doubles</strong>). T&auml;m&auml; toiminto etsii solmuja tietyn matkan p&auml;&auml;ss&auml; toisistaan, ja jos ne ovat t&auml;m&auml;n matkan p&auml;&auml;ss&auml;, se poistaa toisen ja siirt&auml;&auml; j&auml;ljelle j&auml;&auml;v&auml;n niiden puoliv&auml;liin. Kun se on s&auml;&auml;detty hyvin pieneen numeroon (perusolettamus on oikea), t&auml;m&auml; voi olla hyvin tehokas tapa puhdistaa verkkoa. <strong>Remove Doubles</strong> -nappi l&ouml;ytyy <strong>Mesh Tools</strong> -kohdan alta kohdasta <strong>Remove</strong>.</p>
<p class="c4"><img src="static/ScreenHunter_80%20Apr.%2016%2022.11.gif" alt="" /></p>
<div class="c3">&nbsp;</div>
<p class="c4">&nbsp;</p>
<div class="c3">&nbsp;</div>
   
  </div>
 </div>


  </div>
</div>
<!-- End of content -->



<!-- sputnik error page -->
<div id="dialog-sputnik-qrac" style="display: none"></div>
<div id="dialog-sputnik-error" title="Can't communicate with booktype">
  <p>
    <span class="ui-icon ui-icon-circle-check" style="float:left; margin:0 7px 50px 0;"></span>
    There has been error in communication with Booktype server.
    Not sure right now where is the problem.
  </p>
  <p>
    You should refresh this page.
  </p>
</div>


<ul class="strings template">
 <li class="ok">OK</li>
 <li class="back">Back</li>
 <li class="create">Create</li>
 <li class="cancel">Cancel</li>
 <li class="next">Next</li>
 <li class="import">Import</li>
 <li class="savechanges">Save changes</li>
 <li class="errorcreategroup">Couldn't create a group!</li>
 <li class="msgepub">enter epub URL</li>
 <li class="msgarchive">enter Archive.org ID</li>
 <li class="msgwiki">enter Wikibooks URL</li>
 <li class="msgbooktype">enter Booktype URL</li>
 <li class="deletebook">Delete book</li>
</ul>

</body>
</html>

