
<!DOCTYPE HTML>
<html>
 <head>
   

<link type="text/css" href="/site_static/css/booki.css" rel="Stylesheet" >
<link type="text/css" href="/site_static/js/jquery/themes/base/jquery.ui.all.css" rel="Stylesheet" >
<link type="text/css" href="/site_static/js/jquery/themes/smoothness/jquery.ui.all.css" rel="Stylesheet" >
<script type="text/javascript" src="/site_static/js/jquery/jquery-1.4.4.js"></script>
<script type="text/javascript" src="/site_static/js/jquery/ui/jquery-ui-1.8.10.custom.js"></script>
<script type="text/javascript" src="/site_static/js/jquery.json-1.3.js"></script>
<script type="text/javascript" src="/site_static/js/booki.js"></script>
<script src="/site_static/js/messaging.js" type="text/javascript"></script>   
<script type="text/javascript" src="/site_static/js/general.js"></script>
<link href="/site_static/css/jquery.bubblepopup.v2.3.1.css" rel="stylesheet" type="text/css" />
<link type="text/css" href="/site_static/css/jquery-ui_overrides.css" rel="Stylesheet" >
<script src="/site_static/js/jquery.bubblepopup.v2.3.1.min.js" type="text/javascript"></script>

<link rel="SHORTCUT ICON" href="http://write.flossmanuals.net/site_static/images/favicon.ico" type="image/x-icon">
<meta property="og:site_name" content="FLOSS Manuals"/><meta name="description" content="Free Manuals for Freedom"/>

<script type="text/javascript">
  $(function() {
      $.booki.sputnikDispatcherURL = "/_sputnik/";

      $("#dialog-sputnik-error").dialog({
          modal: true,
          autoOpen: false,
          buttons: {
            Ok: function() {
               $(this).dialog('close');
               window.location = '.';
            }
          }
      });
  
      $("FORM.messagefield").messagefield('init', {'view_post': '/messaging/post' });  
  });
</script>


   
 <title>/chapter: Viestinta / Booktype suomeksi</title>
 <link type="text/css" href="/site_static/css/draft.css" rel="Stylesheet" />

 <link rel="alternate" type="application/rss+xml" title="RSS feed for Booktype suomeksi" href="/feeds/rss/book/booktype-suomeksi/" /> 
 <link rel="alternate" type="application/atom+xml" title="Atom feed for Booktype suomeksi" href="/feeds/atom/book/booktype-suomeksi/" /> 

 <link rel="alternate" type="application/rss+xml" title="RSS feed for chapter Viestintä" href="/feeds/rss/chapter/booktype-suomeksi/booktype-suomeksi/" /> 
 <link rel="alternate" type="application/atom+xml" title="Atom feed for chapter Viestintä" href="/feeds/atom/chapter/booktype-suomeksi/booktype-suomeksi/" /> 
 
 <script type="text/javascript" src="/site_static/js/draft.js"></script>


   <link type="text/css" href="/static/css/_user.css" rel="Stylesheet" >
 </head>
<body>

<div class="topbar"> 
  <div class="logotext"><a href="http://write.flossmanuals.net/">FLOSS Manuals</a> </div>

  <div class="meta-bar">
    
    <ul>
      <li>
        <a href="/accounts/signin/?redirect=/booktype-suomeksi/_draft/_v/1.0/viestinta/">Sign In / Create Account</a>
      </li>
    </ul>
    
    <div style="padding-top: 10px; padding-right: 15px;">
      <br/>
      

<script>
  $(function() {
    var $frm = $("FORM[name=changelang]");
	
    $("A[href=#]", $frm).click(function() {
        var lang = $(this).attr("class").substr(4);
	
        $("INPUT[name=language]", $frm).val(lang);
        $frm.submit();
	
        return false;
    });
  });
 </script>

<form name="changelang" method="POST" action="/accounts/i18n/setlang/?language=en-us">
  <input type="hidden" name="language" value="en-us">
  
    &nbsp;English&nbsp;|
  
  
  
    &nbsp;<a class="langes" href="#">Español</a>&nbsp;|
  

  
    &nbsp;<a class="langfr" href="#">Français</a>&nbsp;|
  
	
  
    &nbsp;<a class="langit" href="#">Italiano</a>&nbsp;|
  
	
  
    &nbsp;<a class="langpt" href="#">Português</a>&nbsp;|
  
	
  
    &nbsp;<a class="langru" href="#">Русский</a>&nbsp;|
  
	
  
    &nbsp;<a class="langsq" href="#">Shqip</a>
  	
</form>

    </div>
    
    
  </div><!-- End of .meta-bar -->
</div><!-- End top bar -->

<div class="menubar shadow">
  
  
  <div class="navbox">
    <ul>
      <li><a href="/list-books/">Books</a></li>
      <li><a href="/list-groups/">Groups</a></li>
      <li><a href="/list-people/">People</a></li>
    </ul>      
  </div><!-- End of .navbox -->       
</div>

<div class="content-container">
  <div class="content shadow">
    <!-- Content box and the drop shadow-->
    

<h2>Booktype suomeksi</h2>
<div class="padded">
 <div id="bookmenu" style="background: url(/site_static/images/draft_bg.png) repeat !important;"> 
  <ul>
   
    
      <li><b>Johdanto</b></li>
    
   
    
      <li><a href="/booktype-suomeksi/_draft/_v/1.0/booktype/">Booktype</a></li>
    
   
    
      <li><a href="/booktype-suomeksi/_draft/_v/1.0/kayttajatunnuksen-luominen/">Käyttäjätunnuksen luominen</a></li>
    
   
    
      <li><a href="/booktype-suomeksi/_draft/_v/1.0/kojelautani/">Kojelautani</a></li>
    
   
    
      <li><b>Kirjat</b></li>
    
   
    
      <li><a href="/booktype-suomeksi/_draft/_v/1.0/kirjan-luominen/">Kirjan luominen</a></li>
    
   
    
      <li><b>Luvut</b></li>
    
   
    
      <li><a href="/booktype-suomeksi/_draft/_v/1.0/lukujen-luominen/">Lukujen luominen</a></li>
    
   
    
      <li><a href="/booktype-suomeksi/_draft/_v/1.0/sisallysluettelo/">Sisällysluettelo</a></li>
    
   
    
      <li><a href="/booktype-suomeksi/_draft/_v/1.0/kuvien-lisaaminen/">Kuvien lisääminen</a></li>
    
   
    
      <li><b>Ihmiset</b></li>
    
   
    
      <li><a href="/booktype-suomeksi/_draft/_v/1.0/viestinta/">Viestintä</a></li>
    
   
    
      <li><b>Liitteet</b></li>
    
   
    
      <li><a href="/booktype-suomeksi/_draft/_v/1.0/kirjasta/">Kirjasta</a></li>
    
   
    
      <li><a href="/booktype-suomeksi/_draft/_v/1.0/lisenssi/">Lisenssi</a></li>
    
   
  </ul>
 </div>
 <div id="bookcontent"   style="background: url(/site_static/images/draft_bg.png) repeat !important;">
   

  <html lang="en"><head><title>Viestint&#228;</title></head><body><h1>Viestint&#228;</h1>
<p>Kun kirjan parissa tehd&#228;&#228;n yhteisty&#246;t&#228;, viestint&#228; on olennainen osa prosessia. Viestint&#228;&#228; tarvitaan vaikka kyseess&#228; olisi kirjapyr&#228;hdys tai hitaampi kirjoittamisprojekti, ovatpa kirjoittajat samassa tilassa tai tekev&#228;t yhteisty&#246;t&#228; verkossa. N&#228;m&#228; tilanteet vaativat erilaisia viestint&#228;tapoja ja n&#228;iden yhdist&#228;minen yhteen j&#228;rjestelm&#228;&#228;n on aihe, jota FLOSS Manuals on tutkinut k&#228;yt&#228;nn&#246;ss&#228;.</p>
<p>Booktype yhdist&#228;&#228; parhaat oppimamme viestint&#228;tavat. Booktypeen kuuluu ty&#246;kaluja, kuten ilmoitukset siit&#228;, kuka muokkaa mit&#228;kin tiedostoa, reaaliaikainen keskustelu, j&#228;rjestelm&#228;tason ilmoitukset, lukujen tilailmaisimet, kirjan valmistumisen mittarit, ty&#246;nkulkuty&#246;kalut ja reaaliaikainen k&#228;ytt&#228;jien tilalista.</p>
<h2>Mikroblogaus</h2>
<p><img src="static/ScreenHunter_12%20Jul.%2027%2001.33.gif" alt="" width="269" height="657"></p>
<p>Booktypess&#228; on sis&#228;&#228;nrakennettu mikroblogausj&#228;rjestelm&#228;, jonka k&#228;ytt&#228;minen on helppoa, jos olet tutustunut Identi.caan tai Twitteriin. Viestitagit ovat:&#160;</p>
<p><strong>@k&#228;ytt&#228;j&#228;tunnus</strong> - n&#228;m&#228; viestit menev&#228;t k&#228;ytt&#228;j&#228;lle</p>
<p><strong>!ryhm&#228;</strong> - n&#228;m&#228; viestit l&#228;hetet&#228;&#228;n ryhm&#228;lle</p>
<p><strong>&#8492;kirja</strong> - n&#228;m&#228; viestit k&#228;sittelev&#228;t kirjaa</p>
<p><strong>#tagi</strong> - tagij&#228;rjestelm&#228;, jonka viestit menev&#228;t tagin aikajanalle</p>
<p>Muuten viestinn&#228;ss&#228; on se ero, ett&#228; ett&#228; voit l&#228;hett&#228;&#228; tekstinp&#228;tk&#228;n valitsemalla mikroblogaustagin kirjan editorisivulla. Voit liitt&#228;&#228; mukaan my&#246;s valinnaisen kontekstiosoitteen.&#160;</p>
<h2>Reaaliaikaiset muokkausilmoitukset&#160;</h2>
<p>Kun olet napsauttanut muokkauslinkki&#228; luvun kohdalla ja joku muu tulee kirjan muokkausruutuun, sinun nimesi korvaa <strong>Muokkaa</strong>-linkin kirjan sis&#228;llysluettelossa. T&#228;m&#228; huomautus tapahtuu reaaliajassa, ja jos katsot yleisn&#228;kym&#228;&#228; jonkun painaessa jonkun luvun muokkauslinkki&#228;, n&#228;et muokkauslinkin muuttuvan kyseisen k&#228;ytt&#228;j&#228;n k&#228;ytt&#228;j&#228;tunnukseksi.</p>
<h2>Reaaliaikainen keskustelu</h2>
<p>Tullessasi kirjan muokkausruudulle n&#228;et kirjan keskustelulaatikon. Keskustelulaatikko on n&#228;kyvill&#228; sen aikaa kun muokkaat kirjaa, riippumatta siit&#228; mink&#228; luvun parissa ty&#246;skentelet. Kaikki muut kirjan muokkaajat n&#228;kev&#228;t my&#246;s keskustelulaatikon ja voit keskustella heid&#228;n kanssaan kirjoittamalla suoraan tekstikentt&#228;&#228;n keskustelulaatikon alla. T&#228;m&#228; ominaisuus on hy&#246;dyllinen kirjapyr&#228;hdysten et&#228;osallistujen kanssa viestitt&#228;ess&#228; sek&#228; aina kun useammat kirjoittajat ty&#246;skentelev&#228;t kirjan parissa samaan aikaan.</p>
<p>Muutakin tietoa voidaan viestitt&#228;&#228; keskustelulaatikon avulla. Kun kirjoittaja saapuu kirjan muokkauruutuun, teksti <strong>Liittynyt</strong> ilmestyy heid&#228;n nimens&#228; yhteydess&#228; keskustelulaatikkoon. Joten kuka tahansa kirjaa jo muokkaava voi n&#228;hd&#228;, ett&#228; joku muukin on saapunut muokkaustilaan, jolloin he voivat aloittaa viestinn&#228;n.</p>
<h2>Reaaliaikainen k&#228;ytt&#228;jien tilalistaus</h2>
<p>Keskustelulaatikon alla on lista kirjan parissa t&#228;ll&#228; hetkell&#228; ty&#246;skentelevist&#228; k&#228;ytt&#228;jist&#228;. T&#228;m&#228;n listan lis&#228;ominaisuus on se, ett&#228; se ei n&#228;yt&#228; ainoastaan k&#228;ytt&#228;j&#228;nimi&#228;, vaan my&#246;s "mit&#228; ajattelen" -tekstin, joka otetaan profiilisivultasi. T&#228;m&#228; lausunto auttaa kommunikoimaan suunnitelmasi muille (esimerkiksi "Korjaan johdantoluvun muotoilua") tai v&#228;litt&#228;m&#228;&#228;n tunteitasi ("Minulla on paha p&#228;iv&#228;, en tahdo puhua...").</p>
<h2>Systeemitason ilmoitukset</h2>
<p>Systeemitason ilmoituksia luodaan, kun seuraavia toimenpiteit&#228; suoritetaan:</p>
<ul><li>Kun k&#228;ytt&#228;j&#228; tallentaa luvun</li>
<li>Kun k&#228;ytt&#228;j&#228; luo uuden luvun</li>
<li>Kun k&#228;ytt&#228;j&#228; nime&#228;&#228; luvun uudelleen</li>
<li>Kun k&#228;ytt&#228;j&#228; muuttaa luvun tilaa</li>
<li>Kun k&#228;ytt&#228;j&#228; luo uuden osan kirjaan</li>
<li>Kun kirja julkaistaan</li>
<li>Kun k&#228;ytt&#228;j&#228; tallentaa kirjan muistiinpanot</li>
</ul><p>Booktype luo ja n&#228;ytt&#228;&#228; viestit kahdella tavalla: keskustelulaatikossa ja k&#228;ytt&#228;en muokkaussivun historiav&#228;lilehte&#228;.&#160;</p>
<h2>Keskustelulaatikko</h2>
<p>Kun joku edellisist&#228; toiminnoista suoritetaan keskustelulaatikko n&#228;ytt&#228;&#228; <strong>INFO</strong>-merkin ja lyhyen kuvauksen tapahtuneesta toiminnosta. T&#228;m&#228; ilmoitus on eritt&#228;in hy&#246;dyllinen kirjapyr&#228;hdyksess&#228;, jossa monet osallistujat tekev&#228;t yhteisty&#246;t&#228; kirjan parissa samaan aikaan. Jokainen osallistuja pidet&#228;&#228;n ajan tasalla muiden edistyksest&#228; ja he voivat v&#228;litt&#246;m&#228;sti vastata kaikkiin ilmoituksiin keskustelulaatikossa.&#160;</p>
<h2>Historia-v&#228;lilehti</h2>
<p><strong>Historia-v&#228;lilehti</strong> on <strong>Luvut-v&#228;lilehden</strong> vieress&#228; <strong>Muokkaussivulla</strong>. Historia-v&#228;lilehden napsauttaminen lataa listan kaikista muokkauksista, joita kirjaan on tehty. (Huomaa: kyps&#228;n kirjan tapauksessa listan lataaminen voi kest&#228;&#228; kauan, sill&#228; muutoksia on tehty paljon). Aina kun yksi edellisist&#228; toiminnoista tehd&#228;&#228;n, uusi kohta lis&#228;t&#228;&#228;n <strong>Historia</strong>-v&#228;lilehteen.</p>
<p><img src="http://fi.flossmanuals.net/booki/_booki/booki/static/historiavalilehti.png" alt="" width="500" height="85"></p>
<p>Historia-v&#228;lilehti on jaettu kolmeen sarakkeeseen: <strong>toimi</strong>, <strong>k&#228;ytt&#228;j&#228;</strong> ja <strong>aika</strong>. <strong>Toimi</strong>-sarake listaa tapahtumatyypin ja tarvittaessa siin&#228; on lis&#228;tietoja tapahtumasta. Jos tapahtuma oli esimerkiksi <strong>luo</strong> tai <strong>tallenna</strong>, kohdassa on luodun tai tallennetun luvun nimi. <strong>K&#228;ytt&#228;j&#228;</strong>-sarake listaa Booktypen k&#228;ytt&#228;j&#228;n, joka on tehnyt toiminnon. Toiminnon p&#228;iv&#228;m&#228;&#228;r&#228; ja aika tallennetaan sarakkeeseen <strong>aika</strong>.</p>
<p>N&#228;hd&#228;kseen enemm&#228;n yksityiskohtia k&#228;ytt&#228;j&#228; voi napsauttaa alleviivattua luvun nime&#228; toimintosarakkeessa, joka lataa historiasivun kyseiselle luvulle.</p>
<p>Jos luvun muokkaus on ollut hyvin pieni, esimerkiksi kirjoitusvirheen korjaus, tekij&#228; voi est&#228;&#228; sen n&#228;kymisen historiasivuilla. T&#228;m&#228; tehd&#228;&#228;n k&#228;ytt&#228;m&#228;ll&#228; <strong>Pieni muutos, &#228;l&#228; ilmoita</strong>-laatikko luvun muokkauspaneelin alaosassa. Ruudun rastiminen est&#228;&#228; historiamerkinn&#228;n luomisen lukua tallennettaessa.&#160;</p>
<p>Kirjoittaja voi my&#246;s lis&#228;t&#228; historiaan kommentteja k&#228;ytt&#228;en kolmea tekstilaatikkoa <strong>Pieni muutos, &#228;l&#228; ilmoita</strong> -ruudun alla. Ensimm&#228;inen laatikko on <strong>yleinen kommenttilaatikko</strong>, jonka alla on <strong>Tekij&#228;</strong> -tekstilaatikko, johon kirjoittaja voi kirjoittaa nimens&#228;. Viimeinen tekstilaatikko on <strong>&#7728;irjoittajan kommentti</strong> -laatikko, johon kirjoittaja voi kirjoittaa viel&#228; yhden muistiinpanon. N&#228;ihin laatikoihin kirjoitetut kommentit lis&#228;t&#228;&#228;n historiaan kun luku tallennetaan.</p>
<h2>Luvun historia</h2>
<p>Historiav&#228;lilehdest&#228; n&#228;et kirjan muutokset, mutta sen avulla voit n&#228;hd&#228; my&#246;s yksitt&#228;isten lukujen muutokset. Luvun nimen napsauttaminen toimintosarakkeessa vie sinut luvun historia -sivulle. T&#228;ss&#228; n&#228;et kaikki lukuun tehdyt muutokset sen luomisesta uusimpaan muutokseen asti. Luvun historia listaa versionumeron, jossa uusin versio on ylimp&#228;n&#228;, se sis&#228;lt&#228;&#228; my&#246;s version tehneen k&#228;ytt&#228;j&#228;n, muutoksen tallentamisen kellonajan ja p&#228;iv&#228;m&#228;&#228;r&#228;n, sek&#228; kirjoittajan yleiskommenttilaatikkoon kirjoittamat kommentit.&#160;</p>
<p><strong>Vertaa</strong>-sarakkeessa voit vertailla eroja kahden version v&#228;lill&#228;. Valitse vasemmalla oleva radionappi yhdest&#228; versiosta ja oikealla oleva radionappi toisesta versiosta ja napsauta <strong>Vertaa revisioita</strong> -nappia n&#228;hd&#228;ksesi erot kahden luvun v&#228;lill&#228;.</p>
<p><strong>Historia</strong>-v&#228;lilehden tiedot voivat olla eritt&#228;in hy&#246;dyllisi&#228; ty&#246;skennelt&#228;ess&#228; kirjan parissa pitkill&#228; aikav&#228;leill&#228;, jolloin kirjoittajat eiv&#228;t usein ole kirjautuneina Booktypeen samaan aikaan. Se voi n&#228;ytt&#228;&#228; mit&#228; muokkauksia muut kirjoittajat ovat tehneet edellisen kirjautumisen j&#228;lkeen, mik&#228; auttaa n&#228;kem&#228;&#228;n kirjan tilanteen ja p&#228;&#228;ttelem&#228;&#228;n mit&#228; kirjalle tarvitsee tehd&#228;. T&#228;m&#228; on erityisen hy&#246;dyllist&#228;, jos kirjoittaja on lis&#228;nnyt kommentteja, jotka kuvailevat tehty&#228; muutosta. N&#228;in on helppoa n&#228;hd&#228; millaista lis&#228;ty&#246;t&#228; tarvitaan luvun viimeistelemiseen.&#160;</p>
<h2>Kirjan muistiinpanot&#160;</h2>
<p>Kirjan muistiinpanoissa kirjoittajat voivat lis&#228;t&#228; kommentteja ja keskustella kirjasta kokonaisuutena. Mit&#228; tahansa voidaan lis&#228;t&#228; kirjan kommentteihin, esimerkiksi ehdotus kirjan rakenteeksi tai luonnos sen sis&#228;ll&#246;st&#228;, kommentteja kirjan nopeasti huomiota vaativista osista ja jopa ehdotuksia kirjan omaksumasta tyylist&#228;. Kirjan muistiinpanoihin p&#228;&#228;st&#228;&#228;n <strong>Muistiinpanot</strong>-v&#228;lilehdest&#228; kirjan muokkaussivulta.</p>
<p>Muistiinpanosivulla on vapaa tekstikentt&#228;, johon voit kirjoittaa niin paljon tai v&#228;h&#228;n kuin tahdot. Kun olet lis&#228;nnyt muistiinpanosi, napsauta <strong>Tallenna muistiinpanot </strong>-nappia <strong>Muistiinpanot</strong>-v&#228;lilehdess&#228; tallentaaksesi muutoksesi. Keskustelulaatikkoon ilmestyy viesti, jossa kerrotaan muistiinpanojen tallentamisesta.</p></body></html>
   
  </div>
 </div>


  </div>
</div>
<!-- End of content -->



<!-- sputnik error page -->
<div id="dialog-sputnik-qrac" style="display: none"></div>
<div id="dialog-sputnik-error" title="Can't communicate with booktype">
  <p>
    <span class="ui-icon ui-icon-circle-check" style="float:left; margin:0 7px 50px 0;"></span>
    There has been error in communication with Booktype server.
    Not sure right now where is the problem.
  </p>
  <p>
    You should refresh this page.
  </p>
</div>


<ul class="strings template">
 <li class="ok">OK</li>
 <li class="back">Back</li>
 <li class="create">Create</li>
 <li class="cancel">Cancel</li>
 <li class="next">Next</li>
 <li class="import">Import</li>
 <li class="savechanges">Save changes</li>
 <li class="errorcreategroup">Couldn't create a group!</li>
 <li class="msgepub">enter epub URL</li>
 <li class="msgarchive">enter Archive.org ID</li>
 <li class="msgwiki">enter Wikibooks URL</li>
 <li class="msgbooktype">enter Booktype URL</li>
 <li class="deletebook">Delete book</li>
</ul>

</body>
</html>

