
<!DOCTYPE HTML>
<html>
 <head>
   

<link type="text/css" href="/site_static/css/booki.css" rel="Stylesheet" >
<link type="text/css" href="/site_static/js/jquery/themes/base/jquery.ui.all.css" rel="Stylesheet" >
<link type="text/css" href="/site_static/js/jquery/themes/smoothness/jquery.ui.all.css" rel="Stylesheet" >
<script type="text/javascript" src="/site_static/js/jquery/jquery-1.4.4.js"></script>
<script type="text/javascript" src="/site_static/js/jquery/ui/jquery-ui-1.8.10.custom.js"></script>
<script type="text/javascript" src="/site_static/js/jquery.json-1.3.js"></script>
<script type="text/javascript" src="/site_static/js/booki.js"></script>
<script src="/site_static/js/messaging.js" type="text/javascript"></script>   
<script type="text/javascript" src="/site_static/js/general.js"></script>
<link href="/site_static/css/jquery.bubblepopup.v2.3.1.css" rel="stylesheet" type="text/css" />
<link type="text/css" href="/site_static/css/jquery-ui_overrides.css" rel="Stylesheet" >
<script src="/site_static/js/jquery.bubblepopup.v2.3.1.min.js" type="text/javascript"></script>

<link rel="SHORTCUT ICON" href="http://write.flossmanuals.net/site_static/images/favicon.ico" type="image/x-icon">
<meta property="og:site_name" content="FLOSS Manuals"/><meta name="description" content="Free Manuals for Freedom"/>

<script type="text/javascript">
  $(function() {
      $.booki.sputnikDispatcherURL = "/_sputnik/";

      $("#dialog-sputnik-error").dialog({
          modal: true,
          autoOpen: false,
          buttons: {
            Ok: function() {
               $(this).dialog('close');
               window.location = '.';
            }
          }
      });
  
      $("FORM.messagefield").messagefield('init', {'view_post': '/messaging/post' });  
  });
</script>


   
 <title>/chapter: Johdanto / OpenStreetMap suomeksi</title>
 <link type="text/css" href="/site_static/css/draft.css" rel="Stylesheet" />

 <link rel="alternate" type="application/rss+xml" title="RSS feed for OpenStreetMap suomeksi" href="/feeds/rss/book/openstreetmap-suomeksi/" /> 
 <link rel="alternate" type="application/atom+xml" title="Atom feed for OpenStreetMap suomeksi" href="/feeds/atom/book/openstreetmap-suomeksi/" /> 

 <link rel="alternate" type="application/rss+xml" title="RSS feed for chapter Johdanto" href="/feeds/rss/chapter/openstreetmap-suomeksi/openstreetmap-suomeksi/" /> 
 <link rel="alternate" type="application/atom+xml" title="Atom feed for chapter Johdanto" href="/feeds/atom/chapter/openstreetmap-suomeksi/openstreetmap-suomeksi/" /> 
 
 <script type="text/javascript" src="/site_static/js/draft.js"></script>


   <link type="text/css" href="/static/css/_user.css" rel="Stylesheet" >
 </head>
<body>

<div class="topbar"> 
  <div class="logotext"><a href="http://write.flossmanuals.net/">FLOSS Manuals</a> </div>

  <div class="meta-bar">
    
    <ul>
      <li>
        <a href="/accounts/signin/?redirect=/openstreetmap-suomeksi/_draft/_v/1.0/johdanto/">Sign In / Create Account</a>
      </li>
    </ul>
    
    <div style="padding-top: 10px; padding-right: 15px;">
      <br/>
      

<script>
  $(function() {
    var $frm = $("FORM[name=changelang]");
	
    $("A[href=#]", $frm).click(function() {
        var lang = $(this).attr("class").substr(4);
	
        $("INPUT[name=language]", $frm).val(lang);
        $frm.submit();
	
        return false;
    });
  });
 </script>

<form name="changelang" method="POST" action="/accounts/i18n/setlang/?language=en-us">
  <input type="hidden" name="language" value="en-us">
  
    &nbsp;English&nbsp;|
  
  
  
    &nbsp;<a class="langes" href="#">Español</a>&nbsp;|
  

  
    &nbsp;<a class="langfr" href="#">Français</a>&nbsp;|
  
	
  
    &nbsp;<a class="langit" href="#">Italiano</a>&nbsp;|
  
	
  
    &nbsp;<a class="langpt" href="#">Português</a>&nbsp;|
  
	
  
    &nbsp;<a class="langru" href="#">Русский</a>&nbsp;|
  
	
  
    &nbsp;<a class="langsq" href="#">Shqip</a>
  	
</form>

    </div>
    
    
  </div><!-- End of .meta-bar -->
</div><!-- End top bar -->

<div class="menubar shadow">
  
  
  <div class="navbox">
    <ul>
      <li><a href="/list-books/">Books</a></li>
      <li><a href="/list-groups/">Groups</a></li>
      <li><a href="/list-people/">People</a></li>
    </ul>      
  </div><!-- End of .navbox -->       
</div>

<div class="content-container">
  <div class="content shadow">
    <!-- Content box and the drop shadow-->
    

<h2>OpenStreetMap suomeksi</h2>
<div class="padded">
 <div id="bookmenu" style="background: url(/site_static/images/draft_bg.png) repeat !important;"> 
  <ul>
   
    
      <li><a href="/openstreetmap-suomeksi/_draft/_v/1.0/johdanto/">Johdanto</a></li>
    
   
    
      <li><a href="/openstreetmap-suomeksi/_draft/_v/1.0/yhteisollisen-kartanteon-loytaminen/">Yhteisöllisen kartanteon löytäminen</a></li>
    
   
    
      <li><a href="/openstreetmap-suomeksi/_draft/_v/1.0/tervetuloa-openstreetmapin-kayttajaksi/">Tervetuloa OpenStreetMapin käyttäjäksi</a></li>
    
   
    
      <li><a href="/openstreetmap-suomeksi/_draft/_v/1.0/tasta-kirjasta/">Tästä kirjasta</a></li>
    
   
    
      <li><a href="/openstreetmap-suomeksi/_draft/_v/1.0/aloittaminen/">Aloittaminen</a></li>
    
   
    
      <li><a href="/openstreetmap-suomeksi/_draft/_v/1.0/ensimmainen-muokkauksesi/">Ensimmäinen muokkauksesi</a></li>
    
   
    
      <li><a href="/openstreetmap-suomeksi/_draft/_v/1.0/tiedon-keraaminen-gps-vastaanottimella/">Tiedon kerääminen GPS-vastaanottimella</a></li>
    
   
    
      <li><a href="/openstreetmap-suomeksi/_draft/_v/1.0/tiedon-keraaminen-paperilla-ja-kynalla/">Tiedon kerääminen paperilla ja kynällä</a></li>
    
   
    
      <li><a href="/openstreetmap-suomeksi/_draft/_v/1.0/karttojen-jakaminen/">Karttojen jakaminen</a></li>
    
   
    
      <li><a href="/openstreetmap-suomeksi/_draft/_v/1.0/openstreetmapin-editoiminen/">OpenStreetMapin editoiminen</a></li>
    
   
    
      <li><a href="/openstreetmap-suomeksi/_draft/_v/1.0/johdanto-openstreetmapin-editointiin/">Johdanto OpenStreetMapin editointiin</a></li>
    
   
    
      <li><a href="/openstreetmap-suomeksi/_draft/_v/1.0/editointi-potlatch-2-editorilla/">Editointi Potlatch 2 -editorilla</a></li>
    
   
    
      <li><a href="/openstreetmap-suomeksi/_draft/_v/1.0/johdanto-editointiin-josmilla/">Johdanto editointiin JOSMilla</a></li>
    
   
    
      <li><a href="/openstreetmap-suomeksi/_draft/_v/1.0/osm-kartan-editointi-josmilla/">OSM-kartan editointi JOSMilla</a></li>
    
   
    
      <li><a href="/openstreetmap-suomeksi/_draft/_v/1.0/viela-lisaa-josmia/">Vielä lisää JOSMia</a></li>
    
   
    
      <li><a href="/openstreetmap-suomeksi/_draft/_v/1.0/editointi-mobiilieditoreilla/">Editointi mobiilieditoreilla</a></li>
    
   
    
      <li><a href="/openstreetmap-suomeksi/_draft/_v/1.0/tee-kartasta-omasi/">Tee kartasta omasi</a></li>
    
   
    
      <li><a href="/openstreetmap-suomeksi/_draft/_v/1.0/ota-openstreetmap-mukaasi/">Ota OpenStreetMap mukaasi</a></li>
    
   
    
      <li><a href="/openstreetmap-suomeksi/_draft/_v/1.0/openstreetmapin-tietomalli/">OpenStreetMapin tietomalli</a></li>
    
   
    
      <li><a href="/openstreetmap-suomeksi/_draft/_v/1.0/lisatietoa/">Lisätietoa</a></li>
    
   
    
      <li><a href="/openstreetmap-suomeksi/_draft/_v/1.0/tutkimusmatka-openstreetmap-yhteisoon/">Tutkimusmatka OpenStreetMap-yhteisöön</a></li>
    
   
    
      <li><a href="/openstreetmap-suomeksi/_draft/_v/1.0/hyodylliset-verkkosivut-ja-lahteet/">Hyödylliset verkkosivut ja lähteet</a></li>
    
   
    
      <li><a href="/openstreetmap-suomeksi/_draft/_v/1.0/tekijat/">Tekijät</a></li>
    
   
  </ul>
 </div>
 <div id="bookcontent"   style="background: url(/site_static/images/draft_bg.png) repeat !important;">
   

  <h1><span style="font-size: 2em;">Yhteis&ouml;llisen kartanteon l&ouml;yt&auml;minen&nbsp;</span></h1>
<p><em>"Karttojen tekeminen yhdess&auml; muiden kanssa tarkoittaa&nbsp;</em>kollektiivisten kokemusten sovittamista yhteen, toistuvien kaavojen oivaltamista ja kollektiivisten kokemusten mahdollistavien perimm&auml;isten vaikutttimien jaettua ymm&auml;rt&auml;mist&auml;.<em>"<span id="InsertNoteID_1_marker1" class="InsertNoteMarker"><sup><a href="yhteisollisen-kartanteon-loytaminen#InsertNoteID_1">1</a></sup></span></em></p>
<p class="title" align="right"><span class="byline">Eli Moore ja Catalina Garz&oacute;n,</span>&nbsp;<br /><em>Social Cartography: The Art of Using Maps to Build Community Power,&nbsp;<br /></em><a href="http://urbanhabitat.org/17-2/intro">Weaving the Threads</a>&nbsp;Vol. 17, No. 2, 2010</p>
<p>Varhaisia esimerkkej&auml; kartoista ovat merkinn&auml;t poluista hyville mets&auml;stysmaille tai puhtaan veden luo, joista molemmat olivat tarpeellisia sivilisaatioiden rakentamista varten. Nyky-yhteiskunnassa paikkatieto auttaa meit&auml; saavuttamaan muita p&auml;&auml;m&auml;&auml;ri&auml; tarkentamalla paikkojen sijainnin ja sill&auml; on yht&auml; suuri rooli el&auml;m&auml;mme laadun parantamisessa.&nbsp;</p>
<p>Kartat auttava vastaamaan kysymyksiin, kuten "kuinka p&auml;&auml;sen kouluun turvallisesti polkupy&ouml;r&auml;ll&auml;". Viel&auml; kiireellisempi kysymys voisi olla "kuinka p&auml;&auml;sen l&auml;himp&auml;&auml;n sairaalaan h&auml;t&auml;tilanteessa". Julkisten ja kaupallisten rakennusten sijainnin m&auml;&auml;rittely ja n&auml;iden sijaintien v&auml;listen suhteiden m&auml;&auml;rittely on aina ollut hy&ouml;dyllist&auml;, jopa v&auml;ltt&auml;m&auml;t&ouml;nt&auml;, kaikkialla el&auml;ville ihmisille.&nbsp;</p>
<p>Kaikista n&auml;ist&auml; syist&auml; ihmisist&auml; tuntuu luonnolliselta tehd&auml; yhteisty&ouml;t&auml; kartoituksen parissa. Kaikki kartat eiv&auml;t kuitenkaan ole avoimesti muokattavissa ja vapaasti k&auml;ytett&auml;viss&auml;. T&auml;m&auml; tarve tuottaa ja jakaa tietoa on yhteisty&ouml;n syd&auml;mess&auml;. Kartoitus yhteisty&ouml;ss&auml; on tapa ker&auml;t&auml; t&auml;t&auml; informaatiota ja jakaa se muiden kanssa, OpenStreetMap on voimakas tekij&auml; t&auml;ss&auml; suuremmassa liikkeess&auml;. T&auml;m&auml; luku esittelee sinulle yhteisty&ouml;kartoituksen aihepiirin laajemmassa mieless&auml;, eli k&auml;sittelee muutakin kuin OpenStreetMapia.&nbsp;</p>
<p>&nbsp;</p>
<h2>Mit&auml; kartoitus yhteisty&ouml;ss&auml; on?&nbsp;</h2>
<p>Ajattelepa, jos yst&auml;v&auml;si tahtoisi korjauttaa kenk&auml;ns&auml;. Voisit kertoa h&auml;nelle suutarista, jossa sen voisi tehd&auml;, mutta se ei v&auml;ltt&auml;m&auml;tt&auml; olisi paras mahdollinen suutari. Voisit tehd&auml; kartan kaikista suutareista, mutta seh&auml;n olisi iso urakka? Ent&auml;p&auml; jos yst&auml;v&auml;si voisivat auttaa sinua tekem&auml;&auml;n tuon kartan? Tai viel&auml; parempi, mit&auml; jos kaikki maailman ihmiset voisivat auttaa? T&auml;m&auml; on yhteis&ouml;llisen kartoituksen perusta.&nbsp;</p>
<p>Yhteis&ouml;kartoittamista on my&ouml;s kutsuttu talkoistamiskartoitukseksi ja vapaaehtoiseksi maantieteellisen tiedon ker&auml;&auml;miseksi. Koska kyse on uudesta karttojen tekemisen tekniikasta, se on uusmaantiedon alalaji. Ideana on, ett&auml; joukko ihmisi&auml; voi ty&ouml;skennell&auml; yhdess&auml; ker&auml;t&auml;kseen tietoa. T&auml;m&auml; tieto voi olla hyvin yksityiskohtaista, esimerkiksi kartta alueen kaikista suutareista, tai yleisluontoisempaa, kuten "vapaa koko maailman kartta". On monia erilaisia ty&ouml;kaluja ja syit&auml; tehd&auml; yhteis&ouml;karttoja.&nbsp;</p>
<h2>Miksi tahtoisin osallistua yhteis&ouml;kartoitukseen?&nbsp;</h2>
<p>On monta erilaista syyt&auml; osallistua yhteis&ouml;kartoitukseen. Ehk&auml; sinulla on hyvin painava syy ja tahdot auttaa yhteis&ouml;&auml;si luomaan turvallisuuskartan, joka osoittaa kaikkien paikallisten sairaaloiden ja h&auml;t&auml;palveluiden sijainnit. Ehk&auml; tahdot etsi&auml; ja osoittaa kaikki paikalliset ilmaisen veden l&auml;hteet. Jos olet retkeilij&auml;, voit tahtoa jakaa suosikkipaikkasi ja l&ouml;yt&auml;&auml; uusia lukemalla muiden tekemi&auml; karttoja. Tai ehk&auml; olet opettaja ja tahdot opettaa karttojen k&auml;ytt&ouml;&auml; oppilaillesi. Tuntuvatko n&auml;m&auml; ideat sinusta mielenkiintoisilta? Ehk&auml; sinulla on jo joitain omia ideoita &ndash; toivottavasti yhteis&ouml;kartoittaminen voi auttaa sinua ideasi toteuttamisessa.&nbsp;</p>
<h2>Mit&auml; tunnettuja yhteis&ouml;kartoituksen projekteja ja ty&ouml;kaluja on olemassa?&nbsp;</h2>
<p>On olemassa monta tapaa tehd&auml; kartta yhteisty&ouml;ss&auml;. Helpointa on istua p&ouml;yd&auml;n &auml;&auml;reen muiden kanssa ja k&auml;ytt&auml;&auml; kyn&auml;&auml; ja paperia. Vaikka luomisprosessi on yhteis&ouml;llinen, kyn&auml;ll&auml; ja paperilla teht&auml;v&auml; kartta ei v&auml;ltt&auml;m&auml;tt&auml; ole helppo tapa tehd&auml; yhteisty&ouml;t&auml; kuin pienen ryhm&auml;n kanssa, joka mahtuu istumaan paperinpalan ymp&auml;rille. Vaikka paperinpala olisi todella iso, paperin ymp&auml;rille mahtuvaa ihmisjoukkoa rajoittavat fyysiset seikat. OpenStreetMap antaa suurten ryhmien ty&ouml;skennell&auml; karttojen parissa elektronisesti, mik&auml; mahdollistaa paljon suuremmat ihmisjoukot. Mutta n&auml;m&auml; eiv&auml;t ole ainoat vaihtoehdot. Kyn&auml;n ja paperin sek&auml; OpenStreetMapin ymp&auml;rill&auml; olevien ty&ouml;kalujen lis&auml;ksi on monia tapoja tehd&auml; jaettavia yhteis&ouml;karttoja.&nbsp;</p>
<h3>WikiMapia</h3>
<p>WikiMapia (<a href="http://wikimapia.org/">http://wikimapia.org</a>) m&auml;&auml;rittelee itsens&auml; "muokattavaksi verkkokartaksi - voit kuvailla mit&auml; tahansa paikkaa maailmassa. Tai tutki vain karttaa ja l&ouml;yd&auml; tuhansia jo merkittyj&auml; sijainteja." WikiMapian avulla voit lis&auml;t&auml; toimistorakennuksia, ravintoloita, puistoja ja kyli&auml; muutamia vaihtoehtoja nimet&auml;ksemme. WikiMapian ideana on, ett&auml; on yksi yhteis&ouml;kartta, jonka parissa kaikki ty&ouml;skentelev&auml;t yhdess&auml;. Et tarvitse k&auml;ytt&auml;j&auml;tili&auml; lis&auml;t&auml;ksesi tietoa WikiMapiaan tai katsoaksesi tietoa, jonka muut ovat jo lis&auml;nneet. Tarvitset k&auml;ytt&auml;j&auml;tilin (ja tietyn m&auml;&auml;r&auml;n projektiin lis&auml;ttyj&auml; tietoja) muuttaaksesi paikkoja, jotka muut ihmiset ovat lis&auml;nneet.&nbsp;</p>
<h3>Ushahidi</h3>
<p>Ushahidi (<a href="http://ushahidi.com/">http://ushahidi.com</a>) on avoimen l&auml;hdekoodin ohjelmistosovellus, joka mahdollistaa raporttien talkoistamisen, sek&auml; n&auml;iden raporttien visualisoinnin kartalla ja aikajanalla. Aluksi sit&auml; k&auml;ytettiin v&auml;kivaltaisten tapahtumien raportointiin Kenian vaalien j&auml;lkeisten v&auml;kivaltaisuuksien aikaan vuosina 2007&ndash;2008. T&auml;n&auml;&auml;n monet eri yhteis&ouml;kartoitusprojektit k&auml;ytt&auml;v&auml;t sit&auml;. Ushahidin ideana on, ett&auml; k&auml;ytt&auml;j&auml;t voivat l&auml;hett&auml;&auml; "raportteja" suoraan Ushahidi-sovelluksen kautta, sosiaalisten verkostojen kautta tai jopa SMS-viestill&auml;. Voit nopeasti perustaa Ushahidin version k&auml;ytt&auml;m&auml;ll&auml; CrowdMapia (<a href="http://crowdmap.com/">http://crowdmap.com</a>) tai lataamalla l&auml;hdekoodin ja ajamalla sit&auml; omalla palvelimellasi.&nbsp;</p>
<h3>Google Map Maker</h3>
<p>Google Map Maker (<a href="http://www.google.com/mapmaker">http://www.google.com/mapmaker</a>) on tapa muokata Google Mapsissa ja Google Earthissa olevaa tietoa. Esimerkkej&auml; tiedosta, jonka voit lis&auml;t&auml;, ovat esimerkiksi puuttuvat tai v&auml;&auml;rin merkityt tiet ja mielenkiinnon kohteet. Uusien k&auml;ytt&auml;jien tekev&auml;t muokkaukset arvostellaan ennen niiden julkaisua. Tietyiss&auml; osissa maailmaa uusi karttatieto arvioidaan aina ennen sen julkista n&auml;ytt&auml;mist&auml;.&nbsp;</p>
<h3>Google MyMaps</h3>
<p>Google MyMaps (<a href="http://maps.google.com/maps/mm)">http://maps.google.com/maps/mm)</a>&nbsp;on v&auml;lilehti Google Mapsissa, se antaa sinun tallentaa tietoa omaan karttaasi. Voit valita, tahdotko karttasi olevan julkinen vai yksityinen, tai jakaa sen vain muutamien ihmisten kanssa, joilla on linkki siihen. Voit my&ouml;s kutsua tiettyj&auml; ihmisi&auml; tekem&auml;&auml;n yhteisty&ouml;t&auml; kanssasi tai laittaa karttasi koko maailman saataville.&nbsp;</p>
<h2>Miksi tahtoisin tehd&auml; yhteis&ouml;kartoitusta OpenStreetMapilla?</h2>
<p>Kuten edell&auml; mainitut esimerkit osoittavat, yhteis&ouml;lliseen kartantekoon on monia vaihtoehtoja. Jotkut n&auml;ist&auml; ovat hyvin samankaltaisia kuin OpenStreetMap, toiset ovat erilaisia. Eri ty&ouml;kalut ovat usein OpenStreetMapia t&auml;ydent&auml;vi&auml;. Esimerkiksi monet Ushahidi-asennukset k&auml;ytt&auml;v&auml;t OpenStreetMapia peruskarttanaan, mik&auml; n&auml;ytt&auml;&auml; palvelun k&auml;ytt&auml;jille kaiken jo (kollektiivisesti) kartoitetun tiedon tarjoten kontekstin uusille saapuville raporteille. Ushahidia k&auml;ytt&auml;v&auml;t voivat k&auml;ytt&auml;&auml; OpenStreetMappi&auml; lis&auml;t&auml;kseen viitetietoja ker&auml;&auml;m&auml;&auml;ns&auml; informaatioon.</p>
<p><img src="static/osm_logo-caccd6371f095ca973c373b8e2014896.png" alt="" width="120" height="120" />&nbsp;</p>
<p><em>OpenStreetMap-logo&nbsp;</em></p>
<p>Yksi OpenStreetMapin vahvuuksista on avoin lisenssi. Kuka tahansa voi k&auml;ytt&auml;&auml; OpenStreetMap-tietoa omiin tarkoituksiinsa, jopa kaupallisiin tarkoituksiin. Ainoat vaatimukset ovat, ett&auml; sinun t&auml;ytyy mainita OpenStreetMap ja sen osallistujat, kun k&auml;yt&auml;t tietoa ja sinun t&auml;ytyy julkaista kaikki tietoon tekem&auml;si parannukset vastaavalla lisenssill&auml;.&nbsp;</p>
<p>Toinen ero OpenStreetMapin ja joidenkin muiden yll&auml; mainittujen yhteis&ouml;kartoitusty&ouml;kalujen v&auml;lill&auml; on se, ett&auml; jokainen muokkaa samaa karttaa. T&auml;llainen tiedonker&auml;ysmenetelm&auml; mahdollistaa suuremman yksityiskohtien m&auml;&auml;r&auml;n lis&auml;&auml;misen monesta tiedon l&auml;hteest&auml;, ja est&auml;&auml; tiedon hajaantumisen ja jumiutumisen eri projekteihin.&nbsp;</p>
<p>On t&auml;rke&auml;&auml; tehd&auml; ero OpenStreetMapin ja muiden verkkokarttojen v&auml;lille. Bingin, Google Mapsin ja MapQuestin p&auml;&auml;tavoite on n&auml;ytt&auml;&auml; hakutuloksia ja tehd&auml; rahaa ne omistaville firmoille. Joissain tapauksissa n&auml;iss&auml; kartoissa on ty&ouml;kalut, jotka antavat k&auml;ytt&auml;j&auml;n laittaa oma tietonsa karttojen p&auml;&auml;lle ja n&auml;ytt&auml;&auml; se tietyll&auml; tavalla - mutta ent&auml; jos tahdot tehd&auml; enemm&auml;n? N&auml;ist&auml; j&auml;rjestelmist&auml; poiketen OpenStreetMapin ensisijainen tarkoitus on tarjota k&auml;ytt&auml;j&auml;lle p&auml;&auml;sy karttatietoihin. T&auml;m&auml; antaa kenen tahansa k&auml;ytt&auml;&auml; tietoa kuten haluaa. Voit luoda kokonaan uusia ja j&auml;nnitt&auml;vi&auml; karttoihin perustuvia sovelluksia, vain mielikuvituksesi on rajana. &nbsp;</p>
<p>Lis&auml;ksi OpenStreetMapilla on suuri yhteis&ouml;. On yli 450&nbsp;000 ihmist&auml;, jotka ovat luoneet k&auml;ytt&auml;j&auml;tunnuksen. T&auml;h&auml;n yhteis&ouml;&ouml;n kuuluu yksil&ouml;it&auml;, jotka lis&auml;&auml;v&auml;t tietoa kartalle, toiset ohjelmoivat editointiin tarvittavat kartat, jotkut muut luovat erikoistuneita karttoja OpenStreetMapin tiedosta. OpenStreetMapista kiinnostuneet ihmiset tapaavat eri puolilla maailmaa jakaakseen tekniikoitaan, kartoittaakseen paikallisia sijainteja, oppimaan toisiltaan ja vain tapaamaan sosiaalisessa ymp&auml;rist&ouml;ss&auml;.&nbsp;</p>
<p>T&auml;ss&auml; kirjassa n&auml;yt&auml;mme, kuinka voit k&auml;ytt&auml;&auml; OpenStreetMapia ker&auml;t&auml;ksesi samanlaista tietoa kuin alustoissa, jotka listattiin yll&auml;. N&auml;yt&auml;mme my&ouml;s kuinka voit k&auml;ytt&auml;&auml; tuloksena syntynytt&auml; tietoa eri tavoilla. Tahdotpa ker&auml;t&auml; tietoa suutareista kaupungissa tai kartoittaa sinua kiinnostavia lenkkipolkuja, OpenStreetMapista on apua. Ja kun olet valmis, se tarjoaa ty&ouml;kalut, joilla voit k&auml;ytt&auml;&auml; ker&auml;&auml;m&auml;&auml;si tietoa ja jakaa sen monilla eri tavoilla muiden kanssa.&nbsp;</p>
   
  </div>
 </div>


  </div>
</div>
<!-- End of content -->



<!-- sputnik error page -->
<div id="dialog-sputnik-qrac" style="display: none"></div>
<div id="dialog-sputnik-error" title="Can't communicate with booktype">
  <p>
    <span class="ui-icon ui-icon-circle-check" style="float:left; margin:0 7px 50px 0;"></span>
    There has been error in communication with Booktype server.
    Not sure right now where is the problem.
  </p>
  <p>
    You should refresh this page.
  </p>
</div>


<ul class="strings template">
 <li class="ok">OK</li>
 <li class="back">Back</li>
 <li class="create">Create</li>
 <li class="cancel">Cancel</li>
 <li class="next">Next</li>
 <li class="import">Import</li>
 <li class="savechanges">Save changes</li>
 <li class="errorcreategroup">Couldn't create a group!</li>
 <li class="msgepub">enter epub URL</li>
 <li class="msgarchive">enter Archive.org ID</li>
 <li class="msgwiki">enter Wikibooks URL</li>
 <li class="msgbooktype">enter Booktype URL</li>
 <li class="deletebook">Delete book</li>
</ul>

</body>
</html>

