
<!DOCTYPE HTML>
<html>
 <head>
   

<link type="text/css" href="/site_static/css/booki.css" rel="Stylesheet" >
<link type="text/css" href="/site_static/js/jquery/themes/base/jquery.ui.all.css" rel="Stylesheet" >
<link type="text/css" href="/site_static/js/jquery/themes/smoothness/jquery.ui.all.css" rel="Stylesheet" >
<script type="text/javascript" src="/site_static/js/jquery/jquery-1.4.4.js"></script>
<script type="text/javascript" src="/site_static/js/jquery/ui/jquery-ui-1.8.10.custom.js"></script>
<script type="text/javascript" src="/site_static/js/jquery.json-1.3.js"></script>
<script type="text/javascript" src="/site_static/js/booki.js"></script>
<script src="/site_static/js/messaging.js" type="text/javascript"></script>   
<script type="text/javascript" src="/site_static/js/general.js"></script>
<link href="/site_static/css/jquery.bubblepopup.v2.3.1.css" rel="stylesheet" type="text/css" />
<link type="text/css" href="/site_static/css/jquery-ui_overrides.css" rel="Stylesheet" >
<script src="/site_static/js/jquery.bubblepopup.v2.3.1.min.js" type="text/javascript"></script>

<link rel="SHORTCUT ICON" href="http://write.flossmanuals.net/site_static/images/favicon.ico" type="image/x-icon">
<meta property="og:site_name" content="FLOSS Manuals"/><meta name="description" content="Free Manuals for Freedom"/>

<script type="text/javascript">
  $(function() {
      $.booki.sputnikDispatcherURL = "/_sputnik/";

      $("#dialog-sputnik-error").dialog({
          modal: true,
          autoOpen: false,
          buttons: {
            Ok: function() {
               $(this).dialog('close');
               window.location = '.';
            }
          }
      });
  
      $("FORM.messagefield").messagefield('init', {'view_post': '/messaging/post' });  
  });
</script>


   
 <title>/chapter: Johdanto / FLOSS Manuals suomeksi</title>
 <link type="text/css" href="/site_static/css/draft.css" rel="Stylesheet" />

 <link rel="alternate" type="application/rss+xml" title="RSS feed for FLOSS Manuals suomeksi" href="/feeds/rss/book/floss-manuals-suomeksi/" /> 
 <link rel="alternate" type="application/atom+xml" title="Atom feed for FLOSS Manuals suomeksi" href="/feeds/atom/book/floss-manuals-suomeksi/" /> 

 <link rel="alternate" type="application/rss+xml" title="RSS feed for chapter Johdanto" href="/feeds/rss/chapter/floss-manuals-suomeksi/floss-manuals-suomeksi/" /> 
 <link rel="alternate" type="application/atom+xml" title="Atom feed for chapter Johdanto" href="/feeds/atom/chapter/floss-manuals-suomeksi/floss-manuals-suomeksi/" /> 
 
 <script type="text/javascript" src="/site_static/js/draft.js"></script>


   <link type="text/css" href="/static/css/_user.css" rel="Stylesheet" >
 </head>
<body>

<div class="topbar"> 
  <div class="logotext"><a href="http://write.flossmanuals.net/">FLOSS Manuals</a> </div>

  <div class="meta-bar">
    
    <ul>
      <li>
        <a href="/accounts/signin/?redirect=/floss-manuals-suomeksi/_draft/_v/1.0/johdanto/">Sign In / Create Account</a>
      </li>
    </ul>
    
    <div style="padding-top: 10px; padding-right: 15px;">
      <br/>
      

<script>
  $(function() {
    var $frm = $("FORM[name=changelang]");
	
    $("A[href=#]", $frm).click(function() {
        var lang = $(this).attr("class").substr(4);
	
        $("INPUT[name=language]", $frm).val(lang);
        $frm.submit();
	
        return false;
    });
  });
 </script>

<form name="changelang" method="POST" action="/accounts/i18n/setlang/?language=en-us">
  <input type="hidden" name="language" value="en-us">
  
    &nbsp;English&nbsp;|
  
  
  
    &nbsp;<a class="langes" href="#">Español</a>&nbsp;|
  

  
    &nbsp;<a class="langfr" href="#">Français</a>&nbsp;|
  
	
  
    &nbsp;<a class="langit" href="#">Italiano</a>&nbsp;|
  
	
  
    &nbsp;<a class="langpt" href="#">Português</a>&nbsp;|
  
	
  
    &nbsp;<a class="langru" href="#">Русский</a>&nbsp;|
  
	
  
    &nbsp;<a class="langsq" href="#">Shqip</a>
  	
</form>

    </div>
    
    
  </div><!-- End of .meta-bar -->
</div><!-- End top bar -->

<div class="menubar shadow">
  
  
  <div class="navbox">
    <ul>
      <li><a href="/list-books/">Books</a></li>
      <li><a href="/list-groups/">Groups</a></li>
      <li><a href="/list-people/">People</a></li>
    </ul>      
  </div><!-- End of .navbox -->       
</div>

<div class="content-container">
  <div class="content shadow">
    <!-- Content box and the drop shadow-->
    

<h2>FLOSS Manuals suomeksi</h2>
<div class="padded">
 <div id="bookmenu" style="background: url(/site_static/images/draft_bg.png) repeat !important;"> 
  <ul>
   
    
      <li><a href="/floss-manuals-suomeksi/_draft/_v/1.0/johdanto/">Johdanto</a></li>
    
   
    
      <li><a href="/floss-manuals-suomeksi/_draft/_v/1.0/tekninen-kirjoittaminen/">Tekninen kirjoittaminen</a></li>
    
   
    
      <li><a href="/floss-manuals-suomeksi/_draft/_v/1.0/vapaa-dokumentaatio/">Vapaa dokumentaatio</a></li>
    
   
    
      <li><a href="/floss-manuals-suomeksi/_draft/_v/1.0/vapaat-oppaat/">Vapaat oppaat</a></li>
    
   
    
      <li><a href="/floss-manuals-suomeksi/_draft/_v/1.0/lukeminen/">Lukeminen</a></li>
    
   
    
      <li><a href="/floss-manuals-suomeksi/_draft/_v/1.0/lue/">Lue</a></li>
    
   
    
      <li><a href="/floss-manuals-suomeksi/_draft/_v/1.0/kirjoittaminen/">Kirjoittaminen</a></li>
    
   
    
      <li><a href="/floss-manuals-suomeksi/_draft/_v/1.0/kirjautuminen/">Kirjautuminen </a></li>
    
   
    
      <li><a href="/floss-manuals-suomeksi/_draft/_v/1.0/asetukseni/">Asetukseni</a></li>
    
   
    
      <li><a href="/floss-manuals-suomeksi/_draft/_v/1.0/kirjan-luominen/">Kirjan luominen</a></li>
    
   
    
      <li><a href="/floss-manuals-suomeksi/_draft/_v/1.0/lukujen-luominen/">Lukujen luominen</a></li>
    
   
    
      <li><a href="/floss-manuals-suomeksi/_draft/_v/1.0/sisallysluettelo/">Sisällysluettelo</a></li>
    
   
    
      <li><a href="/floss-manuals-suomeksi/_draft/_v/1.0/kuvien-lisaaminen/">Kuvien lisääminen</a></li>
    
   
    
      <li><a href="/floss-manuals-suomeksi/_draft/_v/1.0/viestinta/">Viestintä</a></li>
    
   
    
      <li><a href="/floss-manuals-suomeksi/_draft/_v/1.0/liitteet/">Liitteet</a></li>
    
   
    
      <li><a href="/floss-manuals-suomeksi/_draft/_v/1.0/ukk/">UKK</a></li>
    
   
    
      <li><a href="/floss-manuals-suomeksi/_draft/_v/1.0/tekijat/">Tekijät</a></li>
    
   
  </ul>
 </div>
 <div id="bookcontent"   style="background: url(/site_static/images/draft_bg.png) repeat !important;">
   

  <html lang="fi"><head><title>Johdanto</title></head><body><h1>FLOSS Manuals</h1>
<div>
<p>FLOSS Manuals tarjoaa avoimia k&#228;ytt&#246;ohjeita vapaiden ohjelmistojen k&#228;ytt&#246;&#228; varten. FLOSS Manuals on voittoa tuottamaton s&#228;&#228;ti&#246;, joka on perustettu Amsterdamissa vuonna 2006. FLOSS Manuals on my&#246;s wiki ja vapaan dokumentaation kirjoittajien yhteis&#246;.</p>
<p>Lyhenne FLOSS tulee sanoista Free/Libre/Open Source Software. Suomeksi lyhenne k&#228;&#228;nnet&#228;&#228;n yleens&#228; sanoiksi Vapaat ja Avoimen L&#228;hdekoodin Ohjelmat eli VALO. FLOSS Manualsin voisi siis suomentaa VALO-k&#228;ytt&#246;ohjeiksi.</p>
<p>Kansainv&#228;linen FLOSS Manuals koostuu t&#228;ll&#228; hetkell&#228; englannin-, suomen-, ranskan-, farsin- ja hollanninkielisest&#228; wikist&#228; sek&#228; k&#228;&#228;nn&#246;svy&#246;hykkeest&#228;, jossa on k&#228;&#228;nnettyj&#228; oppaita monilla eri kielill&#228;.</p>
<p>Suomenkielinen FLOSS Manuals sai alkunsa yhteis&#246;llisen ja osallistavan median <a href="http://medios.metropolia.fi/">Medios</a>-projektissa, jossa se kotoistettiin Suomeen mediakulttuurij&#228;rjest&#246; <a href="http://www.m-cult.org/">m-cult</a>in toimesta. Suomen FLOSS Manuals avattiin vuonna 2009.</p>
<p>FLOSS Manualsin alustana on <a title="Booktype" href="http://fi.flossmanuals.net/kirjoita/">Booktype</a>, joka on wikin kaltainen ty&#246;kalu kirjojen luomiseksi. Booki mahdollistaa kirjojen kirjoittamisen yhteisty&#246;ss&#228; ja niiden julkaisemisen verkossa, e-kirjana tai painoa varten muotoiltuna PDF-tiedostona.&#160;</p>
<p>FLOSS Manuals on avoin kaikille ja voit osallistua sen toimintaan vaikkapa parantelemalla vanhaa opasta tai kirjoittamalla oman oppaasi.&#160;</p>
<p>&#160;</p>
</div>
<h2>Mit&#228; teemme&#160;</h2>
<div>Vaikka 60% kaikista verkkosivuista toimii vapailla ohjelmilla, miksi vain 1,7% kaikista tietokoneen k&#228;ytt&#228;jist&#228; on asentanut vapaita ohjelmistoja tietokoneilleen? Vastaus on yksinkertainen. Free Software Foundationin sanoin:&#160;</div>
<div>&#160;</div>
<div><em>"Suurin vapaiden k&#228;ytt&#246;j&#228;rjestelmien ongelma ei ole ohjelmistojen laatu - se on hyvien vapaiden k&#228;ytt&#246;ohjeiden puute." </em></div>
<div>&#160;</div>
<div>FLOSS Manuals on olemassa tarjotakseen n&#228;m&#228; k&#228;ytt&#246;ohjeet kaikille, ilmaiseksi.&#160;</div>
<div>
<p>Teemme t&#228;m&#228;n verkkosivumme kautta. Verkkosivumme on wiki. FLOSS Manuals ei ehk&#228; muistuta Wikipediaa, mutta kuitenkin se toimii samojen periaatteiden mukaan. Booktype on kaikille avoin kirjoitusymp&#228;rist&#246;, jossa on mahdollista kirjoittaa k&#228;ytt&#246;ohjeita tai vaikkapa koulutusmateriaaleja.</p>
<p>Uusi k&#228;ytt&#246;opas tuotetaan kaikkein tehokkaimmin kirjapyr&#228;hdyksess&#228;, jossa ohjelmasta kiinnostuneet ihmiset kokoontuvat kirjoittamaan k&#228;ytt&#246;opasta. Joukossa on parhaimmillaan ohjelman k&#228;ytt&#228;ji&#228;, teknisi&#228; kirjoittajia, alan asiantuntijoita ja ohjelman kehitt&#228;miseen osallistuneita ohjelmoijia. Kirjapyr&#228;hdys voi usein tuottaa uuden k&#228;ytt&#246;oppaan muutamassa p&#228;iv&#228;ss&#228;.</p>
<p>Verkosto on saanut maineen laadukkaan dokumentaation tuottajana. Sit&#228; tukevat avainprojektit, kuten <a href="http://one.laptop.org/">One Laptop Per Child</a> ja <a href="http://www.archive.org/">Archive.org</a>. Kieliyhteis&#246; laajenee nopeasti - k&#228;ytt&#246;oppaita k&#228;&#228;nnet&#228;&#228;n nyt yli kahdellekymmenelle kielelle.</p>
<h2>Dokumentaation tarve</h2>
<p>Vapaiden ja avoimen ohjelmien maailmassa on paljon ohjelmoijia. Usein teknisist&#228; kirjoittajista n&#228;ytt&#228;&#228; kuitenkin olevan pulaa. Yleisen vitsin mukaan uusi k&#228;ytt&#228;j&#228; yritt&#228;&#228; k&#228;ytt&#228;&#228; avoimen l&#228;hdekoodin ohjelmaa, mutta h&#228;nt&#228; neuvotaan lukemaan l&#228;hdekoodia. N&#228;in tekninen kirjoittaja voi helpottaa ohjelman k&#228;ytt&#246;&#246;nottoprojektia huomattavasti tarjoamalla avointa dokumentaatiota wikimuodossa.</p>
<p>T&#228;m&#228;n vuoksi tarvitsemme FLOSS Manualsia. Ihannetilanteessa dokumentaatio vastaa loppuk&#228;ytt&#228;jien taitotasoa. Loppuk&#228;ytt&#228;j&#228; ei luultavasti ole kiinnostunut k&#228;ytetyn ohjelmointikielen hienouksista tai vastaavista teknisist&#228; seikoista. Loppuk&#228;ytt&#228;j&#228; tahtoo k&#228;ytt&#228;&#228; ohjelmaa.</p>
<p>Niinp&#228; dokumentaatiossa k&#228;ytetyn kielen tulisi olla ymm&#228;rrett&#228;v&#228;&#228; maallikoille. Sit&#228; ei tulisi kirjoittaa ohjelmointigurujen teknisell&#228; jargonilla, kaikki tulisi kirjoittaa henkil&#246;lle, joka ei ymm&#228;rr&#228; tietojenk&#228;sittelytiedett&#228; - mutta tahtoo tuottaa jotain. <em> <br></em></p>
<p>T&#228;m&#228; on FLOSS Manualsin idea. T&#228;m&#228;n vuoksi tarvitsemme laadukasta dokumentaatiota avoimen l&#228;hdekoodin ohjelmille - rakentaaksemme sillan koodaajien, dokumentoijien ja k&#228;ytt&#228;jien v&#228;lille.</p>
<h2>K&#228;ytt&#228;jien ja kirjoittajien yhteis&#246;n rakentaminen</h2>
<p>Pelkk&#228; k&#228;ytt&#246;oppaan suomentaminen ei riit&#228;. Sit&#228; t&#228;ytyy jatkuvasti p&#228;ivitt&#228;&#228;, laajentaa ja lokalisoida sopimaan paikallisiin olosuhteisiin. T&#228;m&#228;n vuoksi jokainen FLOSS Manualsin lokalisaatio tarvitsee kirjoittajien ja lukijoiden yhteis&#246;&#228;.</p>
<p>Wikiin pohjautuva yhteisty&#246; merkitsee sit&#228;, ett&#228; lukemattomien k&#228;ytt&#228;jien pienist&#228; muokkauksista muodostuu valtava m&#228;&#228;r&#228; sis&#228;lt&#246;&#228;.</p>
<p>Eri lokalisointien yhteisty&#246;n tuloksena FLOSS Manualsin pit&#228;isi luoda my&#246;s globaalia synergiaa, jossa ideat virtaavat yhdest&#228; kieliyhteis&#246;st&#228; toiseen. <br><br>FLOSS Manuals pyrkii luomaan ratkaisun uuden k&#228;ytt&#228;j&#228;n ongelmaan: mist&#228; l&#246;yd&#228;n ymm&#228;rrett&#228;v&#228;t k&#228;ytt&#246;ohjeet t&#228;lle avoimen l&#228;hdekoodin ohjelmalle?</p>
</div>
<h2>LUE ja KIRJOITA</h2>
<div>FLOSS Manualsissa on kaksi perusosaa: LUE ja KIRJOITA.</div>
<div>
<p>LUE-osassa voi lukea k&#228;ytt&#246;oppaiden julkaistuja versioita verkossa ja ladata ne ePub tai PDF-tiedostoina. Olemme laatineet LUE-osaan monta k&#228;ytt&#246;opasta vapaiden ohjelmistojen k&#228;yt&#246;st&#228;. Ne on j&#228;rjestetty ohjelmistokategorioihin.</p>
<p>Jokainen k&#228;ytt&#246;opas auttaa k&#228;ytt&#228;j&#228;&#228; aloittamaan ohjelman k&#228;yt&#246;n. Yleisesti ottaen k&#228;ytt&#246;oppaat kattavat seuraavat asiat: &#160;&#160;</p>
</div>
<ol><li>Mit&#228; ohjelma tekee?</li>
<li>Mit&#228; ohjelma ei tee?</li>
<li>Johdanto ohjelman aihepiiriin&#160;</li>
<li>Kuinka ohjelma asennetaan</li>
<li>Kuinka perusasetukset tehd&#228;&#228;n&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;</li>
<li>K&#228;ytt&#246;liittym&#228;n perusesittely</li>
<li>Ohjelman t&#228;rkeimpien piirteiden k&#228;ytt&#246; kuvattuna askel askeleelta etenevill&#228; ohjeilla</li>
<li>Mist&#228; l&#246;yd&#228;t lis&#228;&#228; apua ohjelman k&#228;ytt&#246;&#246;n</li>
</ol><div>
<p>KIRJOITA-osassa voit kirjoittaa k&#228;ytt&#246;ohjeita. Kirjoitusalustana toimii Booki. Valitettavasti joudut rekister&#246;im&#228;&#228;n k&#228;ytt&#228;j&#228;tunnuksen, koska sp&#228;mmibotit ovat internetiss&#228; ainaisena riesana.&#160;</p>
<p>FLOSS Manualsissa kaikki materiaali on lisensoitu niin, ett&#228; kuka tahansa voi k&#228;ytt&#228;&#228; sit&#228; mihin tahansa tarkoitukseen. Niinp&#228; kannattaa rekister&#246;ity&#228; omalla nimell&#228;si, koska voit saada ty&#246;st&#228;si arvaamatonta kunniaa. Mutta tietysti voit kirjautua my&#246;s nimimerkill&#228;, koska kukapa tuota netiss&#228; valvoisi.</p>
<p>&#160;</p>
</div></body></html>
   
  </div>
 </div>


  </div>
</div>
<!-- End of content -->



<!-- sputnik error page -->
<div id="dialog-sputnik-qrac" style="display: none"></div>
<div id="dialog-sputnik-error" title="Can't communicate with booktype">
  <p>
    <span class="ui-icon ui-icon-circle-check" style="float:left; margin:0 7px 50px 0;"></span>
    There has been error in communication with Booktype server.
    Not sure right now where is the problem.
  </p>
  <p>
    You should refresh this page.
  </p>
</div>


<ul class="strings template">
 <li class="ok">OK</li>
 <li class="back">Back</li>
 <li class="create">Create</li>
 <li class="cancel">Cancel</li>
 <li class="next">Next</li>
 <li class="import">Import</li>
 <li class="savechanges">Save changes</li>
 <li class="errorcreategroup">Couldn't create a group!</li>
 <li class="msgepub">enter epub URL</li>
 <li class="msgarchive">enter Archive.org ID</li>
 <li class="msgwiki">enter Wikibooks URL</li>
 <li class="msgbooktype">enter Booktype URL</li>
 <li class="deletebook">Delete book</li>
</ul>

</body>
</html>

