
<!DOCTYPE HTML>
<html>
 <head>
   

<link type="text/css" href="/site_static/css/booki.css" rel="Stylesheet" >
<link type="text/css" href="/site_static/js/jquery/themes/base/jquery.ui.all.css" rel="Stylesheet" >
<link type="text/css" href="/site_static/js/jquery/themes/smoothness/jquery.ui.all.css" rel="Stylesheet" >
<script type="text/javascript" src="/site_static/js/jquery/jquery-1.4.4.js"></script>
<script type="text/javascript" src="/site_static/js/jquery/ui/jquery-ui-1.8.10.custom.js"></script>
<script type="text/javascript" src="/site_static/js/jquery.json-1.3.js"></script>
<script type="text/javascript" src="/site_static/js/booki.js"></script>
<script src="/site_static/js/messaging.js" type="text/javascript"></script>   
<script type="text/javascript" src="/site_static/js/general.js"></script>
<link href="/site_static/css/jquery.bubblepopup.v2.3.1.css" rel="stylesheet" type="text/css" />
<link type="text/css" href="/site_static/css/jquery-ui_overrides.css" rel="Stylesheet" >
<script src="/site_static/js/jquery.bubblepopup.v2.3.1.min.js" type="text/javascript"></script>

<link rel="SHORTCUT ICON" href="http://write.flossmanuals.net/site_static/images/favicon.ico" type="image/x-icon">
<meta property="og:site_name" content="FLOSS Manuals"/><meta name="description" content="Free Manuals for Freedom"/>

<script type="text/javascript">
  $(function() {
      $.booki.sputnikDispatcherURL = "/_sputnik/";

      $("#dialog-sputnik-error").dialog({
          modal: true,
          autoOpen: false,
          buttons: {
            Ok: function() {
               $(this).dialog('close');
               window.location = '.';
            }
          }
      });
  
      $("FORM.messagefield").messagefield('init', {'view_post': '/messaging/post' });  
  });
</script>


   
<title>/chapter: Tekhnicheskie-Sredstva-Dlia-Aktivistov / ТЕХНИЧЕСКИЕ СРЕДСТВА ДЛЯ АКТИВИСТОВ </title>
<link type="text/css" href="/site_static/css/published.css" rel="Stylesheet" />

<link rel="alternate" type="application/rss+xml" title="RSS feed for ТЕХНИЧЕСКИЕ СРЕДСТВА ДЛЯ АКТИВИСТОВ " href="/feeds/rss/book/tt4a-ru/" /> 
<link rel="alternate" type="application/atom+xml" title="Atom feed for ТЕХНИЧЕСКИЕ СРЕДСТВА ДЛЯ АКТИВИСТОВ " href="/feeds/atom/book/tt4a-ru/" /> 

<link rel="alternate" type="application/rss+xml" title="RSS feed for chapter ТЕХНИЧЕСКИЕ СРЕДСТВА ДЛЯ АКТИВИСТОВ" href="/feeds/rss/chapter/tt4a-ru/tt4a-ru/" /> 
<link rel="alternate" type="application/atom+xml" title="Atom feed for chapter ТЕХНИЧЕСКИЕ СРЕДСТВА ДЛЯ АКТИВИСТОВ" href="/feeds/atom/chapter/tt4a-ru/tt4a-ru/" /> 


<style>
SPAN.bookicommentmarker {
  background-color: white;
}

SPAN.bookicommentmarker > IMG.markerimage { 
   display: none;
}


</style>



   <link type="text/css" href="/static/css/_user.css" rel="Stylesheet" >
 </head>
<body>

<div class="topbar"> 
  <div class="logotext"><a href="http://write.flossmanuals.net/">FLOSS Manuals</a> </div>

  <div class="meta-bar">
    
    <ul>
      <li>
        <a href="/accounts/signin/?redirect=/tt4a-ru/tekhnicheskie-sredstva-dlia-aktivistov/">Sign In / Create Account</a>
      </li>
    </ul>
    
    <div style="padding-top: 10px; padding-right: 15px;">
      <br/>
      

<script>
  $(function() {
    var $frm = $("FORM[name=changelang]");
	
    $("A[href=#]", $frm).click(function() {
        var lang = $(this).attr("class").substr(4);
	
        $("INPUT[name=language]", $frm).val(lang);
        $frm.submit();
	
        return false;
    });
  });
 </script>

<form name="changelang" method="POST" action="/accounts/i18n/setlang/?language=en-us">
  <input type="hidden" name="language" value="en-us">
  
    &nbsp;English&nbsp;|
  
  
  
    &nbsp;<a class="langes" href="#">Español</a>&nbsp;|
  

  
    &nbsp;<a class="langfr" href="#">Français</a>&nbsp;|
  
	
  
    &nbsp;<a class="langit" href="#">Italiano</a>&nbsp;|
  
	
  
    &nbsp;<a class="langpt" href="#">Português</a>&nbsp;|
  
	
  
    &nbsp;<a class="langru" href="#">Русский</a>&nbsp;|
  
	
  
    &nbsp;<a class="langsq" href="#">Shqip</a>
  	
</form>

    </div>
    
    
  </div><!-- End of .meta-bar -->
</div><!-- End top bar -->

<div class="menubar shadow">
  
  
  <div class="navbox">
    <ul>
      <li><a href="/list-books/">Books</a></li>
      <li><a href="/list-groups/">Groups</a></li>
      <li><a href="/list-people/">People</a></li>
    </ul>      
  </div><!-- End of .navbox -->       
</div>

<div class="content-container">
  <div class="content shadow">
    <!-- Content box and the drop shadow-->
    
   <h2>ТЕХНИЧЕСКИЕ СРЕДСТВА ДЛЯ АКТИВИСТОВ </h2>

<div class="padded">
<div id="bookmenu">
<ul>

 
   <li><a href="/tt4a-ru/tekhnicheskie-sredstva-dlia-aktivistov/">ТЕХНИЧЕСКИЕ СРЕДСТВА ДЛЯ АКТИВИСТОВ</a></li>
 

 
   <li><a href="/tt4a-ru/1-vvedenie/">1. ВВЕДЕНИЕ</a></li>
 

 
   <li><a href="/tt4a-ru/2-obespechenie-bezopasnosti-vashei-elektronnoi-pochty/">2. ОБЕСПЕЧЕНИЕ БЕЗОПАСНОСТИ ВАШЕЙ ЭЛЕКТРОННОЙ ПОЧТЫ</a></li>
 

 
   <li><a href="/tt4a-ru/3-anonimnoe-poseshchenie-saitov-i-vedenie-blogov/">3. АНОНИМНОЕ ПОСЕЩЕНИЕ САЙТОВ И ВЕДЕНИЕ БЛОГОВ</a></li>
 

 
   <li><a href="/tt4a-ru/4-vedenie-mikrobloga-vne-twittera/">4. ВЕДЕНИЕ МИКРОБЛОГА ВНЕ TWITTER`А</a></li>
 

 
   <li><a href="/tt4a-ru/5-prosmotr-saitov-v-seti-internet/">5. ПРОСМОТР САЙТОВ В СЕТИ ИНТЕРНЕТ</a></li>
 

 
   <li><a href="/tt4a-ru/6-organizatsionnaia-deiatelnost-i-setevoe-vzaimodeistvie-v-seti-internet/">6. ОРГАНИЗАЦИОННАЯ ДЕЯТЕЛЬНОСТЬ И СЕТЕВОЕ ВЗАИМОДЕЙСТВИЕ В СЕТИ ИНТЕРНЕТ</a></li>
 

 
   <li><a href="/tt4a-ru/7-obespechenie-bezopasnosti-pri-ispolzovanii-mobilnykh-telefonov-i-android-prilozhenii/">7. ОБЕСПЕЧЕНИЕ БЕЗОПАСНОСТИ ПРИ ИСПОЛЬЗОВАНИИ МОБИЛЬНЫХ ТЕЛЕФОНОВ И ANDROID-ПРИЛОЖЕНИЙ</a></li>
 

 
   <li><a href="/tt4a-ru/8-publikatsiia-i-rasprostranenie-novostei-v-seti-internet/">8. ПУБЛИКАЦИЯ И РАСПРОСТРАНЕНИЕ НОВОСТЕЙ В СЕТИ ИНТЕРНЕТ</a></li>
 

 
   <li><a href="/tt4a-ru/9-proizvodstvo-i-publikatsiia-media-kontenta-v-seti-internet/">9. ПРОИЗВОДСТВО И ПУБЛИКАЦИЯ МЕДИА-КОНТЕНТА В СЕТИ ИНТЕРНЕТ</a></li>
 

 
   <li><a href="/tt4a-ru/10-ekologichnye-informatsionnye-tekhnologii/">10. ЭКОЛОГИЧНЫЕ ИНФОРМАЦИОННЫЕ ТЕХНОЛОГИИ</a></li>
 

 
   <li><a href="/tt4a-ru/11-sokrytie-i-udalenie-informatsii-na-vashem-kompiutere/">11. СОКРЫТИЕ И УДАЛЕНИЕ ИНФОРМАЦИИ НА ВАШЕМ КОМПЬЮТЕРЕ</a></li>
 

</ul>
</div>
<div id="bookcontent">
   
<html lang="en"><head><title>1. &#1042;&#1042;&#1045;&#1044;&#1045;&#1053;&#1048;&#1045;</title></head><body><h1>&#1042;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077;</h1>
<p><strong><img src="static/1%20Kopie.png" alt="" align="" width="200" height="200" class=""><br></strong></p>
<p><strong>&#1069;&#1090;&#1072; &#1073;&#1088;&#1086;&#1096;&#1102;&#1088;&#1072; &#1087;&#1086;&#1084;&#1086;&#1078;&#1077;&#1090; &#1074;&#1072;&#1084;:</strong></p>
<ul><li>&#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1101;&#1083;&#1077;&#1082;&#1090;&#1088;&#1086;&#1085;&#1085;&#1091;&#1102; &#1087;&#1086;&#1095;&#1090;&#1091;;</li><li>&#1072;&#1085;&#1086;&#1085;&#1080;&#1084;&#1085;&#1086; &#1087;&#1091;&#1073;&#1083;&#1080;&#1082;&#1086;&#1074;&#1072;&#1090;&#1100; &#1085;&#1086;&#1074;&#1086;&#1089;&#1090;&#1080; &#1080; &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1072;&#1090;&#1100; &#1084;&#1077;&#1076;&#1080;&#1072;-&#1082;&#1086;&#1085;&#1090;&#1077;&#1085;&#1090; &#1085;&#1072; &#1089;&#1072;&#1081;&#1090;&#1099;;</li><li>&#1073;&#1086;&#1083;&#1077;&#1077; &#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1086; &#1080; &#1072;&#1085;&#1086;&#1085;&#1080;&#1084;&#1085;&#1086; &#1087;&#1088;&#1086;&#1089;&#1084;&#1072;&#1090;&#1088;&#1080;&#1074;&#1072;&#1090;&#1100; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1095;&#1082;&#1080; &#1089;&#1072;&#1081;&#1090;&#1086;&#1074; &#1074; &#1080;&#1085;&#1090;&#1077;&#1088;&#1085;&#1077;&#1090;&#1077;;</li><li>&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; Facebook &#1080; Twitter &#1073;&#1086;&#1083;&#1077;&#1077; &#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1086;;</li><li>&#1086;&#1088;&#1075;&#1072;&#1085;&#1080;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1088;&#1072;&#1073;&#1086;&#1090;&#1091; &#1074; &#1089;&#1077;&#1090;&#1080; &#1073;&#1077;&#1079; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1082;&#1086;&#1088;&#1087;&#1086;&#1088;&#1072;&#1090;&#1080;&#1074;&#1085;&#1099;&#1093; &#1089;&#1072;&#1081;&#1090;&#1086;&#1074; &#1089;&#1086;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1089;&#1077;&#1090;&#1077;&#1081;;</li><li>&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1096;&#1080;&#1092;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1087;&#1088;&#1080; &#1086;&#1090;&#1087;&#1088;&#1072;&#1074;&#1082;&#1077; &#1080; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1080; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1081; &#1085;&#1072; &#1084;&#1086;&#1073;&#1080;&#1083;&#1100;&#1085;&#1086;&#1084; &#1090;&#1077;&#1083;&#1077;&#1092;&#1086;&#1085;&#1077;;</li><li>&#1089;&#1082;&#1088;&#1099;&#1074;&#1072;&#1090;&#1100; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102; &#1085;&#1072; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1077; &#1090;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1077;&#1105; &#1073;&#1099;&#1083;&#1086; &#1086;&#1095;&#1077;&#1085;&#1100; &#1089;&#1083;&#1086;&#1078;&#1085;&#1086; &#1085;&#1072;&#1081;&#1090;&#1080;;</li><li>&#1085;&#1072;&#1081;&#1090;&#1080; &#1073;&#1086;&#1083;&#1077;&#1077; &#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1091;&#1102; &#1080; &#1076;&#1077;&#1094;&#1077;&#1085;&#1090;&#1088;&#1072;&#1083;&#1080;&#1079;&#1086;&#1074;&#1072;&#1085;&#1085;&#1091;&#1102; &#1072;&#1083;&#1100;&#1090;&#1077;&#1088;&#1085;&#1072;&#1090;&#1080;&#1074;&#1091; Twitter;</li><li>&#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090;&#1100; &#1073;&#1077;&#1089;&#1087;&#1083;&#1072;&#1090;&#1085;&#1086;&#1077; &#1055;&#1054;, &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1077; &#1083;&#1080;&#1094;&#1077;&#1085;&#1079;&#1080;&#1080; &#1080; &#1076;&#1077;&#1094;&#1077;&#1085;&#1090;&#1088;&#1072;&#1083;&#1080;&#1079;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077; &#1082;&#1086;&#1084;&#1084;&#1091;&#1085;&#1080;&#1082;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1077; &#1089;&#1077;&#1090;&#1080;.</li>
</ul><p><strong>&#1055;&#1086;&#1095;&#1077;&#1084;&#1091; &#1101;&#1090;&#1072; &#1073;&#1088;&#1086;&#1096;&#1102;&#1088;&#1072; &#1074;&#1072;&#1078;&#1085;&#1072;</strong><strong>:</strong></p>
<p>&#1069;&#1090;&#1072; &#1073;&#1088;&#1086;&#1096;&#1102;&#1088;&#1072; &#1086;&#1079;&#1085;&#1072;&#1082;&#1086;&#1084;&#1080;&#1090; &#1074;&#1072;&#1089; &#1089; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1103;&#1084;&#1080; &#1101;&#1092;&#1092;&#1077;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086;&#1075;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1089;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1093; &#1090;&#1077;&#1093;&#1085;&#1086;&#1083;&#1086;&#1075;&#1080;&#1081; &#1072;&#1082;&#1090;&#1080;&#1074;&#1080;&#1089;&#1090;&#1072;&#1084;&#1080;, &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090; &#1089;&#1089;&#1099;&#1083;&#1082;&#1080; &#1085;&#1072; &#1087;&#1086;&#1096;&#1072;&#1075;&#1086;&#1074;&#1099;&#1077; &#1088;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1072; &#1080; &#1073;&#1086;&#1083;&#1077;&#1077; &#1087;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1091;&#1102; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102;. &#1054;&#1085;&#1072; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1072; &#1089; &#1072;&#1082;&#1094;&#1077;&#1085;&#1090;&#1086;&#1084; &#1085;&#1072; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1074; &#1042;&#1077;&#1083;&#1080;&#1082;&#1086;&#1073;&#1088;&#1080;&#1090;&#1072;&#1085;&#1080;&#1080;, &#1080; &#1084;&#1099; &#1088;&#1072;&#1076;&#1099; &#1074;&#1089;&#1077;&#1084; &#1090;&#1077;&#1084;, &#1082;&#1090;&#1086; &#1075;&#1086;&#1090;&#1086;&#1074; &#1087;&#1077;&#1088;&#1077;&#1074;&#1077;&#1089;&#1090;&#1080; &#1077;&#1105; &#1085;&#1072; &#1089;&#1074;&#1086;&#1081; &#1103;&#1079;&#1099;&#1082;.</p>
<div>
<p dir="ltr"><span lang="en-GB">&#1048;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099;, &#1086; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1082;&#1072;&#1078;&#1077;&#1084;, &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1099;:&#160;<br></span></p>
</div>
<ul><li>&#1078;&#1091;&#1088;&#1085;&#1072;&#1083;&#1080;&#1089;&#1090;&#1072;&#1084;&#1080;, &#1078;&#1077;&#1083;&#1072;&#1102;&#1097;&#1080;&#1084;&#1080; &#1079;&#1072;&#1097;&#1080;&#1090;&#1080;&#1090;&#1100; &#1089;&#1077;&#1073;&#1103; &#1080; &#1089;&#1074;&#1086;&#1080; &#1080;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082;&#1080;;</li><li>&#1083;&#1102;&#1076;&#1100;&#1084;&#1080;, &#1088;&#1072;&#1089;&#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1084;&#1080; &#1085;&#1072;&#1088;&#1091;&#1096;&#1077;&#1085;&#1080;&#1103; &#1079;&#1072;&#1082;&#1086;&#1085;&#1072; &#1082;&#1086;&#1088;&#1087;&#1086;&#1088;&#1072;&#1094;&#1080;&#1103;&#1084;&#1080; &#1080; &#1075;&#1086;&#1089;&#1091;&#1076;&#1072;&#1088;&#1089;&#1090;&#1074;&#1072;&#1084;&#1080;;</li><li>&#1085;&#1077;&#1087;&#1088;&#1072;&#1074;&#1080;&#1090;&#1077;&#1083;&#1100;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1084;&#1080; &#1086;&#1088;&#1075;&#1072;&#1085;&#1080;&#1079;&#1072;&#1094;&#1080;&#1103;&#1084;&#1080;, &#1073;&#1083;&#1072;&#1075;&#1086;&#1090;&#1074;&#1086;&#1088;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1084;&#1080; &#1086;&#1073;&#1097;&#1077;&#1089;&#1090;&#1074;&#1072;&#1084;&#1080; &#1080; &#1086;&#1088;&#1075;&#1072;&#1085;&#1080;&#1079;&#1072;&#1090;&#1086;&#1088;&#1072;&#1084;&#1080; &#1082;&#1072;&#1084;&#1087;&#1072;&#1085;&#1080;&#1081;;</li><li>&#1084;&#1077;&#1089;&#1090;&#1085;&#1099;&#1084;&#1080; &#1101;&#1082;&#1086;&#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084;&#1080; &#1076;&#1074;&#1080;&#1078;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080; &#1080;&#1083;&#1080; &#1075;&#1088;&#1091;&#1087;&#1087;&#1072;&#1084;&#1080; &#1074;&#1083;&#1080;&#1103;&#1085;&#1080;&#1103;;</li><li>&#1083;&#1102;&#1073;&#1099;&#1084;&#1080; &#1083;&#1102;&#1076;&#1100;&#1084;&#1080;, &#1086;&#1073;&#1097;&#1072;&#1102;&#1097;&#1080;&#1084;&#1080;&#1089;&#1103; &#1074; &#1094;&#1080;&#1092;&#1088;&#1086;&#1074;&#1086;&#1084; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1077; &#1080; &#1085;&#1077; &#1076;&#1086;&#1074;&#1077;&#1088;&#1103;&#1102;&#1097;&#1080;&#1084;&#1080; &#1074;&#1083;&#1072;&#1089;&#1090;&#1103;&#1084;.</li>
</ul><h3>&#1041;&#1077;&#1089;&#1087;&#1083;&#1072;&#1090;&#1085;&#1099;&#1077; &#1055;&#1054; &#1080; &#1091;&#1089;&#1083;&#1091;&#1075;&#1080; &#1074; &#1089;&#1077;&#1090;&#1080; &#1080;&#1085;&#1090;&#1077;&#1088;&#1085;&#1077;&#1090;</h3>
<p>&#1055;&#1086;&#1095;&#1090;&#1080; &#1074;&#1089;&#1077; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099;, &#1086;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1077;&#1084;&#1099;&#1077; &#1074; &#1073;&#1088;&#1086;&#1096;&#1102;&#1088;&#1077;, &#1086;&#1089;&#1085;&#1086;&#1074;&#1072;&#1085;&#1099; &#1085;&#1072; &#1073;&#1077;&#1089;&#1087;&#1083;&#1072;&#1090;&#1085;&#1086;&#1084; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1084; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1080;. &#1055;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1089;&#1090;&#1099; &#1087;&#1086;&#1089;&#1074;&#1103;&#1097;&#1072;&#1102;&#1090; &#1084;&#1080;&#1083;&#1083;&#1080;&#1086;&#1085;&#1099; &#1095;&#1072;&#1089;&#1086;&#1074; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1102; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1085;&#1077; &#1079;&#1072;&#1088;&#1072;&#1078;&#1077;&#1085;&#1086; &#1074;&#1080;&#1088;&#1091;&#1089;&#1072;&#1084;&#1080;, &#1086;&#1073;&#1083;&#1072;&#1076;&#1072;&#1077;&#1090; &#1074;&#1099;&#1089;&#1086;&#1082;&#1086;&#1081; &#1089;&#1090;&#1077;&#1087;&#1077;&#1085;&#1100;&#1102; &#1079;&#1072;&#1097;&#1080;&#1090;&#1099; &#1080; &#1085;&#1077; &#1087;&#1086;&#1076;&#1074;&#1077;&#1088;&#1075;&#1072;&#1077;&#1090; &#1088;&#1080;&#1089;&#1082;&#1091; &#1074;&#1072;&#1096;&#1091; &#1095;&#1072;&#1089;&#1090;&#1085;&#1091;&#1102; &#1078;&#1080;&#1079;&#1085;&#1100;. &#1053;&#1072;&#1074;&#1077;&#1088;&#1085;&#1103;&#1082;&#1072; &#1074;&#1099; &#1091;&#1078;&#1077; &#1079;&#1085;&#1072;&#1082;&#1086;&#1084;&#1099; &#1089; Firefox, OpenOffice &#1080; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1084;&#1080; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072;&#1084;&#1080; GNU/Linux, &#1074; &#1095;&#1072;&#1089;&#1090;&#1085;&#1086;&#1089;&#1090;&#1080; Ubuntu &#1080; Mint Linux, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1084;&#1080; &#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103; &#1084;&#1080;&#1083;&#1083;&#1080;&#1086;&#1085;&#1099; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081; &#1087;&#1086; &#1074;&#1089;&#1077;&#1084;&#1091; &#1084;&#1080;&#1088;&#1091;.</p>
<div class="negativespace">
<p>&#1041;&#1077;&#1089;&#1087;&#1083;&#1072;&#1090;&#1085;&#1086;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1077; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077;, &#1086; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1079;&#1076;&#1077;&#1089;&#1100; &#1087;&#1086;&#1081;&#1076;&#1105;&#1090; &#1088;&#1077;&#1095;&#1100;, &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;; &#1090;&#1072;&#1082;&#1078;&#1077; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1087;&#1086;&#1085;&#1103;&#1090;&#1100;, &#1082;&#1072;&#1082; &#1080;&#1084;&#1077;&#1085;&#1085;&#1086; &#1086;&#1085;&#1086; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090;, &#1074;&#1085;&#1077;&#1089;&#1090;&#1080; &#1089;&#1074;&#1086;&#1080; &#1087;&#1088;&#1072;&#1074;&#1082;&#1080; &#1080; &#1074; &#1076;&#1072;&#1083;&#1100;&#1085;&#1077;&#1081;&#1096;&#1077;&#1084; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086; &#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1103;&#1090;&#1100; &#1077;&#1075;&#1086;. &#1069;&#1090;&#1080; &#1087;&#1088;&#1072;&#1074;&#1072; &#1079;&#1072;&#1097;&#1080;&#1097;&#1077;&#1085;&#1099; &#1083;&#1080;&#1094;&#1077;&#1085;&#1079;&#1080;&#1077;&#1081;, &#1086;&#1073;&#1099;&#1095;&#1085;&#1086; &#1101;&#1090;&#1086; GPL (General Public License). &#1042; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;, &#1077;&#1089;&#1083;&#1080; &#1074;&#1099; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1083;&#1080; &#1055;&#1054; &#1080; &#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1103;&#1077;&#1090;&#1077; &#1077;&#1075;&#1086; &#1073;&#1077;&#1089;&#1087;&#1083;&#1072;&#1090;&#1085;&#1086;, &#1074;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1090;&#1072;&#1082;&#1078;&#1077; &#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1103;&#1090;&#1100; &#1074;&#1085;&#1077;&#1089;&#1105;&#1085;&#1085;&#1099;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1085;&#1072; &#1086;&#1089;&#1085;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1090;&#1086;&#1081; &#1078;&#1077; &#1083;&#1080;&#1094;&#1077;&#1085;&#1079;&#1080;&#1080; &#1076;&#1083;&#1103; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1101;&#1090;&#1086; &#1087;&#1088;&#1080;&#1085;&#1077;&#1089;&#1083;&#1086; &#1087;&#1086;&#1083;&#1100;&#1079;&#1091; &#1074;&#1089;&#1077;&#1084; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;&#1084; &#1076;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1055;&#1054;. <strong><a href="http://ttfa.net/gpl" target="" title="">http://ttfa.net/gpl</a></strong></p>
<p>&#1041;&#1077;&#1089;&#1087;&#1083;&#1072;&#1090;&#1085;&#1086;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1077; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077; &#1089;&#1086;&#1079;&#1076;&#1072;&#1105;&#1090;&#1089;&#1103; &#1083;&#1102;&#1076;&#1100;&#1084;&#1080;, &#1074;&#1082;&#1083;&#1072;&#1076;&#1099;&#1074;&#1072;&#1102;&#1097;&#1080;&#1084;&#1080; &#1074; &#1101;&#1090;&#1086; &#1055;&#1054; &#1087;&#1086; &#1089;&#1091;&#1090;&#1080; &#1087;&#1086;&#1083;&#1080;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1089;&#1084;&#1099;&#1089;&#1083;. &#1048; &#1089;&#1084;&#1099;&#1089;&#1083; &#1101;&#1090;&#1086;&#1090; &#1082;&#1088;&#1086;&#1077;&#1090;&#1089;&#1103; &#1074; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1080; &#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1103; &#1085;&#1072;&#1076; &#1085;&#1072;&#1096;&#1077;&#1081; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1081; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1081; &#1080;&#1085;&#1092;&#1088;&#1072;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1086;&#1081;. <strong><a href="http://ttfa.net/freesoftware" target="" title="">ttfa.net/freesoftware</a></strong></p>
<blockquote><em>
&#171;&#1044;&#1086;&#1083;&#1075;&#1072;&#1103; &#1088;&#1077;&#1074;&#1086;&#1083;&#1102;&#1094;&#1080;&#1103; &#1074;&#1077;&#1076;&#1105;&#1090; &#1085;&#1072;&#1089; &#8230; &#1082; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1102; &#1082;&#1086;&#1072;&#1083;&#1080;&#1094;&#1080;&#1080; &#1084;&#1080;&#1082;&#1088;&#1086;&#1086;&#1073;&#1097;&#1077;&#1089;&#1090;&#1074;, &#1085;&#1072;&#1089;&#1090;&#1086;&#1103;&#1097;&#1080;&#1093; &#1086;&#1095;&#1072;&#1075;&#1086;&#1074; &#1075;&#1077;&#1088;&#1080;&#1083;&#1100;&#1080;, &#1074; &#1073;&#1086;&#1088;&#1100;&#1073;&#1077; &#1079;&#1072; &#1074;&#1089;&#1077;&#1086;&#1073;&#1097;&#1077;&#1077; &#1089;&#1072;&#1084;&#1086;&#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;. &#1069;&#1092;&#1092;&#1077;&#1082;&#1090;&#1080;&#1074;&#1085;&#1072;&#1103; &#1088;&#1072;&#1076;&#1080;&#1082;&#1072;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100; &#1076;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1074;&#1089;&#1077; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090;&#1099;, &#1075;&#1072;&#1088;&#1072;&#1085;&#1090;&#1080;&#1088;&#1091;&#1077;&#1090; &#1074;&#1089;&#1077; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1099;.&#187;</em>&#160;&#1056;&#1072;&#1091;&#1083;&#1100; &#1042;&#1072;&#1085;&#1077;&#1081;&#1075;&#1077;&#1084; (Raoul Vaneigem)</blockquote>
<p>&#1058;&#1086;&#1095;&#1085;&#1086; &#1090;&#1072;&#1082;&#1072;&#1103; &#1078;&#1077; &#1092;&#1080;&#1083;&#1086;&#1089;&#1086;&#1092;&#1080;&#1103; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1080;&#1084;&#1072; &#1082; <strong>&#1089;&#1077;&#1090;&#1077;&#1074;&#1099;&#1084; &#1089;&#1077;&#1088;&#1074;&#1080;&#1089;&#1072;&#1084;</strong> &#8211; &#1089;&#1086;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1099;&#1084; &#1089;&#1077;&#1090;&#1103;&#1084; &#1080; &#1089;&#1072;&#1081;&#1090;&#1072;&#1084; &#1086;&#1073;&#1084;&#1077;&#1085;&#1072; &#1074;&#1080;&#1076;&#1077;&#1086;&#1088;&#1086;&#1083;&#1080;&#1082;&#1072;&#1084;&#1080;, &#1090;&#1072;&#1082;&#1080;&#1084; &#1082;&#1072;&#1082; Facebook &#1080; YouTube. &#1052;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1086; &#1083;&#1102;&#1076;&#1077;&#1081; &#1089;&#1086;&#1079;&#1076;&#1072;&#1105;&#1090; &#1089;&#1077;&#1090;&#1077;&#1074;&#1099;&#1077; &#1089;&#1077;&#1088;&#1074;&#1080;&#1089;&#1099;, &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1102;&#1097;&#1080;&#1077; &#1076;&#1077;&#1094;&#1077;&#1085;&#1090;&#1088;&#1072;&#1083;&#1080;&#1079;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1077; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1080; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1091; &#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;&#1084;&#1080;. &#1069;&#1090;&#1080; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1099; &#1086;&#1073;&#1089;&#1091;&#1078;&#1076;&#1072;&#1102;&#1090;&#1089;&#1103; &#1074; &#1088;&#1072;&#1079;&#1075;&#1086;&#1074;&#1086;&#1088;&#1077; &#1089; &#1069;&#1073;&#1077;&#1085; &#1052;&#1086;&#1075;&#1083;&#1077;&#1085;, &#171;&#1057;&#1074;&#1086;&#1073;&#1086;&#1076;&#1072; &#1074; &#1086;&#1073;&#1083;&#1072;&#1082;&#1077;&#187;. &#160;<strong><a href="http://ttfa.net/freecloud" target="" title="">ttfa.net/freecloud</a></strong></p>
<h3>&#1042;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077; &#1074; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1099;&#1093; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084; &#1089;&#1074;&#1103;&#1079;&#1080;</h3>
<p>&#1047;&#1072; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1077; &#1076;&#1074;&#1072;&#1076;&#1094;&#1072;&#1090;&#1100; &#1083;&#1077;&#1090; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1072;&#1103; &#1088;&#1077;&#1074;&#1086;&#1083;&#1102;&#1094;&#1080;&#1103; &#1088;&#1072;&#1076;&#1080;&#1082;&#1072;&#1083;&#1100;&#1085;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1083;&#1072; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073; &#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086;&#1083;&#1080;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1072;&#1082;&#1090;&#1080;&#1074;&#1080;&#1089;&#1090;&#1086;&#1074;; &#1085;&#1086; &#1074;&#1084;&#1077;&#1089;&#1090;&#1077; &#1089; &#1085;&#1086;&#1074;&#1099;&#1084;&#1080; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1103;&#1084;&#1080; &#1086;&#1089;&#1090;&#1072;&#1083;&#1072;&#1089;&#1100; &#1076;&#1072;&#1074;&#1085;&#1103;&#1103; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103; &#1082;&#1086;&#1085;&#1092;&#1080;&#1076;&#1077;&#1085;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080; &#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1082;&#1080; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080; &#1089;&#1074;&#1086;&#1080;&#1084; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1085;&#1080;&#1082;&#1072;&#1084;. &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1087;&#1089;&#1077;&#1074;&#1076;&#1086;&#1085;&#1080;&#1084;&#1072; (&#1080;&#1083;&#1080; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1093; &#1087;&#1089;&#1077;&#1074;&#1076;&#1086;&#1085;&#1080;&#1084;&#1086;&#1074;) - &#1089;&#1090;&#1072;&#1088;&#1086;&#1077;, &#1085;&#1086; &#1074;&#1089;&#1105; &#1077;&#1097;&#1105; &#1101;&#1092;&#1092;&#1077;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086;&#1077; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077; &#1101;&#1090;&#1086;&#1081; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099;.</p>
<p>&#1058;&#1072;&#1082; &#1082;&#1072;&#1082; &#1074;&#1077;&#1089;&#1100;&#1084;&#1072; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1085;&#1086;&#1077; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1083;&#1102;&#1076;&#1077;&#1081; &#1086;&#1089;&#1074;&#1077;&#1076;&#1086;&#1084;&#1083;&#1077;&#1085;&#1099; &#1086; &#1089;&#1074;&#1103;&#1079;&#1080; &#1074;&#1072;&#1096;&#1077;&#1081; &#1088;&#1077;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1083;&#1080;&#1095;&#1085;&#1086;&#1089;&#1090;&#1080; &#1080; &#1074;&#1072;&#1096;&#1077;&#1081; &#1083;&#1080;&#1095;&#1085;&#1086;&#1089;&#1090;&#1080; &#1074; &#1089;&#1077;&#1090;&#1080;, &#1088;&#1072;&#1079;&#1099;&#1089;&#1082;&#1072;&#1090;&#1100; &#1074;&#1072;&#1089; &#1073;&#1091;&#1076;&#1077;&#1090; &#1085;&#1077; &#1090;&#1072;&#1082; &#1090;&#1086; &#1080; &#1083;&#1077;&#1075;&#1082;&#1086; &#1074; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;, &#1077;&#1089;&#1083;&#1080; &#1074;&#1072;&#1096; &#1087;&#1089;&#1077;&#1074;&#1076;&#1086;&#1085;&#1080;&#1084; &#1073;&#1091;&#1076;&#1077;&#1090; &#1074; &#1095;&#1077;&#1084;-&#1090;&#1086; &#1079;&#1072;&#1087;&#1086;&#1076;&#1086;&#1079;&#1088;&#1077;&#1085;. &#1044;&#1083;&#1103; &#1101;&#1090;&#1086;&#1075;&#1086; &#1085;&#1091;&#1078;&#1085;&#1086; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1091;&#1089;&#1083;&#1091;&#1075;&#1072;&#1084;&#1080; &#1087;&#1086;&#1095;&#1090;&#1086;&#1074;&#1099;&#1093; &#1089;&#1077;&#1088;&#1074;&#1080;&#1089;&#1086;&#1074;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1085;&#1077; &#1073;&#1091;&#1076;&#1091;&#1090; (&#1080;&#1083;&#1080; &#1085;&#1077; &#1089;&#1084;&#1086;&#1075;&#1091;&#1090;) &#1088;&#1072;&#1089;&#1082;&#1088;&#1099;&#1090;&#1100; &#1087;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1091;&#1102; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102; &#1086; &#1074;&#1072;&#1089;, &#1076;&#1072;&#1078;&#1077; &#1077;&#1089;&#1083;&#1080; &#1086;&#1090; &#1085;&#1080;&#1093; &#1101;&#1090;&#1086; &#1073;&#1091;&#1076;&#1091;&#1090; &#1090;&#1088;&#1077;&#1073;&#1086;&#1074;&#1072;&#1090;&#1100; &#1075;&#1086;&#1089;&#1091;&#1076;&#1072;&#1088;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1077; &#1089;&#1080;&#1083;&#1086;&#1074;&#1099;&#1077; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1099;. &#1054;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077; &#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; &#8211; &#1101;&#1090;&#1086; &#1079;&#1072;&#1073;&#1086;&#1090;&#1072; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082;&#1072;. &#1044;&#1072;&#1078;&#1077; &#1077;&#1089;&#1083;&#1080; &#1074;&#1072;&#1096;&#1072; &#1076;&#1077;&#1103;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080; &#1074; &#1085;&#1072;&#1089;&#1090;&#1086;&#1103;&#1097;&#1080;&#1081; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1079;&#1072;&#1082;&#1086;&#1085;&#1085;&#1086;&#1081;, &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1087;&#1086;&#1084;&#1086;&#1095;&#1100; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1089;&#1077;&#1090;&#1100; &#1080;&#1085;&#1090;&#1077;&#1088;&#1085;&#1077;&#1090; &#1073;&#1086;&#1083;&#1077;&#1077; &#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1099;&#1084; &#1084;&#1077;&#1089;&#1090;&#1086;&#1084; &#1076;&#1083;&#1103; &#1074;&#1089;&#1077;&#1093; &#1080; &#1087;&#1086;&#1084;&#1086;&#1095;&#1100; &#171;&#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1100; &#1089;&#1077;&#1090;&#1100;&#187; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1080;&#1079; &#1085;&#1080;&#1078;&#1077;&#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1085;&#1099;&#1093; &#1084;&#1077;&#1088; &#1087;&#1086; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1102; &#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1089;&#1090;&#1080;.</p>
</div></body></html>
   

</div>
</div>

  </div>
</div>
<!-- End of content -->



<!-- sputnik error page -->
<div id="dialog-sputnik-qrac" style="display: none"></div>
<div id="dialog-sputnik-error" title="Can't communicate with booktype">
  <p>
    <span class="ui-icon ui-icon-circle-check" style="float:left; margin:0 7px 50px 0;"></span>
    There has been error in communication with Booktype server.
    Not sure right now where is the problem.
  </p>
  <p>
    You should refresh this page.
  </p>
</div>


<ul class="strings template">
 <li class="ok">OK</li>
 <li class="back">Back</li>
 <li class="create">Create</li>
 <li class="cancel">Cancel</li>
 <li class="next">Next</li>
 <li class="import">Import</li>
 <li class="savechanges">Save changes</li>
 <li class="errorcreategroup">Couldn't create a group!</li>
 <li class="msgepub">enter epub URL</li>
 <li class="msgarchive">enter Archive.org ID</li>
 <li class="msgwiki">enter Wikibooks URL</li>
 <li class="msgbooktype">enter Booktype URL</li>
 <li class="deletebook">Delete book</li>
</ul>

</body>
</html>

