
<!DOCTYPE HTML>
<html>
 <head>
   

<link type="text/css" href="/site_static/css/booki.css" rel="Stylesheet" >
<link type="text/css" href="/site_static/js/jquery/themes/base/jquery.ui.all.css" rel="Stylesheet" >
<link type="text/css" href="/site_static/js/jquery/themes/smoothness/jquery.ui.all.css" rel="Stylesheet" >
<script type="text/javascript" src="/site_static/js/jquery/jquery-1.4.4.js"></script>
<script type="text/javascript" src="/site_static/js/jquery/ui/jquery-ui-1.8.10.custom.js"></script>
<script type="text/javascript" src="/site_static/js/jquery.json-1.3.js"></script>
<script type="text/javascript" src="/site_static/js/booki.js"></script>
<script src="/site_static/js/messaging.js" type="text/javascript"></script>   
<script type="text/javascript" src="/site_static/js/general.js"></script>
<link href="/site_static/css/jquery.bubblepopup.v2.3.1.css" rel="stylesheet" type="text/css" />
<link type="text/css" href="/site_static/css/jquery-ui_overrides.css" rel="Stylesheet" >
<script src="/site_static/js/jquery.bubblepopup.v2.3.1.min.js" type="text/javascript"></script>

<link rel="SHORTCUT ICON" href="http://write.flossmanuals.net/site_static/images/favicon.ico" type="image/x-icon">
<meta property="og:site_name" content="FLOSS Manuals"/><meta name="description" content="Free Manuals for Freedom"/>

<script type="text/javascript">
  $(function() {
      $.booki.sputnikDispatcherURL = "/_sputnik/";

      $("#dialog-sputnik-error").dialog({
          modal: true,
          autoOpen: false,
          buttons: {
            Ok: function() {
               $(this).dialog('close');
               window.location = '.';
            }
          }
      });
  
      $("FORM.messagefield").messagefield('init', {'view_post': '/messaging/post' });  
  });
</script>


   
 <title>/chapter: Asetukset / Blender suomeksi</title>
 <link type="text/css" href="/site_static/css/draft.css" rel="Stylesheet" />

 <link rel="alternate" type="application/rss+xml" title="RSS feed for Blender suomeksi" href="/feeds/rss/book/blender-suomeksi/" /> 
 <link rel="alternate" type="application/atom+xml" title="Atom feed for Blender suomeksi" href="/feeds/atom/book/blender-suomeksi/" /> 

 <link rel="alternate" type="application/rss+xml" title="RSS feed for chapter ASETUKSET" href="/feeds/rss/chapter/blender-suomeksi/blender-suomeksi/" /> 
 <link rel="alternate" type="application/atom+xml" title="Atom feed for chapter ASETUKSET" href="/feeds/atom/chapter/blender-suomeksi/blender-suomeksi/" /> 
 
 <script type="text/javascript" src="/site_static/js/draft.js"></script>


   <link type="text/css" href="/static/css/_user.css" rel="Stylesheet" >
 </head>
<body>

<div class="topbar"> 
  <div class="logotext"><a href="http://write.flossmanuals.net/">FLOSS Manuals</a> </div>

  <div class="meta-bar">
    
    <ul>
      <li>
        <a href="/accounts/signin/?redirect=/blender-suomeksi/_draft/_v/1.0/asetukset/">Sign In / Create Account</a>
      </li>
    </ul>
    
    <div style="padding-top: 10px; padding-right: 15px;">
      <br/>
      

<script>
  $(function() {
    var $frm = $("FORM[name=changelang]");
	
    $("A[href=#]", $frm).click(function() {
        var lang = $(this).attr("class").substr(4);
	
        $("INPUT[name=language]", $frm).val(lang);
        $frm.submit();
	
        return false;
    });
  });
 </script>

<form name="changelang" method="POST" action="/accounts/i18n/setlang/?language=en-us">
  <input type="hidden" name="language" value="en-us">
  
    &nbsp;English&nbsp;|
  
  
  
    &nbsp;<a class="langes" href="#">Español</a>&nbsp;|
  

  
    &nbsp;<a class="langfr" href="#">Français</a>&nbsp;|
  
	
  
    &nbsp;<a class="langit" href="#">Italiano</a>&nbsp;|
  
	
  
    &nbsp;<a class="langpt" href="#">Português</a>&nbsp;|
  
	
  
    &nbsp;<a class="langru" href="#">Русский</a>&nbsp;|
  
	
  
    &nbsp;<a class="langsq" href="#">Shqip</a>
  	
</form>

    </div>
    
    
  </div><!-- End of .meta-bar -->
</div><!-- End top bar -->

<div class="menubar shadow">
  
  
  <div class="navbox">
    <ul>
      <li><a href="/list-books/">Books</a></li>
      <li><a href="/list-groups/">Groups</a></li>
      <li><a href="/list-people/">People</a></li>
    </ul>      
  </div><!-- End of .navbox -->       
</div>

<div class="content-container">
  <div class="content shadow">
    <!-- Content box and the drop shadow-->
    

<h2>Blender suomeksi</h2>
<div class="padded">
 <div id="bookmenu" style="background: url(/site_static/images/draft_bg.png) repeat !important;"> 
  <ul>
   
    
      <li><b>Johdanto</b></li>
    
   
    
      <li><a href="/blender-suomeksi/_draft/_v/1.0/johdanto/">JOHDANTO</a></li>
    
   
    
      <li><b>Asennus</b></li>
    
   
    
      <li><a href="/blender-suomeksi/_draft/_v/1.0/asennus-windowsiin/">ASENNUS WINDOWSIIN</a></li>
    
   
    
      <li><b>Käytännöt</b></li>
    
   
    
      <li><a href="/blender-suomeksi/_draft/_v/1.0/kaytannot/">KÄYTÄNNÖT</a></li>
    
   
    
      <li><b>Käyttöliittymä</b></li>
    
   
    
      <li><a href="/blender-suomeksi/_draft/_v/1.0/kayttoliittyma/">KÄYTTÖLIITTYMÄ</a></li>
    
   
    
      <li><b>Asetukset</b></li>
    
   
    
      <li><a href="/blender-suomeksi/_draft/_v/1.0/asetukset/">ASETUKSET</a></li>
    
   
    
      <li><b>Editointi</b></li>
    
   
    
      <li><a href="/blender-suomeksi/_draft/_v/1.0/editointi/">EDITOINTI</a></li>
    
   
    
      <li><a href="/blender-suomeksi/_draft/_v/1.0/esineen-luominen/">ESINEEN LUOMINEN</a></li>
    
   
    
      <li><b>Tekstuurit</b></li>
    
   
    
      <li><a href="/blender-suomeksi/_draft/_v/1.0/teksturointi/">TEKSTUROINTI</a></li>
    
   
    
      <li><b>Renderöinti</b></li>
    
   
    
      <li><a href="/blender-suomeksi/_draft/_v/1.0/renderointi/">RENDERÖINTI</a></li>
    
   
    
      <li><b>Tekijät</b></li>
    
   
    
      <li><a href="/blender-suomeksi/_draft/_v/1.0/tekijat/">TEKIJÄT</a></li>
    
   
  </ul>
 </div>
 <div id="bookcontent"   style="background: url(/site_static/images/draft_bg.png) repeat !important;">
   

  <h1><span style="font-size: 2em;">BLENDERIN ASETUKSET</span></h1>
<p>Nyt olet asentanut Blenderin. Laitetaan asetukset valmiiksi ty&ouml;t&auml; varten. T&auml;m&auml; osa on erityisen t&auml;rke&auml; kannettavan tietokoneen k&auml;ytt&auml;jille tai ihmisille, jotka tahtovat k&auml;ytt&auml;&auml; hiirt&auml; vasemmalla k&auml;dell&auml;.</p>
<p>Valitettavasti Blenderin k&auml;ytt&ouml;liittym&auml;&auml; ei ole viel&auml; kokonaan k&auml;&auml;nnetty suomeksi, joten t&auml;ss&auml; k&auml;ytt&ouml;oppaassa opastetaan k&auml;ytt&auml;m&auml;&auml;n englanninkielist&auml; k&auml;ytt&ouml;liittym&auml;&auml;. K&auml;ytt&ouml;opas p&auml;ivitet&auml;&auml;n, kun Blenderin k&auml;ytt&ouml;liittym&auml; on suomennettu kokonaan.</p>
<h2>Blenderin asetusvalikko</h2>
<p>L&ouml;yd&auml;t Blenderin asetukset k&auml;ytt&ouml;liittym&auml;n vasemmassa yl&auml;nurkassa olevan <strong>i</strong>-napin alta.</p>
<p><img src="static/ScreenHunter_20%20Apr.%2016%2018.31.gif" alt="" /></p>
<p>Paina valikon kohdalla <strong>VHN </strong>ja se avautuu.</p>
<p><img src="static/ScreenHunter_21%20Apr.%2016%2018.34.gif" alt="" /></p>
<p>Valitse valikosta <strong>User Preferences</strong> ja napsauta <strong>VHN</strong>. Asetukset ilmestyv&auml;t ruudun yl&auml;osaan. Voit laajentaa t&auml;m&auml;n valikon viem&auml;ll&auml; hiiren sen alareunaan, jolloin hiiren osoitin muuttuu kaksip&auml;iseksi nuoleksi, pit&auml;m&auml;ll&auml; <strong>VHN </strong>pohjassa ja vet&auml;m&auml;ll&auml; alasp&auml;in.</p>
<p><img src="static/ScreenHunter_27%20Apr.%2016%2018.44.gif" alt="" /></p>
<p>Useimmiten asetuksia ei tarvitse muuttaa. Voit kuitenkin muuttaa asetuksia, jos olet vasenk&auml;tinen tai k&auml;yt&auml;t Blenderi&auml; kannettavalla koneella, jossa ei ole erillist&auml; numeron&auml;pp&auml;imist&ouml;&auml;. Voit my&ouml;s tarkastella muutamia muita asetuksia.</p>
<h2>Numeron&auml;pp&auml;imist&ouml;n emulointi kannettavassa</h2>
<p>K&auml;ytt&auml;ess&auml;si kannettavaa tietokonetta, jossa ei ole numeron&auml;pp&auml;imist&ouml;&auml;, voit laittaa p&auml;&auml;lle tavallisen tietokoneen numeron&auml;pp&auml;imist&ouml;n emuloinnin.</p>
<p>Valitse ensin kohta <strong>Input </strong>asetusikkunan yl&auml;osassa olevasta valikosta.</p>
<p><img src="static/ScreenHunter_28%20Apr.%2016%2018.54.gif" alt="" /></p>
<p>&nbsp;</p>
<p>T&auml;ss&auml; valikossa voit rastia ruudun kohdassa <strong>Emulate Numpad</strong>.</p>
<p><img src="static/ScreenHunter_31%20Apr.%2016%2018.57.gif" alt="" /></p>
<p>Kannettavan tietokoneiden k&auml;ytt&auml;jien kannattaa k&auml;ytt&auml;&auml; t&auml;t&auml; vaihtoehtoa. T&auml;m&auml; mahdollistaa kannettavan tietokoneen n&auml;pp&auml;imist&ouml;n numeroiden k&auml;yt&ouml;n samaan tarkoitukseen, johon niit&auml; k&auml;ytet&auml;&auml;n tavallisessa n&auml;pp&auml;imist&ouml;ss&auml;: n&auml;k&ouml;kulman korkeustason muuttamiseen (esimerksi n&auml;k&ouml;kulma edest&auml; = <strong>1-n&auml;pp&auml;in</strong>, n&auml;k&ouml;kulma ylh&auml;&auml;lt&auml; = <strong>7-n&auml;pp&auml;in</strong>).&nbsp;</p>
<h2>Hiiren valintanapin vaihtaminen</h2>
<p>Oletusarvoisesti valintaan k&auml;ytet&auml;&auml;n <strong>OHN</strong>. Jos tahdot tehd&auml; valinnan <strong>VHN</strong>, valitse <strong>Left </strong>kohdasta <strong>Select With</strong>.</p>
<p><img src="static/ScreenHunter_32%20Apr.%2016%2019.02.gif" alt="" /></p>
<p>Jos teet n&auml;in, joudut vaihtamaan k&auml;ytt&ouml;oppaassa mainitut <strong>OHN </strong>ja <strong>VHN </strong>-painallukset kesken&auml;&auml;n. Kaikissa ohjeissa k&auml;ytet&auml;&auml;n oletusarvoista <strong>OHN</strong>-valintaa.</p>
<h3>Kumottavien toimenpiteiden historia</h3>
<p><strong> </strong>Muokataksesi kumottavien toimenpiteiden historiaa, mene yl&auml;valikossa kohtaan <strong>Editing</strong>.&nbsp;<strong></strong></p>
<p><img src="static/ScreenHunter_33%20Apr.%2016%2019.05.gif" alt="" width="507" height="105" />&nbsp;</p>
<p>Kohdassa <strong>Undo </strong>olevan <strong>Steps</strong>-liukus&auml;&auml;timen avulla voit muuttaa kumottavien toimintojen s&auml;ilytyst&auml; historiassa.</p>
<p><img src="static/ScreenHunter_34%20Apr.%2016%2019.07.gif" alt="" /></p>
<p>Liukus&auml;&auml;din osoittaa, kuinka monta toimintoa Blender muistaa, jotta voit kumota sit&auml;. Kun opettelet Blenderin k&auml;ytt&ouml;&auml; tai ty&ouml;skentelet ison projektin parissa, varmista ett&auml; se on asetettu maksiarvoon, joka on 64.</p>
<h3>Tiedostopolku</h3>
<p>Tiedostopolkuja muuttaaksesi voit menn&auml; yl&auml;valikossa kohtaan <strong>File</strong>. K&auml;ytt&auml;m&auml;si tiedostopolut voit valita tiedostopolkuselaimista, jotka ovat kohdassa <strong>File Paths.</strong></p>
<p><img src="static/ScreenHunter_36%20Apr.%2016%2019.09.gif" alt="" /></p>
<p>Jos tahdot k&auml;ytt&auml;&auml; Blender-ymp&auml;rist&ouml;iss&auml;si omia kirjasimia, tekstuureja tai &auml;&auml;ni&auml;, voit asettaa n&auml;ill&auml; selaimilla polut tiedostoihisi.</p>
<h2>N&auml;k&ouml;kulmien luominen</h2>
<p>Blender on jo k&auml;ytt&ouml;kelpoinen, mutta sen k&auml;ytett&auml;vyytt&auml; voi viel&auml; parantaa. Annetaanpas kohtauksellemme enemm&auml;n "silmi&auml;", jotta n&auml;emme ty&ouml;mme useammasta kulmasta samaan aikaan.</p>
<p>Hyv&auml; tapa ajatella kolmiulotteisia n&auml;k&ouml;kulmia on kuvitella, ett&auml; ne ovat kohtausta kuvaavia "kameroita."</p>
<p>Napsauta <strong>OHN </strong>kolmiulotteisen n&auml;kym&auml;n yl&auml;reunassa, jolloin valikko avautuu.&nbsp;</p>
<p><img src="static/ScreenHunter_37%20Apr.%2016%2019.19.gif" alt="" /></p>
<p>Kuvan valikko suomennettuna:</p>
<p><strong>Split Area</strong> - Jaa alue</p>
<p><strong>Join Area </strong>- Liit&auml; alueet</p>
<p>Valitse <strong>Split Area</strong> napsauttamalla <strong>VHN </strong>kerran. N&auml;et vaaleanharmaan ylh&auml;&auml;lt&auml; alas suuntautuvan viivan, joka seuraa hiiren osoitinta ja jatkuu koko kuvaikkunan l&auml;pi.</p>
<p><img src="static/ScreenHunter_38%20Apr.%2016%2019.21.gif" alt="" /></p>
<p>Siirr&auml; se kuvaikkunan keskelle ja napsauta <strong>VHN </strong>uudestaan. Olet juuri jakanut kuvaikkunan kahtia, tuottaen kaksi erillist&auml; n&auml;k&ouml;kulmaa tulevaan kohtaukseemme.</p>
<p><img src="static/ScreenHunter_39%20Apr.%2016%2019.23.gif" alt="" /></p>
<p>Napsauta <strong>OHN </strong>&auml;sken luomasi viivan kohdalla, joka jakaa ruudun vasempaan ja oikeaan osaan, valitse Split Area, ja n&auml;et uuden viivan, jolla voit jakaa kuvaikkunan kahtia oikealta vasemmalle. Vie viiva sopivaan kohtaan ja napsauta <strong>VHN</strong>. Nyt n&auml;et kolme n&auml;k&ouml;kulmaa.</p>
<p><img src="static/ScreenHunter_40%20Apr.%2016%2019.26.gif" alt="" /></p>
<p>Voit yhdist&auml;&auml; jakamasi ikkunat napsauttamalla <strong>OHN </strong>rajaviivan kohdalta ja valitsemalla <strong>Join Areas</strong> valikosta. Kuvaikkunaan ilmestyy suuri nuoli, jonka avulla voit valita kumpaan ikkunaan toinen ikkuna yhdistet&auml;&auml;n.</p>
<h2>N&auml;k&ouml;kulmat ja akselit</h2>
<p>Huomaa pienet vihre&auml;t, siniset ja punaiset nuolet jokaisen n&auml;k&ouml;kulman ikkunan alaosassa.</p>
<p><img src="static/ScreenHunter_41%20Apr.%2016%2019.30.gif" alt="" /></p>
<p>N&auml;m&auml; ovat kaksiulotteiset akselit, jotka kertovat meille, mist&auml; kolmiulotteisesta korkeustasosta katsomme n&auml;kym&auml;&auml;. T&auml;m&auml; voi tuntua aluksi monimutkaiselta, mutta se muuttuu helpommaksi, kun opit ett&auml; n&auml;m&auml; ovat pysyvi&auml; suuntia Blenderiss&auml;. Ne t&auml;ytyy vain muistaa: positiivinen Z osoittaa yl&ouml;sp&auml;in, positiivinen Y osoittaa poisp&auml;in meist&auml;, positiivinen X osoittaa oikealle meist&auml;.</p>
<p>Hyv&auml; tapa muistaa t&auml;m&auml; on laittaa vasen k&auml;si ampuma-asentoon - kuin pistooli - niin, ett&auml; keskisormi osoittaa vasemmalle, peukalo osoittaa yl&ouml;s ja etusormi osoittaa eteenp&auml;in. T&auml;ss&auml; asennossa peukalo osoittaa positiivista Z-akselia pitkin, keskisormi osoittaa positiivista X-akselia pitkin, ja etusormi osoittaa positiivista Y-akselia pitkin (t&auml;m&auml; temppu on satoja vuosia vanha).</p>
<p>Ajatellaanpa kaikkea t&auml;t&auml; Blenderin n&auml;k&ouml;kulmien kannalta. Voimme katsoa alas kohtaukseemme <strong>Top </strong>(ylh&auml;&auml;lt&auml;) -n&auml;kym&auml;st&auml; (alas Z-akselia pitkin Y ja X -akseleihin), <strong>Front</strong> (edest&auml;) -n&auml;kym&auml;st&auml; (eteenp&auml;in Y-akselia pitkin Z ja X -akseleihin), tai <strong>Side </strong>(sivulta) -n&auml;kym&auml;st&auml; (oikealle X-akselia pitkin Z ja Y -akseleihin).</p>
<p>Kuvaikkunan akseleita katsoen on selv&auml;&auml;, ett&auml; kaikki nykyiset kuvaikkunamme katsovat esinett&auml; alasp&auml;in huipulta (Y ja X). Muutetaan t&auml;m&auml; joksikin hy&ouml;dyllisemm&auml;ksi.</p>
<p>Siirr&auml; oikeanpuoleinen ja ylempi ikkunasi <strong>Front </strong>(edest&auml;) -n&auml;kym&auml;&auml;n k&auml;ytt&auml;en <strong>View </strong>(n&auml;kym&auml;) -valikkoa kuvaikkunan alapalkissa.</p>
<p><img src="static/ScreenHunter_44%20Apr.%2016%2019.35.gif" alt="" /></p>
<p>N&auml;et nyt ikkunassa erilaisen n&auml;kym&auml;n. Vasemmassa yl&auml;nurkassa oleva teksti <strong>Front Persp</strong> ilmoittaa ikkunan olevan perspektiivin&auml;kym&auml;ss&auml; edest&auml;.</p>
<p><img src="static/ScreenHunter_46%20Apr.%2016%2019.42.gif" alt="" /></p>
<p>Muuta nyt vasemmanpuoleinen ikkuna <strong>Right </strong>(oikealta) -n&auml;kym&auml;&auml;n samalla tavalla. Vaihda ortograafinen n&auml;kym&auml; perspektiivin&auml;kym&auml;&auml;n valitsemalla <strong>View Persp/Ortho</strong> samasta valikosta.&nbsp;</p>
<p><img src="static/ScreenHunter_45%20Apr.%2016%2019.39.gif" alt="" />&nbsp;</p>
<p>N&auml;in vaihdat ortograafisen projektion perspektiiviksi. T&auml;m&auml; merkitsee matemaattisen render&ouml;innin muuttamista luonnolliseksi render&ouml;inniksi, joka matkii tapaa, jolla ihminen n&auml;kee esineet.</p>
<p>Nyt viimeiset parannukset. Siirr&auml; hiiren kohdistin vasemmanpuoleisen kuvaikkunan p&auml;&auml;lle. N&auml;in kerromme Blenderille, ett&auml; aiomme tehd&auml; toimenpiteen juuri siin&auml; ikkunassa (t&auml;m&auml; on valinta hiiren kohdistuksella, englanniksi Mouse Focus Selection). Paina nyt <strong>HKN </strong>- kyll&auml;, hiiren keskell&auml; oleva py&ouml;riv&auml; nappi - kunnes se napsahtaa. Pid&auml; sit&auml; alhaalla ja ved&auml; alasp&auml;in hiirell&auml;. Nyt kierit&auml;t kuvaikkunaa keskipisteen ymp&auml;rill&auml;, n&auml;in kierit&auml;mme kuvaikkunaa Blenderiss&auml;. Teemme t&auml;t&auml; paljon jatkossa.</p>
<p>Lopulta Blenderin k&auml;ytt&ouml;liittym&auml;ss&auml; pit&auml;isi n&auml;ky&auml; jotain t&auml;llaista:</p>
<p><img src="static/ScreenHunter_50%20Apr.%2016%2019.47.gif" alt="" width="458" height="377" /></p>
<p>Olisi tuskallista tehd&auml; t&auml;m&auml; aina k&auml;ynnist&auml;ess&auml;si Blenderin, joten kannattaa tallentaa se oletusasetuksena, joten seuraavalla kerralla avatessasi Blenderin n&auml;et saman n&auml;kym&auml;n. Tehd&auml;ksesi t&auml;m&auml;n napsauta nappia<strong> Save As Default</strong> tai paina <strong>CTRL-U</strong>. T&auml;m&auml;n kanssa kannattaa kuitenkin olla varovainen, sill&auml; se tallentaa oletusarvoisesti avattavaksi tiedostoksi n&auml;kym&auml;n lis&auml;ksi my&ouml;s tekem&auml;si muokkaukset.</p>
<p><img src="static/ScreenHunter_51%20Apr.%2016%2019.50.gif" alt="" />&nbsp;</p>
<p>Seuraavaksi hieman editointia Blenderill&auml;!</p>
<p>&nbsp;</p>
   
  </div>
 </div>


  </div>
</div>
<!-- End of content -->



<!-- sputnik error page -->
<div id="dialog-sputnik-qrac" style="display: none"></div>
<div id="dialog-sputnik-error" title="Can't communicate with booktype">
  <p>
    <span class="ui-icon ui-icon-circle-check" style="float:left; margin:0 7px 50px 0;"></span>
    There has been error in communication with Booktype server.
    Not sure right now where is the problem.
  </p>
  <p>
    You should refresh this page.
  </p>
</div>


<ul class="strings template">
 <li class="ok">OK</li>
 <li class="back">Back</li>
 <li class="create">Create</li>
 <li class="cancel">Cancel</li>
 <li class="next">Next</li>
 <li class="import">Import</li>
 <li class="savechanges">Save changes</li>
 <li class="errorcreategroup">Couldn't create a group!</li>
 <li class="msgepub">enter epub URL</li>
 <li class="msgarchive">enter Archive.org ID</li>
 <li class="msgwiki">enter Wikibooks URL</li>
 <li class="msgbooktype">enter Booktype URL</li>
 <li class="deletebook">Delete book</li>
</ul>

</body>
</html>

