
<!DOCTYPE HTML>
<html>
 <head>
   

<link type="text/css" href="/site_static/css/booki.css" rel="Stylesheet" >
<link type="text/css" href="/site_static/js/jquery/themes/base/jquery.ui.all.css" rel="Stylesheet" >
<link type="text/css" href="/site_static/js/jquery/themes/smoothness/jquery.ui.all.css" rel="Stylesheet" >
<script type="text/javascript" src="/site_static/js/jquery/jquery-1.4.4.js"></script>
<script type="text/javascript" src="/site_static/js/jquery/ui/jquery-ui-1.8.10.custom.js"></script>
<script type="text/javascript" src="/site_static/js/jquery.json-1.3.js"></script>
<script type="text/javascript" src="/site_static/js/booki.js"></script>
<script src="/site_static/js/messaging.js" type="text/javascript"></script>   
<script type="text/javascript" src="/site_static/js/general.js"></script>
<link href="/site_static/css/jquery.bubblepopup.v2.3.1.css" rel="stylesheet" type="text/css" />
<link type="text/css" href="/site_static/css/jquery-ui_overrides.css" rel="Stylesheet" >
<script src="/site_static/js/jquery.bubblepopup.v2.3.1.min.js" type="text/javascript"></script>

<link rel="SHORTCUT ICON" href="http://write.flossmanuals.net/site_static/images/favicon.ico" type="image/x-icon">
<meta property="og:site_name" content="FLOSS Manuals"/><meta name="description" content="Free Manuals for Freedom"/>

<script type="text/javascript">
  $(function() {
      $.booki.sputnikDispatcherURL = "/_sputnik/";

      $("#dialog-sputnik-error").dialog({
          modal: true,
          autoOpen: false,
          buttons: {
            Ok: function() {
               $(this).dialog('close');
               window.location = '.';
            }
          }
      });
  
      $("FORM.messagefield").messagefield('init', {'view_post': '/messaging/post' });  
  });
</script>


   
 <title>/chapter: Comandante / Introducción a la línea de comandos</title>
 <link type="text/css" href="/site_static/css/draft.css" rel="Stylesheet" />

 <link rel="alternate" type="application/rss+xml" title="RSS feed for Introducción a la línea de comandos" href="/feeds/rss/book/introduccion-a-la-linea-de-comandos/" /> 
 <link rel="alternate" type="application/atom+xml" title="Atom feed for Introducción a la línea de comandos" href="/feeds/atom/book/introduccion-a-la-linea-de-comandos/" /> 

 <link rel="alternate" type="application/rss+xml" title="RSS feed for chapter Introducción" href="/feeds/rss/chapter/introduccion-a-la-linea-de-comandos/introduccion-a-la-linea-de-comandos/" /> 
 <link rel="alternate" type="application/atom+xml" title="Atom feed for chapter Introducción" href="/feeds/atom/chapter/introduccion-a-la-linea-de-comandos/introduccion-a-la-linea-de-comandos/" /> 
 
 <script type="text/javascript" src="/site_static/js/draft.js"></script>


   <link type="text/css" href="/static/css/_user.css" rel="Stylesheet" >
 </head>
<body>

<div class="topbar"> 
  <div class="logotext"><a href="http://write.flossmanuals.net/">FLOSS Manuals</a> </div>

  <div class="meta-bar">
    
    <ul>
      <li>
        <a href="/accounts/signin/?redirect=/introduccion-a-la-linea-de-comandos/_draft/_v/1.0/comandante/">Sign In / Create Account</a>
      </li>
    </ul>
    
    <div style="padding-top: 10px; padding-right: 15px;">
      <br/>
      

<script>
  $(function() {
    var $frm = $("FORM[name=changelang]");
	
    $("A[href=#]", $frm).click(function() {
        var lang = $(this).attr("class").substr(4);
	
        $("INPUT[name=language]", $frm).val(lang);
        $frm.submit();
	
        return false;
    });
  });
 </script>

<form name="changelang" method="POST" action="/accounts/i18n/setlang/?language=en-us">
  <input type="hidden" name="language" value="en-us">
  
    &nbsp;English&nbsp;|
  
  
  
    &nbsp;<a class="langes" href="#">Español</a>&nbsp;|
  

  
    &nbsp;<a class="langfr" href="#">Français</a>&nbsp;|
  
	
  
    &nbsp;<a class="langit" href="#">Italiano</a>&nbsp;|
  
	
  
    &nbsp;<a class="langpt" href="#">Português</a>&nbsp;|
  
	
  
    &nbsp;<a class="langru" href="#">Русский</a>&nbsp;|
  
	
  
    &nbsp;<a class="langsq" href="#">Shqip</a>
  	
</form>

    </div>
    
    
  </div><!-- End of .meta-bar -->
</div><!-- End top bar -->

<div class="menubar shadow">
  
  
  <div class="navbox">
    <ul>
      <li><a href="/list-books/">Books</a></li>
      <li><a href="/list-groups/">Groups</a></li>
      <li><a href="/list-people/">People</a></li>
    </ul>      
  </div><!-- End of .navbox -->       
</div>

<div class="content-container">
  <div class="content shadow">
    <!-- Content box and the drop shadow-->
    

<h2>Introducción a la línea de comandos</h2>
<div class="padded">
 <div id="bookmenu" style="background: url(/site_static/images/draft_bg.png) repeat !important;"> 
  <ul>
   
    
      <li><b>Introducción</b></li>
    
   
    
      <li><a href="/introduccion-a-la-linea-de-comandos/_draft/_v/1.0/acerca-de-este-manual/">Acerca de este manual</a></li>
    
   
    
      <li><a href="/introduccion-a-la-linea-de-comandos/_draft/_v/1.0/comandante/">Introducción</a></li>
    
   
    
      <li><b>Lo básico</b></li>
    
   
    
      <li><a href="/introduccion-a-la-linea-de-comandos/_draft/_v/1.0/comenzando/">Primeros Pasos</a></li>
    
   
    
      <li><a href="/introduccion-a-la-linea-de-comandos/_draft/_v/1.0/sintaxis-inicial/">Sintaxis Inicial</a></li>
    
   
    
      <li><a href="/introduccion-a-la-linea-de-comandos/_draft/_v/1.0/moviendose-por-ahi/">Moviendose por ahí</a></li>
    
   
  </ul>
 </div>
 <div id="bookcontent"   style="background: url(/site_static/images/draft_bg.png) repeat !important;">
   

  <h1><span id="result_box" class="short_text" lang="es"><span class="alt-edited">P&oacute;ngase en el Comando</span></span></h1>
<p>Los comandos te permiten versatilidad. Te lo demostraremos a partir de una tarea con la que seguramente est&aacute;s familiarizado. Imaginemos que tienes una c&aacute;mara digital. Es probable que tengas una carpeta repleta de fotos en alguna computadora. Imaginemos que deseas redimenzionar la imagen "profile.jpg" a 300 pixeles de ancho y luego guardarla como una imagen nueva llamada "profile_min.jpg"<br /><br />Usando un editor de im&aacute;genes con GUI (Graphical User Interface, o interfaz gr&aacute;fica de usuarios) los pasos que necesitas dar son los siguientes:</p>
<ol>
<li>Abrir un editor de im&aacute;genes desde el men&uacute; de aplicaciones.</li>
<li>Seleccionar la pesta&ntilde;a Archivo(File)&gt;Abrir(Open).</li>
<li>Buscar y seleccionar la carpeta donde est&aacute; almacenada la foto.</li>
<li>Hacer click (o doble click) sobre el &iacute;cono o nombre de la imagen y seleccionar el bot&oacute;n Abrir(Open).</li>
<li>Seleccionar la pesta&ntilde;a Im&aacute;genes(Image)&gt;Redimensionar(Resize).</li>
<li>Cambiar el ancho de la imagen a 300 pixeles y hacer click en Escalar(Scale).</li>
<li>Selecionar la pesta&ntilde;a Archivo(File)&gt;Guardar como(Save as).</li>
<li>Ingresar el nombre profile_min.jpg y click en Guardar(Save).</li>
</ol>
<p><img src="https://flossmanuals.net/command-line/_booki/command-line/static/IntroCommandLine-CommandLineIntro-photo_gimp-en.png" alt="" /></p>
<p>Con la l&iacute;nea de comandos puedes obtener el mismo resultado ingresando:<br /><br />convert -resize 300 profile.jpg profile_min.jpg<br /><br />Esto es un solo paso en la linea de comandos, en lugar de ocho usando el editor de im&aacute;genes.<br />Quiz&aacute;s a&uacute;n consideres que el tiempo que implica leer este libro y estudiar la linea de comandos no amerita el ahorro de siete pasos. &iquest;Pensar&iacute;as igual si las im&aacute;genes a redimensionar fueran treinta? &iquest;Todav&iacute;a elegir&iacute;as abrir cada imagen individualmente y repetir&iacute;as el proceso treinta veces usando el editor de im&aacute;genes?. Esa decisi&oacute;n implicar&iacute;a un total de doscientos cuarenta pasos.&iquest;No elegir&iacute;as un solo comando para realizar ese trabajo ?</p>
<p>Un solo comando puede realizar la misma tarea, ya sean treinta, trescientas o tres mil im&aacute;genes. Esta es una raz&oacute;n convincente para comenzar a utilizar la l&iacute;nea de comandos. La curva de aprendizaje puede avanzar lentamente en principio. Pero con el tiempo ahorrar&aacute;s m&aacute;s tiempo del que implica el aprendizaje.<br />Todav&iacute;a m&aacute;s importante es que aprendiendo a manejar comandos descubrir&aacute;s posibilidades interesantes y formas divertidas de hacer el trabajo. D&eacute;janos mostrarte algunas otras razones de por qu&eacute; conocer la linea de comando es una buena idea.</p>
<p><strong>Las ventajas de usar comandos</strong><br /><br />&iexcl;Muchas de las personas que prueban la l&iacute;nea de comando se maravillan tanto acerca de las posibilidades que ya no desean regresar a las interfaces gr&aacute;ficas de usuario(GUI)!.&iquest;Por qu&eacute;?. Bueno, en resumen, la l&iacute;nea de comandos ofrece ventajas, descritas a continuaci&oacute;n, por sobre el software gr&aacute;fico:<br /><br />-Flexibilidad: Con el software gr&aacute;fico es com&uacute;n que alcances un l&iacute;mite. Simplemente no puedes hacer aquello que deseas y necesitas encontrar formas suplementarias de trabajo para sortear los l&iacute;mites del programa.<br />Con la l&iacute;nea de comandos, puedes combinar comandos para alcanzar un rango virtualmente infinito de nuevas e interesantes funciones. Combinando comandos de forma creativa puedes hacer que la l&iacute;nea de comandos haga exactamente aquello que quieres que haga. T&uacute; controlas tu inform&aacute;tica.<br /><br />Confiabilidad: Los programas gr&aacute;ficos suelen ser inmaduros e incluso, y por esto, inestables. En contraste, la mayor&iacute;a de las herramientas que la linea de comandos ofrece son realmente confiables.<br />Una de las razones para confiar se debe a la madurez de las mismas.<br />Los programas m&aacute;s antiguos de la linea de comandos datan de fines de los setentas. Esto significa que esos comandos han estado sometidos a examen por m&aacute;s de cuatro d&eacute;cadas.<br />Esto tambi&eacute;n significa que han tendido a funcionar de la misma manera sobre diferentes sistemas operativos.(2) No as&iacute; las herramientas gr&aacute;ficas.<br />Si t&uacute; deseas una navaja suiza puedes disponer de ella. Se llama linea de comandos.&nbsp;&nbsp; <br /><br />(2)N.del T.: Muchas herramientas de la linea de comandos son funcionalidades del sistema Unix que el Proyecto GNU decidi&oacute; imitar, para as&iacute; permitir la migraci&oacute;n de los usuarios de Unix al Sistema GNU (si se necesita referencia, puede encontrarse en el libro "Software libre para una sociedad libre" de Richard Stallman). Las licencias libres de estas herramientas permiten dar a conocer los c&oacute;digos fuente a la comunidad. &Eacute;sta se ocupa de conocer las funcionalidades, preservando las que funcionan correctamente, descartando o modificando aquellas que presentan problemas o errores, y agregando nuevas funcionalidades.<br />La confiabilidad de muchas herramientas brota de su antiguedad, pero tambi&eacute;n de su condici&oacute;n de software libre.<br /><br />Velocidad: Los bonitos entornos gr&aacute;ficos consumen much&iacute;simos recursos de hardware, y un resultado de esto es una mayor lentitud e inestabilidad. Por otro lado, la linea de comandos utiliza los recursos de la computadora de forma m&aacute;s austera, daj&aacute;ndoles utilizar la memoria y el poder de procesamiento a las tareas que en ese momento est&aacute;s tratando de realizar.<br />La linea de comandos es intr&iacute;nsecamente m&aacute;s r&aacute;pida. En lugar de tener que clickear buscando a trav&eacute;s de largas cadenas de men&uacute;es gr&aacute;ficos, t&uacute; puedes ingresar comandos tecleando un poco y, de ser necesario, aplicar el comando a m&uacute;ltiples archivos. Si eres r&aacute;pido para tipear, esto te permitir&aacute; incrementar dr&aacute;sticamente tu productividad.<br /><br />Experiencia: Usar la l&iacute;nea de comandos es una gran experiencia de aprendizaje. Cuando usas la l&iacute;nea de comandos te comunicas de forma m&aacute;s directa con la computadora. Y por ese motivo, aprendes mucho m&aacute;s acerca de su funcionamiento interno. Usar la l&iacute;nea de comandos con regularidad es un de los pasos fundamentales para llegar a ser un gur&uacute; de los sistemas GNU/linux.<br /><br />Diversi&oacute;n: &iquest;Alguna vez deseaste ser como esos hackers que logran que una m&aacute;quina con GNU/linux haga cosas inimaginables?. Una vez que aprendas a usar esta poderosa heraamienta, te encontrar&aacute;s haciendo cosas interesantes y divertidas que nunca hab&iacute;as imaginado.<br /><br /><strong>El valor de los scripts (guiones)</strong>(3)<br /><br />(3)N.del T.: Mantengo el t&eacute;rmino script en el ingl&eacute;s original debido a la popularidad del mismo en la comunidad hispanoparlante de usuarios de GNU/Linux. El uso y la comprensi&oacute;n complejos de los scripts tambi&eacute;n se difundi&oacute; con una palabra inglesa: scripting. La incapacidad de reemplazar la palabra script puede deberse en parte a que la palabra que se propuso para reemplazarla, gui&oacute;n, como el de una obra teatral, es ambigua y tambi&eacute;n remite al caracter "-", muy utilizado en inform&aacute;tica. <br /><br />Pero espera. &iexcl;A&uacute;n hay m&aacute;s!. Puedes almacenar comandos en archivos de texto plano. Esos archivos son llamados scripts, &oacute; guiones en algunas traducciones al castellano, y pueden ser ejecutados como reemplazo al tipeo de largos comandos. Por ejemplo, si almacenas comandos en un archivo llamado miscomandos.sh, ya no necesitar&aacute;s ingresar esas l&iacute;neas cada vez. Bastar&aacute; con ingresar:<br /><br />./miscomandos.sh<br /><br />(4)N. del T.: Esto ser&aacute; as&iacute; una vez que se le hayan dado permisos de ejecusi&oacute;n al archivo. Este es s&oacute;lo un ejemplo ilustrativo de las posibilidades del script.<br /><br />Adem&aacute;s puedes combinar los comandos de formas simples, o de ser necesario, muy complejas. M&aacute;s a&uacute;n, puedes programar los scripts para que se ejecuten en un determinado horario o en un fecha determinada. O mismo ante un suceso espec&iacute;fico en tu computadora.<br /><br />Pudes tambi&eacute;n escribir scripts que acepten informaci&oacute;n adicional que tu desees ingresar. Por ejemplo. imagina un script de redimencionamiento de im&aacute;genes que deba preguntarte el tama&ntilde;o resultante antes de comenzar el proceso.<br /><br />&iquest;Hab&iacute;as tratado de hacer algo remotamente parecido a esto usando la interfaz gr&aacute;fica(GUI)?. Quiz&aacute;s ahora puedas ver c&oacute;mo trabajando con la interfaz de l&iacute;nea de comandos(CLI, por sus siglas en ingl&eacute;s: Command Line Interface) comienza a abrirse un mundo completamente nuevo para el uso de las computadoras.<br /><br /><strong>&iquest;Est&aacute; eneferma esta computadora?</strong><br /><br />La l&iacute;nea de comandos tambi&eacute;n es utilizada para comprobar el correcto funcionamiento de la computadora. Hay muchos comandos que puedes usar para verificar cada aspecto de la salud de la computadora. Desde la cantidad de espacio libre en el disco duro hasta la temperatura del CPU.<br />si la computadora muestra un desempe&ntilde;o pobre y deseas conocer el porqu&eacute;, unos cuantos comandos te ayudar&aacute;n a determinar de forma precisa si es un problema de hardware o de software, y te ayudar&aacute;n a rectificar rapidamente el problema.</p>
<p><strong>Extendiendo la red</strong><br /><br />Otra interesante caracter&iacute;stica de la l&iacute;nea de comandos que las GGI no pueden alcanzar es la interacci&oacute;n sobre la red. Imagina que tu computadora est&aacute; en otra habitaci&oacute;n y que tu deseas apagarla.&iquest;C&oacute;mo hacer?&iquest;F&aacute;cil? Digamos que te levantas, caminas hasta la computadora y presionas el bot&ograve;n de apagado.<br /><br />Ahora bien. Aquellos que sepan como conectar con la computadora en la otra habitaci&oacute;n a trav&eacute;s de la l&iacute;nea de comandos podr&aacute;n simplemente ingresar el&nbsp; comando "halt" y obtener el mismo resultado.<br /><br />Esto puede parecer trivial. Quiz&aacute;s sea que a&uacute;n resulte mejor para t&iacute; levantarte de tuy c&oacute;mada silla y gastar cinco calorias caminando hasta el cuarto contiguo<br /><br /></p>
   
  </div>
 </div>


  </div>
</div>
<!-- End of content -->



<!-- sputnik error page -->
<div id="dialog-sputnik-qrac" style="display: none"></div>
<div id="dialog-sputnik-error" title="Can't communicate with booktype">
  <p>
    <span class="ui-icon ui-icon-circle-check" style="float:left; margin:0 7px 50px 0;"></span>
    There has been error in communication with Booktype server.
    Not sure right now where is the problem.
  </p>
  <p>
    You should refresh this page.
  </p>
</div>


<ul class="strings template">
 <li class="ok">OK</li>
 <li class="back">Back</li>
 <li class="create">Create</li>
 <li class="cancel">Cancel</li>
 <li class="next">Next</li>
 <li class="import">Import</li>
 <li class="savechanges">Save changes</li>
 <li class="errorcreategroup">Couldn't create a group!</li>
 <li class="msgepub">enter epub URL</li>
 <li class="msgarchive">enter Archive.org ID</li>
 <li class="msgwiki">enter Wikibooks URL</li>
 <li class="msgbooktype">enter Booktype URL</li>
 <li class="deletebook">Delete book</li>
</ul>

</body>
</html>

