
<!DOCTYPE HTML>
<html>
 <head>
   

<link type="text/css" href="/site_static/css/booki.css" rel="Stylesheet" >
<link type="text/css" href="/site_static/js/jquery/themes/base/jquery.ui.all.css" rel="Stylesheet" >
<link type="text/css" href="/site_static/js/jquery/themes/smoothness/jquery.ui.all.css" rel="Stylesheet" >
<script type="text/javascript" src="/site_static/js/jquery/jquery-1.4.4.js"></script>
<script type="text/javascript" src="/site_static/js/jquery/ui/jquery-ui-1.8.10.custom.js"></script>
<script type="text/javascript" src="/site_static/js/jquery.json-1.3.js"></script>
<script type="text/javascript" src="/site_static/js/booki.js"></script>
<script src="/site_static/js/messaging.js" type="text/javascript"></script>   
<script type="text/javascript" src="/site_static/js/general.js"></script>
<link href="/site_static/css/jquery.bubblepopup.v2.3.1.css" rel="stylesheet" type="text/css" />
<link type="text/css" href="/site_static/css/jquery-ui_overrides.css" rel="Stylesheet" >
<script src="/site_static/js/jquery.bubblepopup.v2.3.1.min.js" type="text/javascript"></script>

<link rel="SHORTCUT ICON" href="http://write.flossmanuals.net/site_static/images/favicon.ico" type="image/x-icon">
<meta property="og:site_name" content="FLOSS Manuals"/><meta name="description" content="Free Manuals for Freedom"/>

<script type="text/javascript">
  $(function() {
      $.booki.sputnikDispatcherURL = "/_sputnik/";

      $("#dialog-sputnik-error").dialog({
          modal: true,
          autoOpen: false,
          buttons: {
            Ok: function() {
               $(this).dialog('close');
               window.location = '.';
            }
          }
      });
  
      $("FORM.messagefield").messagefield('init', {'view_post': '/messaging/post' });  
  });
</script>


   
<title>/chapter: Johdanto / Ubuntu tutuksi</title>
<link type="text/css" href="/site_static/css/published.css" rel="Stylesheet" />

<link rel="alternate" type="application/rss+xml" title="RSS feed for Ubuntu tutuksi" href="/feeds/rss/book/ubuntu-tutuksi/" /> 
<link rel="alternate" type="application/atom+xml" title="Atom feed for Ubuntu tutuksi" href="/feeds/atom/book/ubuntu-tutuksi/" /> 

<link rel="alternate" type="application/rss+xml" title="RSS feed for chapter Johdanto" href="/feeds/rss/chapter/ubuntu-tutuksi/ubuntu-tutuksi/" /> 
<link rel="alternate" type="application/atom+xml" title="Atom feed for chapter Johdanto" href="/feeds/atom/chapter/ubuntu-tutuksi/ubuntu-tutuksi/" /> 


<style>
SPAN.bookicommentmarker {
  background-color: white;
}

SPAN.bookicommentmarker > IMG.markerimage { 
   display: none;
}


</style>



   <link type="text/css" href="/static/css/_user.css" rel="Stylesheet" >
 </head>
<body>

<div class="topbar"> 
  <div class="logotext"><a href="http://write.flossmanuals.net/">FLOSS Manuals</a> </div>

  <div class="meta-bar">
    
    <ul>
      <li>
        <a href="/accounts/signin/?redirect=/ubuntu-tutuksi/johdanto/">Sign In / Create Account</a>
      </li>
    </ul>
    
    <div style="padding-top: 10px; padding-right: 15px;">
      <br/>
      

<script>
  $(function() {
    var $frm = $("FORM[name=changelang]");
	
    $("A[href=#]", $frm).click(function() {
        var lang = $(this).attr("class").substr(4);
	
        $("INPUT[name=language]", $frm).val(lang);
        $frm.submit();
	
        return false;
    });
  });
 </script>

<form name="changelang" method="POST" action="/accounts/i18n/setlang/?language=en-us">
  <input type="hidden" name="language" value="en-us">
  
    &nbsp;English&nbsp;|
  
  
  
    &nbsp;<a class="langes" href="#">Español</a>&nbsp;|
  

  
    &nbsp;<a class="langfr" href="#">Français</a>&nbsp;|
  
	
  
    &nbsp;<a class="langit" href="#">Italiano</a>&nbsp;|
  
	
  
    &nbsp;<a class="langpt" href="#">Português</a>&nbsp;|
  
	
  
    &nbsp;<a class="langru" href="#">Русский</a>&nbsp;|
  
	
  
    &nbsp;<a class="langsq" href="#">Shqip</a>
  	
</form>

    </div>
    
    
  </div><!-- End of .meta-bar -->
</div><!-- End top bar -->

<div class="menubar shadow">
  
  
  <div class="navbox">
    <ul>
      <li><a href="/list-books/">Books</a></li>
      <li><a href="/list-groups/">Groups</a></li>
      <li><a href="/list-people/">People</a></li>
    </ul>      
  </div><!-- End of .navbox -->       
</div>

<div class="content-container">
  <div class="content shadow">
    <!-- Content box and the drop shadow-->
    
   <h2>Ubuntu tutuksi</h2>

<div class="padded">
<div id="bookmenu">
<ul>

 
   <li><a href="/ubuntu-tutuksi/johdanto/">Johdanto</a></li>
 

 
   <li><a href="/ubuntu-tutuksi/mika-on-linux/">Mikä on Linux?</a></li>
 

 
   <li><a href="/ubuntu-tutuksi/miten-ubuntu-eroaa-windowsista/">Miten Ubuntu eroaa Windowsista?</a></li>
 

 
   <li><a href="/ubuntu-tutuksi/kokeileminen-ja-asentaminen/">Kokeileminen ja asentaminen</a></li>
 

 
   <li><a href="/ubuntu-tutuksi/ubuntun-asentaminen/">Ubuntun asentaminen</a></li>
 

 
   <li><a href="/ubuntu-tutuksi/kaytto/">Käyttö</a></li>
 

 
   <li><a href="/ubuntu-tutuksi/ubuntun-peruskaytto/">Ubuntun peruskäyttö</a></li>
 

 
   <li><a href="/ubuntu-tutuksi/internet-selailu/">Internet-selailu</a></li>
 

 
   <li><a href="/ubuntu-tutuksi/toimisto-ohjelmisto/">Toimisto-ohjelmisto</a></li>
 

 
   <li><a href="/ubuntu-tutuksi/yllapito/">Ylläpito</a></li>
 

 
   <li><a href="/ubuntu-tutuksi/ubuntun-perusyllapito/">Ubuntun perusylläpito</a></li>
 

 
   <li><a href="/ubuntu-tutuksi/komentorivi/">Komentorivi</a></li>
 

 
   <li><a href="/ubuntu-tutuksi/liitteet/">Liitteet</a></li>
 

 
   <li><a href="/ubuntu-tutuksi/lisenssi/">Lisenssi</a></li>
 

</ul>
</div>
<div id="bookcontent">
   
<html lang="en"><head><title>Mik&#228; on Linux?</title></head><body><h1>Mik&#228; on Linux?</h1>
<p><img src="http://fi.flossmanuals.net/kirjoita/ubuntu-tutuksi/_draft/_v/1.0/static/static/torvalds.jpg" alt="Linus Torvalds" width="391" height="600"></p>
<p><em>Linuxin luonut Linus Torvalds</em></p>
<p>T&#228;m&#228;n oppaan yhten&#228; tarkoituksena on murtaa myytti&#228; siit&#228;, ett&#228; Linuxin k&#228;ytt&#228;minen olisi vaikeaa ja se olisi vain asiantuntijoille sopiva k&#228;ytt&#246;j&#228;rjestelm&#228;. P&#228;invastoin &#8211; Linuxin k&#228;ytt&#228;minen ei ole sen vaikeampaa kuin kilpailevien k&#228;ytt&#246;j&#228;rjestelmien. Lis&#228;ksi Linux on erinomaisesti toimiva k&#228;ytt&#246;j&#228;rjestelm&#228;: k&#228;ytt&#228;j&#228;n ei tarvitse huolehtia viruksista tai muista tietoturvauhkista samalla tavoin kuin esimerkiksi Microsoft Windows -k&#228;ytt&#228;jien. Linuxin lis&#228;ksi internetist&#228; voi ladata huikean m&#228;&#228;r&#228;n muitakin vapaita ohjelmia ilmaiseksi.</p>
<h2>Viisi hyv&#228;&#228; syyt&#228; siirty&#228; Linuxin k&#228;ytt&#228;j&#228;ksi</h2>
<p>&#160;</p>
<h3>Tietoturva</h3>
<p>&#160;</p>
<p>Linuxille ei ole olemassa yht&#228;&#228;n aktiivisesti levi&#228;v&#228;&#228; virusta. Toki Linuxillekin voidaan kirjoittaa viruksia ja haittaohjelmia, mutta k&#228;ytt&#246;j&#228;rjestelm&#228; on rakenteeltaan sellainen, ett&#228; virusten on vaikeampi levit&#228; kuin Windows-j&#228;rjestelmiss&#228;. Linuxin avoin kehitt&#228;mismalli takaa my&#246;s sen, ett&#228; tietoturva-aukot korjataan nopeasti ja korjaukset jaetaan k&#228;ytt&#228;jille yleens&#228; ennen kuin k&#228;ytt&#228;j&#228;t ehtiv&#228;t k&#228;rsi&#228; ongelmista. Toisaalta esimerkiksi heikko salasana tai j&#228;rjestelm&#228;n p&#228;ivitt&#228;m&#228;tt&#228; j&#228;tt&#228;minen ovat selkeit&#228; uhkia miss&#228; tahansa j&#228;rjestelm&#228;ss&#228;.</p>
<h3>Edullisuus</h3>
<p>Avoimeen l&#228;hdekoodiin perustuvat ohjelmat ovat kenen tahansa vapaasti k&#228;ytett&#228;viss&#228;, muokattavissa ja levitett&#228;viss&#228;. Siksi Linux-jakelut ja -ohjelmistot ovat vapaasti ladattavissa internetist&#228;. Linux-jakeluita myyd&#228;&#228;n my&#246;s perinteisten ohjelmistojen tapaan, mutta yleens&#228; ne ovat huomattavasti edullisempia kilpaileviin suljettuihin k&#228;ytt&#246;j&#228;rjestelmiin verrattuna. Usein myyt&#228;viss&#228; avoimen l&#228;hdekoodin ohjelmistoissa hinta koostuu pakkauksista, ohjekirjoista ja tukipalveluista &#8211; ei lisenssimaksuista.</p>
<h3><img src="http://fi.flossmanuals.net/kirjoita/ubuntu-tutuksi/_draft/_v/1.0/static/static/big%20tux.png" alt="Tux" width="300" height="350"></h3>
<p><em>Linuxin maskotti on Tux-pingviini</em></p>
<p>Useimpia tietokoneita vaivaa aika ajoin yksitt&#228;isten ohjelmien tai koko j&#228;rjestelm&#228;n kaatuilu. Linux-j&#228;rjestelm&#228;n ydin (eng. kernel) on vakaa ja kaatuu eritt&#228;in harvoin &#8211; jos koskaan. Linux voikin olla k&#228;ynniss&#228; yht&#228;jaksoisesti kuukausia tai jopa vuosia ilman ongelmia tai tarvetta uudelleenk&#228;ynnist&#228;miselle. T&#228;m&#228;n vuoksi Linux onkin suosittu k&#228;ytt&#246;j&#228;rjestelm&#228; palvelintietokoneissa. Joskus huonoja n&#228;yt&#246;nohjainajureita k&#228;ytett&#228;ess&#228; n&#228;ytt&#246; voi menn&#228; pime&#228;ksi, vaikka j&#228;rjestelm&#228;n ydin ei kaadu.</p>
<h3>Muokattavuus k&#228;ytt&#228;j&#228;n tarpeisiin</h3>
<p>Avoimen l&#228;hdekoodin kuuluu vapaus muokata ohjelmia omaan k&#228;ytt&#246;&#246;n paremmin soveltuviksi. Ohjelmointitaitoinen voi l&#228;hdekoodin avulla tehd&#228; mit&#228; tahansa parannuksia. Lis&#228;ksi useimpien ohjelmien asetuksia voi jokainen muokata hyvin pitk&#228;lle, joten ohjelmointitaidot eiv&#228;t ole v&#228;ltt&#228;m&#228;tt&#246;mi&#228; r&#228;&#228;t&#228;l&#246;intiin. K&#228;ytt&#228;j&#228;lle n&#228;kyv&#228;n graafisen k&#228;ytt&#246;liittym&#228;n voi esimerkiksi valita useista eri vaihtoehdoista. Linux toimii hyvin my&#246;s monenlaisissa tietokoneissa. Uusien ja tehokkaiden tietokoneiden lis&#228;ksi Linuxia voi k&#228;ytt&#228;&#228; my&#246;s vanhemmissa ja hitaammissa koneissa. N&#228;in my&#246;s vanha, nurkkaan p&#246;lyttym&#228;&#228;n j&#228;&#228;nyt tietokone on mahdollista ottaa k&#228;ytt&#246;&#246;n Linuxin avulla.</p>
<h3>Helppok&#228;ytt&#246;isyys</h3>
<p>Linuxin k&#228;ytt&#228;minen ei ole sen vaikeampaa kuin tutun Windowsin. Netiss&#228; surffaaminen tai vaikka tekstink&#228;sittely sujuu Linuxilla kenelt&#228; tahansa siin&#228; miss&#228; vaikka Microsoft Windowsilla tai Applen OS X:ll&#228;. Erityisesti ohjelmapakettienhallinta tekee j&#228;rjestelm&#228;n yll&#228;pidosta vaivatonta. Vaikka tietyt asiat eiv&#228;t toimi samalla tavoin kuin mihin on saattanut tottua Windowsissa tai OS X:ss&#228;, se ei kuitenkaan tee Linuxista vaikeak&#228;ytt&#246;ist&#228; &#8211; kenties jopa p&#228;invastoin.</p>
<p>T&#228;m&#228;n oppaan tarkoitus on perehdytt&#228;&#228; lukija tuntemaan keskeiset asiat, jotka uuden Linux-k&#228;ytt&#228;j&#228;n on syyt&#228; tiet&#228;&#228;. Kun jaksaa paneutua Linuxin perusasioihin muutaman illan tai yhden viikonlopun, niin huomaa, ettei sen k&#228;ytt&#228;minen todellakaan ole lainkaan niin vaikeaa kuin usein annetaan ymm&#228;rt&#228;&#228;.</p>
<h2>Linux perustuu avoimeen l&#228;hdekoodiin</h2>
<p>Avoimen l&#228;hdekoodin (eng. open source) ohjelmilla tarkoitetaan ohjelmistoja, joita saa</p>
<ol><li>&#160;&#160;&#160; k&#228;ytt&#228;&#228; vapaasti</li>
<li>&#160;&#160;&#160; levitt&#228;&#228; vapaasti</li>
<li>&#160;&#160;&#160; muokata vapaasti.</li>
</ol><p>&#160;</p>
<p>Perinteisi&#228;, suljettuja ohjelmistoja saa k&#228;ytt&#228;&#228; vain valmistajan asettamien ehtojen mukaan ja niiden eteenp&#228;in levitt&#228;minen on kielletty. Lis&#228;ksi ohjelmien muokkaaminen paremmin k&#228;ytt&#228;j&#228;n tarpeita vastaavaksi on mahdotonta, sill&#228; ohjelmien pohjana oleva l&#228;hdekoodi ei ole vapaasti saatavilla.</p>
<p>Avoin l&#228;hdekoodi poikkeaa merkitt&#228;v&#228;sti suljetusta: Avoimet ohjelmistot ovat k&#228;ytt&#228;jiens&#228; kehitt&#228;mi&#228; eiv&#228;tk&#228; kenenk&#228;&#228;n tiukassa hallinnassa. Samaa ohjelmaa kehitt&#228;&#228; suuri joukko yritysten palkkaamia ja yksityisi&#228; ohjelmoijia, joten kehitys ei pys&#228;hdy yksitt&#228;isen yrityksen konkurssiin. Mainokset ja kytkykauppa poistetaan v&#228;litt&#246;m&#228;sti, koska k&#228;ytt&#228;j&#228;organisaatio tai -ohjelmoija voi muokata ohjelmasta halutunlaisen ja levitt&#228;&#228; paranneltua versiota eteenp&#228;in.</p>
<p>Vapaalla ohjelmalla tarkoitetaan oikeutta k&#228;ytt&#228;&#228; ja levitt&#228;&#228; ohjelmaa vapaasti. <br>Avoimet ohjelmistot ovat saaneet viime vuosien aikana paljon suosiota. Tunnetuimpia ovat toimisto-ohjelmisto OpenOffice.org, internetselain Mozilla Firefox sek&#228; GNU/Linux-k&#228;ytt&#246;j&#228;rjestelm&#228;. Miljoonien kotik&#228;ytt&#228;jien lis&#228;ksi my&#246;s useat suuret organisaatiot ovat vaihtaneet suljettuja ohjelmistoja avoimiin, n&#228;iden joukossa lukuisia julkishallinnon organisaatiota ymp&#228;ri maailmaa.</p>
<p>Avoimeen l&#228;hdekoodiin perustuvat ohjelmistot ovatkin onnistuneet aidosti haastamaan jopa maailman suurimman ohjelmistovalmistajan, Microsoftin. Useimmat suuret tietotekniikka-alan toimijat, kuten IBM, Novell, Sun, HP sek&#228; Nokia, ovat l&#228;hteneet kehitt&#228;m&#228;&#228;n avoimia ohjelmistoja ja tarjoavat n&#228;ihin perustuvia palveluja. Harvoin, jos koskaan, kilpailevat yhti&#246;t ovat puhaltaneet yhteen hiileen vastaavassa mittakaavassa.</p>
<h2>Jakeluversiot ja ty&#246;p&#246;yt&#228;ymp&#228;rist&#246;t</h2>
<p>Linuxista on useita eri jakeluversiota (levitysversio, distribuutio, distro). Ei siis ole olemassa yht&#228; Linuxia, kuten on olemassa Windows tai Mac OS. Useat eri toimijat ovat koonneet oman jakeluversionsa Linux-ytimen ymp&#228;rille. Jakeluversiot sis&#228;lt&#228;v&#228;t paljon samoja ohjelmia ja n&#228;in muistuttavat pitk&#228;lti toisiaan. Jotain yleisint&#228; jakelua k&#228;ytt&#228;m&#228;&#228;n oppinut osaa siis mit&#228; todenn&#228;k&#246;isimmin k&#228;ytt&#228;&#228; my&#246;s muitakin jakeluja. Linuxin k&#228;ytt&#246;&#228; aloittelevan kannattaa valita jokin tunnetuista jakeluista, jossa on kiinnitetty erityist&#228; huomiota k&#228;yt&#246;n helppouteen. Tunnettuja jakeluja kehitt&#228;&#228; yleens&#228; suuri joukko ihmisi&#228;, joten ne ovat hyvin ajan tasalla. <br>Ubuntun lis&#228;ksi muita laajassa k&#228;yt&#246;ss&#228; olevia jakeluja ovat mm. Debian, Fedora, Suse, Mandriva, Mepis ja PCLinuxOS.</p>
<p><img src="http://fi.flossmanuals.net/kirjoita/ubuntu-tutuksi/_draft/_v/1.0/static/static/ubuntu-logo.png" alt="Ubuntu" width="422" height="110"></p>
<p>Ubuntu on yksi suosituimmista ellei jopa suosituin Linux-jakelu. Projektin on aloittanut etel&#228;-afrikkalainen miljon&#228;&#228;ri Mark Shuttleworth. Varmistaakseen Ubuntun kehitt&#228;misty&#246;n tulevaisuudessakin Shuttleworth on perustanut Ubuntu-s&#228;&#228;ti&#246;n ja lahjoittanut sille 10 miljoonaa dollaria. <br><br>Vanha afrikkalainen sana Ubuntu kuvaa yhteis&#246;llisyytt&#228;, ja se voidaan suomentaa "ihmiselt&#228; ihmiselle". Ubuntun perusperiaatteita ovat:</p>
<p>&#160;</p>
<ul><li>&#160;&#160;&#160; ilmaisuus</li>
<li>&#160;&#160;&#160; sitoutuminen avoimen l&#228;hdekoodiin ohjelmistoihin ja kehitt&#228;mistapaan</li>
<li>&#160;&#160;&#160; helppok&#228;ytt&#246;isyys</li>
<li>&#160;&#160;&#160; monikielisyys</li>
</ul><p><br>Ubuntu perusversio k&#228;ytt&#228;&#228; Gnome-ty&#246;ymp&#228;rist&#246;&#228;. KDE-ty&#246;ymp&#228;rist&#246;&#228; suosivia ei kuitenkaan ole unohdettu, sill&#228; Ubuntusta on olemassa my&#246;s Kubuntu-niminen rinnakkaisversio. Ubuntu ja Kubuntu perustuvat samaan perusjakeluun ja poikkeavat toisistaan vain graafiselta k&#228;ytt&#246;liittym&#228;lt&#228;&#228;n. My&#246;s kevyen XFCE-ty&#246;p&#246;yt&#228;ymp&#228;rist&#246;n k&#228;ytt&#228;minen on mahdollista. XFCE:t&#228; k&#228;ytt&#228;v&#228;&#228; versiota Ubuntusta kutsutaan Xubuntuksi. Erityisesti kouluk&#228;ytt&#246;&#246;n muokattu Ubuntun versio kulkee nimell&#228; Edubuntu. Gobuntu sis&#228;lt&#228;&#228; ainoastaan ohjelmia, joiden koko l&#228;hdekoodi on saatavilla ja lisenssiehdot sallivat ohjelman k&#228;yt&#246;n, tutkimisen, muokkaamisen ja levitt&#228;misen. Se ei sis&#228;ll&#228; lainkaan suljetun l&#228;hdekoodin ajureita ja koska avoimia ajureita ei viel&#228; ole kaikille laitekomponenteille, on laitetuki k&#228;yt&#228;nn&#246;ss&#228; puutteellinen.</p>
<p>Ubuntu on yksi helppok&#228;ytt&#246;isimmist&#228; ty&#246;p&#246;yt&#228;k&#228;ytt&#246;&#246;n tarkoitetuista Linuxeista, jotka ovat tunnettuja paitsi luotettavuudestaan, turvallisuudesta ja tehokkuudestaan my&#246;s siit&#228;, ett&#228; ne ovat ilmaisia.</p>
<p>Ilmaisuus perustuu siihen, ett&#228; Linux on vapaan ja avoimen l&#228;hdekoodin ohjelmisto (VALO). Kyseisi&#228; ohjelmistoja jokaisella on oikeus k&#228;ytt&#228;&#228;, muokata ja levitt&#228;&#228; vapaasti.</p>
<p>VALO tarkoittaa k&#228;yt&#228;nn&#246;ss&#228; sit&#228;, ett&#228; k&#228;ytt&#228;jien ei tarvitse olla t&#228;ysin riippuvaisia&#160; ohjelmiston toimittaneen yrityksen mielivaltaisista hinnoittelu- tai ohjelmistokehitysp&#228;&#228;t&#246;ksist&#228;. VALO mahdollistaa sen, ett&#228; ohjelmistoyritysten v&#228;linen kilpailu ei perustu markkina-asemaan vaan todelliseen osaamiseen ja laatuun. Lis&#228;ksi k&#228;ytt&#228;j&#228;llekin j&#228;&#228; aina mahdollisuus itse muokata ohjelmistojaan, mik&#228;li markkinat eiv&#228;t tuota tyydytt&#228;vi&#228; ratkaisuja.</p>
<p>Tietotekniikan on sopeuduttava ihmisten tarpeisiin, eik&#228; niin, ett&#228; ihmiset sopeuttavat tarpeensa muutaman harvan ohjelmistoyrityksen ratkaisuun.</p>
<p>T&#228;m&#228; suomenkielinen opas alentaa huomattavasti kynnyst&#228; tutustua Ubuntuun. Monet Ubuntun ohjelmista ovat my&#246;s suomennettu ja niiden k&#228;ytt&#246; on muutenkin helppoa. Astu uuteen, vapaan ja k&#228;ytt&#228;j&#228;l&#228;ht&#246;isen teknologian aikakauteen ja hanki nyt Ubuntu Linux!</p>
<p>&#160;</p>
<h2>Lis&#228;tietoja netiss&#228;</h2>
<p><br>Lis&#228;&#228; hyvi&#228; ohjeita Ubuntun k&#228;ytt&#246;&#246;n ja yll&#228;pitoon l&#246;ytyy suomeksi sivustoilta <a href="http://fi.wikibooks.org/wiki/Ubuntu_tutuksi">http://fi.wikibooks.org/wiki/Ubuntu_tutuksi</a>, <a href="http://www.ubuntu-fi.org%20%20">http://www.ubuntu-fi.org</a><a href="http://www.ubuntu-fi.org%20%20">&#160;</a>ja Linux.fi wikist&#228; osoitteesta <a href="http://www.linux.fi">http://www.linux.fi</a>.</p></body></html>
   

</div>
</div>

  </div>
</div>
<!-- End of content -->



<!-- sputnik error page -->
<div id="dialog-sputnik-qrac" style="display: none"></div>
<div id="dialog-sputnik-error" title="Can't communicate with booktype">
  <p>
    <span class="ui-icon ui-icon-circle-check" style="float:left; margin:0 7px 50px 0;"></span>
    There has been error in communication with Booktype server.
    Not sure right now where is the problem.
  </p>
  <p>
    You should refresh this page.
  </p>
</div>


<ul class="strings template">
 <li class="ok">OK</li>
 <li class="back">Back</li>
 <li class="create">Create</li>
 <li class="cancel">Cancel</li>
 <li class="next">Next</li>
 <li class="import">Import</li>
 <li class="savechanges">Save changes</li>
 <li class="errorcreategroup">Couldn't create a group!</li>
 <li class="msgepub">enter epub URL</li>
 <li class="msgarchive">enter Archive.org ID</li>
 <li class="msgwiki">enter Wikibooks URL</li>
 <li class="msgbooktype">enter Booktype URL</li>
 <li class="deletebook">Delete book</li>
</ul>

</body>
</html>

