
<!DOCTYPE HTML>
<html>
 <head>
   

<link type="text/css" href="/site_static/css/booki.css" rel="Stylesheet" >
<link type="text/css" href="/site_static/js/jquery/themes/base/jquery.ui.all.css" rel="Stylesheet" >
<link type="text/css" href="/site_static/js/jquery/themes/smoothness/jquery.ui.all.css" rel="Stylesheet" >
<script type="text/javascript" src="/site_static/js/jquery/jquery-1.4.4.js"></script>
<script type="text/javascript" src="/site_static/js/jquery/ui/jquery-ui-1.8.10.custom.js"></script>
<script type="text/javascript" src="/site_static/js/jquery.json-1.3.js"></script>
<script type="text/javascript" src="/site_static/js/booki.js"></script>
<script src="/site_static/js/messaging.js" type="text/javascript"></script>   
<script type="text/javascript" src="/site_static/js/general.js"></script>
<link href="/site_static/css/jquery.bubblepopup.v2.3.1.css" rel="stylesheet" type="text/css" />
<link type="text/css" href="/site_static/css/jquery-ui_overrides.css" rel="Stylesheet" >
<script src="/site_static/js/jquery.bubblepopup.v2.3.1.min.js" type="text/javascript"></script>

<link rel="SHORTCUT ICON" href="http://write.flossmanuals.net/site_static/images/favicon.ico" type="image/x-icon">
<meta property="og:site_name" content="FLOSS Manuals"/><meta name="description" content="Free Manuals for Freedom"/>

<script type="text/javascript">
  $(function() {
      $.booki.sputnikDispatcherURL = "/_sputnik/";

      $("#dialog-sputnik-error").dialog({
          modal: true,
          autoOpen: false,
          buttons: {
            Ok: function() {
               $(this).dialog('close');
               window.location = '.';
            }
          }
      });
  
      $("FORM.messagefield").messagefield('init', {'view_post': '/messaging/post' });  
  });
</script>


   
 <title>/chapter: Kuvaukset / Avoin mediatuotanto</title>
 <link type="text/css" href="/site_static/css/draft.css" rel="Stylesheet" />

 <link rel="alternate" type="application/rss+xml" title="RSS feed for Avoin mediatuotanto" href="/feeds/rss/book/avoin-mediatuotanto/" /> 
 <link rel="alternate" type="application/atom+xml" title="Atom feed for Avoin mediatuotanto" href="/feeds/atom/book/avoin-mediatuotanto/" /> 

 <link rel="alternate" type="application/rss+xml" title="RSS feed for chapter KUVAUKSET" href="/feeds/rss/chapter/avoin-mediatuotanto/avoin-mediatuotanto/" /> 
 <link rel="alternate" type="application/atom+xml" title="Atom feed for chapter KUVAUKSET" href="/feeds/atom/chapter/avoin-mediatuotanto/avoin-mediatuotanto/" /> 
 
 <script type="text/javascript" src="/site_static/js/draft.js"></script>


   <link type="text/css" href="/static/css/_user.css" rel="Stylesheet" >
 </head>
<body>

<div class="topbar"> 
  <div class="logotext"><a href="http://write.flossmanuals.net/">FLOSS Manuals</a> </div>

  <div class="meta-bar">
    
    <ul>
      <li>
        <a href="/accounts/signin/?redirect=/avoin-mediatuotanto/_draft/_v/1.0/kuvaukset/">Sign In / Create Account</a>
      </li>
    </ul>
    
    <div style="padding-top: 10px; padding-right: 15px;">
      <br/>
      

<script>
  $(function() {
    var $frm = $("FORM[name=changelang]");
	
    $("A[href=#]", $frm).click(function() {
        var lang = $(this).attr("class").substr(4);
	
        $("INPUT[name=language]", $frm).val(lang);
        $frm.submit();
	
        return false;
    });
  });
 </script>

<form name="changelang" method="POST" action="/accounts/i18n/setlang/?language=en-us">
  <input type="hidden" name="language" value="en-us">
  
    &nbsp;English&nbsp;|
  
  
  
    &nbsp;<a class="langes" href="#">Español</a>&nbsp;|
  

  
    &nbsp;<a class="langfr" href="#">Français</a>&nbsp;|
  
	
  
    &nbsp;<a class="langit" href="#">Italiano</a>&nbsp;|
  
	
  
    &nbsp;<a class="langpt" href="#">Português</a>&nbsp;|
  
	
  
    &nbsp;<a class="langru" href="#">Русский</a>&nbsp;|
  
	
  
    &nbsp;<a class="langsq" href="#">Shqip</a>
  	
</form>

    </div>
    
    
  </div><!-- End of .meta-bar -->
</div><!-- End top bar -->

<div class="menubar shadow">
  
  
  <div class="navbox">
    <ul>
      <li><a href="/list-books/">Books</a></li>
      <li><a href="/list-groups/">Groups</a></li>
      <li><a href="/list-people/">People</a></li>
    </ul>      
  </div><!-- End of .navbox -->       
</div>

<div class="content-container">
  <div class="content shadow">
    <!-- Content box and the drop shadow-->
    

<h2>Avoin mediatuotanto</h2>
<div class="padded">
 <div id="bookmenu" style="background: url(/site_static/images/draft_bg.png) repeat !important;"> 
  <ul>
   
    
      <li><b>Johdanto</b></li>
    
   
    
      <li><a href="/avoin-mediatuotanto/_draft/_v/1.0/aluksi/">ALUKSI</a></li>
    
   
    
      <li><b>Yhteisömedian maisema</b></li>
    
   
    
      <li><a href="/avoin-mediatuotanto/_draft/_v/1.0/verkko-ja-yhteisomedia/">VERKKO- JA YHTEISÖMEDIA</a></li>
    
   
    
      <li><a href="/avoin-mediatuotanto/_draft/_v/1.0/kevyt-tuotantotapa/">KEVYT TUOTANTOTAPA</a></li>
    
   
    
      <li><a href="/avoin-mediatuotanto/_draft/_v/1.0/avoimen-lahdekoodin-ohjelmistot/">AVOIMEN LÄHDEKOODIN OHJELMISTOT</a></li>
    
   
    
      <li><a href="/avoin-mediatuotanto/_draft/_v/1.0/avoimet-lisenssit-ja-vapaat-sisallot/">AVOIMET LISENSSIT JA VAPAAT SISÄLLÖT</a></li>
    
   
    
      <li><a href="/avoin-mediatuotanto/_draft/_v/1.0/julkaisupalvelut/">JULKAISUPALVELUT</a></li>
    
   
    
      <li><b>Tuotanto</b></li>
    
   
    
      <li><a href="/avoin-mediatuotanto/_draft/_v/1.0/tuotantokalusto/">TUOTANTOKALUSTO</a></li>
    
   
    
      <li><a href="/avoin-mediatuotanto/_draft/_v/1.0/ohjelman-suunnittelu/">OHJELMAN SUUNNITTELU</a></li>
    
   
    
      <li><a href="/avoin-mediatuotanto/_draft/_v/1.0/kuvaukset/">KUVAUKSET</a></li>
    
   
    
      <li><a href="/avoin-mediatuotanto/_draft/_v/1.0/leikkaus/">LEIKKAUS</a></li>
    
   
    
      <li><b>Julkaisu</b></li>
    
   
    
      <li><a href="/avoin-mediatuotanto/_draft/_v/1.0/julkaiseminen-verkossa/">JULKAISEMINEN VERKOSSA</a></li>
    
   
    
      <li><a href="/avoin-mediatuotanto/_draft/_v/1.0/jakelu-ja-jakaminen/">JAKELU JA JAKAMINEN</a></li>
    
   
    
      <li><b>Liitteet</b></li>
    
   
    
      <li><a href="/avoin-mediatuotanto/_draft/_v/1.0/oppaasta/">OPPAASTA</a></li>
    
   
    
      <li><a href="/avoin-mediatuotanto/_draft/_v/1.0/lisenssi/">LISENSSI</a></li>
    
   
  </ul>
 </div>
 <div id="bookcontent"   style="background: url(/site_static/images/draft_bg.png) repeat !important;">
   

  <h1><span style="font-size: 2em;">KUVAUKSET</span></h1>
<p>Kuvauksissa p&auml;tee muutama hy&ouml;dyllinen s&auml;&auml;nt&ouml;. Ensinn&auml;kin kannattaa varata kuvauksiin riitt&auml;v&auml;sti aikaa ja suunnitella kuvausj&auml;rjestys etuk&auml;teen. Toiseksi haastattelut on hyv&auml; kuvata ensimm&auml;isen&auml;, sill&auml; niiden pohjalta on helpompi kuvata kuvitusta, tehd&auml; juonnot ja voice over speakit. Kolmantena kannattaa muistaa, ett&auml; kuvituskuviin ja havaintokuviin kannattaa panostaa, koska hyvi&auml; kuvia ei koskaan ole liikaa.</p>
<h2>KUVAUSLUVAT</h2>
<p>Sananvapauden perusteella Suomessa saa kuvata julkisissa paikoissa ja yleis&ouml;lle avoimissa tiloissa ilman erillist&auml; lupaa. Esimerkiksi kaupoissa, kauppakeskuksissa ja asemilla (paitsi lentoasemalla) saa kuvata, mutta k&auml;yt&auml;nn&ouml;ss&auml; ainakin kaupoissa kannattaa sopia kuvauksista etuk&auml;teen ep&auml;selvyyksien v&auml;ltt&auml;miseksi. Mit&auml;&auml;n perusteita kuvausluvan ev&auml;&auml;miseksi ei n&auml;iss&auml; paikoissa ole. Sit&auml; vastoin kodeissa ja asuinrakennuksissa, rappuk&auml;yt&auml;viss&auml;, talojen pihoissa, virastoissa ja muissa yksityisiss&auml; ja yleis&ouml;lt&auml; suljetuissa tiloissa pit&auml;&auml; lupa aina kysy&auml; etuk&auml;teen. Alle 16-vuotiaita saa kuvata vain vanhempien luvalla.</p>
<p>Kun teet haastattelua tai katugallupia kysy aina lupa haastatteluun, kerro mihin ja miten sit&auml; k&auml;ytet&auml;&auml;n sek&auml; milloin ja mill&auml; kanavalla/verkkosivulla ohjelma esitet&auml;&auml;n. Muista, ett&auml; kuvauslupa ei tarkoita julkaisulupaa eli tarvitset suostumuksen molempiin.</p>
<p>Jos k&auml;yt&auml;t esim yleiskuvaa kadulta kuvituksena, mieti ovatko ihmiset tunnistettavia ja mit&auml; aihetta ohjelma, johon kuvaa k&auml;ytet&auml;&auml;n k&auml;sittelee. Tekij&auml;n tulee v&auml;ltt&auml;&auml; v&auml;&auml;rien assosiaatioiden luomista kadulla kulkeviin satunnaisiin ihmisiin.</p>
<h2>ENNEN KUVAUKSIA</h2>
<p>Muista ladata akku, tyhjent&auml;&auml; muistikortti tai varata tarpeeksi nauhaa, jos kuvaat nauhakameralla. Kameran lis&auml;ksi tarvitset useimmissa tapauksissa jalustan, mikrofonin ja piuhan sek&auml; kuulokkeet. Testaa laitteet AINA ennen kuvausta ja varmista, ett&auml; osaat s&auml;&auml;t&auml;&auml; kameran oikein kuvaustilanteessa. Lue kameran k&auml;ytt&ouml;ohjeita, se kannattaa!</p>
<h2>KUVAUSPAIKALLA</h2>
<p class=" ">Tarkista onko paikassa tarpeeksi valoa ja mist&auml; valo tulee. Suoraan vastavaloon on vaikea kuvata. Sis&auml;tiloissa lis&auml;valo on yleens&auml; aina hyv&auml;ksi. Esimerkiksi katossa olevat loisteputket eiv&auml;t yleens&auml; ole riitt&auml;vi&auml; valonl&auml;hteit&auml;.</p>
<p>Mieti, millaisia erilaisia kuvia paikassa saa ja mit&auml; esimerkiksi haastateltavan taustalla n&auml;kyy. Kuuntele my&ouml;s millainen &auml;&auml;nimaisema paikassa on. Jos teet haastattelun, tarkista ettei tilassa ole kovaa huminaa (esim j&auml;&auml;kaappi), meteli&auml; (liikenne) tai taustamusiikkia, sill&auml; puhe hukkuu helposti.</p>
<h2>KUVAUKSESTA JA &Auml;&Auml;NITYKSEST&Auml;</h2>
<p>Kuvatessa j&auml;t&auml; ylim&auml;&auml;r&auml;ist&auml; h&auml;nt&auml;&auml; alkuun ja loppuun, eli paina rec-nappia ajoissa (esim reilusti ennen kuin haastateltava aloittaa) ja j&auml;t&auml; otoksen loppuun hieman l&ouml;ys&auml;&auml;. T&auml;m&auml; helpottaa leikkaamista. Haastattelutilanteessa kuvaaja sanoo, koska kamera k&auml;y ja antaa luvan haastattelijalle aloittaa.</p>
<p>Voit zoomata kameralla tai liikuttaa sit&auml; k&auml;velem&auml;ll&auml; itse l&auml;hemm&auml;ksi tai kauemmaksi kuvauskohteesta. Voit panoroida eli liikuttaa kameraa sivusuunnassa sek&auml; tiltata, eli liikuttaa kameraa alas-yl&ouml;s-suunnassa. &Auml;l&auml; kuitenkaan zoomaa voimakkaasti/nopeasti tai liikuta kameraa &auml;kkin&auml;isesti ainakaan silloni kun kuvassa oleva henkil&ouml; puhuu tai tekee jotain t&auml;rke&auml;&auml;. Kameran liikkeit&auml; kannattaa harjoitella etuk&auml;teen. Jalusta auttaa saamaan kameran liikkeist&auml; tasaisempia, mutta ei ole mis&auml;&auml;n nimess&auml; v&auml;ltt&auml;m&auml;t&ouml;n.</p>
<p>Pid&auml; mikrofonia l&auml;hell&auml; puhujan suuta. &Auml;&auml;nen tasojen (n&auml;kyv&auml;t usein kameran n&auml;yt&ouml;ss&auml;) on oltava mahdollisimman l&auml;hell&auml; 0 db, jotta &auml;&auml;ni kuuluu hyvin. Huomaa, ett&auml; &auml;&auml;nen tasot eiv&auml;t ole sama asia kuin &auml;&auml;nen voimakkuus. Varmin tapa onnistua on laittaa kameraan automaattiasetukset, pit&auml;&auml; mikrofonia l&auml;hell&auml; puhujaa/&auml;&auml;nil&auml;hdett&auml; sek&auml; valita hiljainen &auml;&auml;nityspaikka. Kuuntele AINA kuulokkeilla, milt&auml; &auml;&auml;ni kuulostaa kun kuvaat. Jos &auml;&auml;ni s&auml;rkyy, kuulostaa metalliselta, taustalla kuuluu k&auml;nnyk&auml;n h&auml;iri&ouml;&auml;&auml;ni tms. keskeyt&auml; kuvaukset, tarkista kalusto ja sammuta kannyk&auml;t.</p>
<p><strong>HUOM!</strong> <strong>&Auml;&auml;nen tasolla</strong> tarkoitetaan sit&auml; voimakkuutta, jolla &auml;&auml;ni tallentuu kameraan tai nauhuriin. &Auml;&auml;nen tasot voivat olla kohdallaan, vaikka &auml;&auml;ni kuuluisi kuulokkeista hyvin heikosti, sill&auml; kuulokkeiden &auml;&auml;nenvoimakkuutta voi s&auml;&auml;t&auml;&auml; ilman, ett&auml; se vaikuttaa &auml;&auml;nitystasoihin. Sama p&auml;tee toisin p&auml;in.</p>
<p>Jos &auml;&auml;nen tasot ovat &auml;&auml;nitystilanteessa alhaiset, niit&auml; on vaikea muokata leikkausvaiheessa, sill&auml; kun &auml;&auml;nen tasoa joutuu nostamaan leikkausohjelmassa rajusti, syntyy &auml;&auml;neen voimakas kohina. Toisaalta, jos &auml;&auml;nitys on tehty liian korkeilla tasoilla, &auml;&auml;ni menee niin sanotusti rikki, eik&auml; sit&auml; voi leikkausohjelmassa korjata. &Auml;&auml;nen tasoja on t&auml;rke&auml; tarkkailla niin kuvatessa kuin leikatessa, sill&auml; valmista ohjelmaa tulisi voida katsella tietokoneelta tai televisioista normaaleilla volyymis&auml;&auml;d&ouml;ill&auml;.</p>
<p><em>Erilaisia kuvakokoja</em></p>
<p><img src="static/Mediatuotanto-t-resized_600x150_kuvakoot3-fi.jpg" alt="kuvakoot3.jpg" width="600" height="150" /></p>
<p><em>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; yleiskuva (YK)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; kokokuva (KK)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; puolikuva (PK) </em></p>
<p>&nbsp;<img src="static/Mediatuotanto-t-resized_600x148_kuvakoot39-fi.jpg" alt="kuvakoot39.jpg" width="600" height="148" /></p>
<p><em>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; puolil&auml;hikuva (PLK)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; l&auml;hikuva (LK)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; erikoisl&auml;hikuva (ELK) </em></p>
<h2>KUVAAMINEN JA KUVAKERRONTA</h2>
<p>Kuvakerronta koostuu kaikista erilaista kuvista, joita olet ohjelmaasi varten kuvannut. Jotta kerronta olisi mielenkiintoista ja vaihtelevaa kannattaa kuvata erilaisia kuvia. K&auml;yt&auml;nn&ouml;ss&auml; t&auml;m&auml; tarkoittaa kuvakokojen ja -kulmien vaihtelua sek&auml; erilaisten rajausten ja kompositioiden tekemist&auml;. Ylh&auml;&auml;ll&auml; n&auml;kyy esimerkkej&auml; erilaisista kuvakoista.</p>
<h3>Havaintokuvat ja milj&ouml;&ouml;kuvat</h3>
<p>Kamera on hyv&auml; v&auml;line havainnointiin. Kuvatessa kannattaa siis poimia varsinaisen kuvauskohteen (esim. haastateltava henkil&ouml;) lis&auml;ksi erilaisia havaintokuvia kuvauspaikasta. Havaintokuvilla voit n&auml;ytt&auml;&auml; ja kertoa katsojille lis&auml;&auml; ohjelman aiheesta, sek&auml; rytmitt&auml;&auml; esimerkiksi haastattelua.</p>
<p>Ota havaintokuvia eri <strong>kuvakulmista</strong> ja eri <strong>kuvakoissa</strong>. Laajat esittelykuvat, joissa kuvauspaikka, esimerkiksi tori, n&auml;kyy kokonaisuudessaan, auttavat katsojaa paikantamaan ohjelman tapahtumat ja hahmottamaan tapahtumien puitteet. Laajojen kuvien lis&auml;ksi erilaiset yksityiskohdat ovat kiinnostavia. Erilaiset kuvakulmat, esimerkiksi ala- tai yl&auml;kulma, rikastuttavat kuvakerrontaa. Hy&ouml;dynn&auml; lis&auml;ksi kuvan etu- ja taka-alaa, sill&auml; n&auml;in kuvaan tulee syvyytt&auml;. Kuvan etualalla voi esimerkiksi olla puun oksia, jotka eiv&auml;t tarkennu t&auml;ysin, ja kuvan taka-alalla n&auml;kyy varsinainen kuvauskohde tarkkana. <br /><img title="juoksuraja" src="static/resized_544x580_juoksuraja-fi.jpg" alt="juoksuraja" width="544" height="580" /></p>
<p><em>&nbsp; Muista poimia erilaisia yksityiskohtia ja laajempia yleiskuvia eri kuvakulmista kuvatessasi.</em></p>
<h3>Haastattelukuvat</h3>
<p>Ihmist&auml; kuvatessa k&auml;ytet&auml;&auml;n yleisesti edell&auml; esiteltyj&auml; kuvakokoja. Varsinkin pidemmiss&auml; haastatteluissa hy&ouml;dynn&auml; eri kuvakokoja, sill&auml; ne helpottavat leikkaamista ja el&auml;v&ouml;itt&auml;&auml; ohjelmaa. Muuta kuvakokoa kuvaustilanteessa haastattelijan kysymyksen aikana, jolloin haastateltavan puhuessa kamera ei turhaan heilu tai zoomaa.</p>
<p><img src="static/Mediatuotanto-t-resized_600x675_haastattelutilanne700-fi.jpg" alt="haastattelutilanne700.jpg" width="600" height="675" /></p>
<p><em>Haastattelutilanteessa kuvaaja, haastattelija ja haastateltava voivat asettua esimerkiksi kolmiomuodostelmaan. Kuvaaja saa pienill&auml; paikan vaihdoksilla tai kameran zoomilla helposti erilaisia kuvia.&nbsp; </em></p>
<p>Haastattelutilanteessa kuvaaja voi sijoittua muutamalla eri tavalla. Nyrkkis&auml;&auml;nt&ouml; on, ett&auml; kameran tulisi olla suurin piirtein samalla tasolla kuin kuvattavan silm&auml;t. T&auml;ll&ouml;in kuva n&auml;ytt&auml;&auml; luonnolliselta ja kuvattavan henkil&ouml;n kasvot n&auml;kyv&auml;t. Reilusta yl&auml;- tai alakulmasta kuvattu haastattelu voi toimia tehokeinona, mutta pidemm&auml;n p&auml;&auml;lle se usein h&auml;iritsee katsojaa.</p>
<p>Usein luonnollinen tapa kuvata haastattelua on sijoittaa haastattelija kameran viereen ja pyyt&auml;&auml; haastateltavaa katsomaan haastattelijaa silmiin. N&auml;in haastateltava n&auml;kyy hyvin mutta h&auml;n ei puhu suoraan kameralle, vaan aavistuksen verran linssin ohi. Suoraan kameraan katsominen on voimakas tehokeino, joka toimii esimerkiksi juonnoissa tai suoraan katsojia puhuteltaessa.</p>
<p>Kuvakokojen lis&auml;ksi on t&auml;rke&auml;&auml; kiinnitt&auml;&auml; huomiota <strong>kompositioon</strong>. Kompositio tarkoittaa kuvauskohteen sijoittamista kuvaruutuun. Sijoita haastateltava kuvaan niin, ett&auml; h&auml;nen katseelleen ja puheelleen j&auml;&auml; tilaa. Joissakin tilanteissa voit mahduttaa my&ouml;s haastattelijan kuvaan esimerkiksi niin, ett&auml; kuvaat haastattelijan olan yli. T&auml;m&auml; ns. twoshot tuo el&auml;vyytt&auml; haastatteluun.</p>
<p>Kannattaa my&ouml;s katsoa, ett&auml; kuvattavan henkil&ouml;n p&auml;&auml;n p&auml;&auml;lle j&auml;&auml; sopivasti tilaa ja ettei kuva katkaise henkil&ouml;&auml; esimerkiksi kaulasta. Mit&auml; tiukemmin kuva on <strong>rajattu</strong> haastateltavaan, sit&auml; v&auml;hemm&auml;n kuvaan mahtuu taustaa ja p&auml;invastoin. Tavoitteena on joka tapauksessa l&ouml;yt&auml;&auml; kuvakoko ja kompositio, jossa haastateltava n&auml;ytt&auml;&auml; luontevalta ja h&auml;nell&auml; on tilaa sanoa sanottavansa.</p>
<p>Jos kuvaat useita haastatteluja samaa ohjelmaa varten saat kuvakerronnasta el&auml;v&auml;mp&auml;&auml; jos sommittelet puhujat kuvan eri laitoihin, toisen oikeaan laitaan niin ett&auml; katseen suunta on vasemmalle ja toisen vasempaan laitaan niin ett&auml; katseen suunta on oikealle. N&auml;in saat leikkausvaiheessa n&auml;m&auml; kaksi ihmist&auml; ik&auml;&auml;n kuin keskustelemaan kesken&auml;&auml;n vastakkain.</p>
<h3>Suojaviiva</h3>
<p>Kuvaamisen yhteydess&auml; puhutaan usein suojaviivasta. K&auml;yt&auml;nn&ouml;ss&auml; t&auml;m&auml; tarkoitaa sit&auml;, ett&auml; kameran on esimerkiksi kahden henkil&ouml;n keskustelua kuvattaessa pysytt&auml;v&auml; kuvattaviin n&auml;hden samalla puolella koko keskustelun ajan. Jos kuvaat henkil&ouml;it&auml; A ja B niin, ett&auml; A on kuva vasemmassa laidassa ja B oikeassa ja kesken kuvauksen siirrytkin kuvaamaan henkil&ouml;it&auml; heid&auml;n toiselta puolelta pomppaavat A ja B kuvassa toisin p&auml;in. T&auml;m&auml; voi h&auml;mment&auml;&auml; katsojia.</p>
<p>Toinen esimerkki suojaviivasta on liikkeen suunnan s&auml;ilytt&auml;minen. Jos kuvaat ohi ajavia autoja niin, ett&auml; autot liikkuvat kuvan vasemmasta laidasta oikeaan laitaan, sinun pit&auml;&auml; pysytell&auml; koko ajan samalla puolella suhteessa autoihin. Jos kuvaat autot my&ouml;s toiselta puolelta ja yhdist&auml;t n&auml;m&auml; kaksi kuvaa, lopputuloksessa autot liikkuu kuvassa edestakaisin. Suojaviivas&auml;&auml;nt&ouml;&auml; rikotaan usein tietoisesti.</p>
<p><img title="kuvaus" src="static/resized_600x524_kuvaus-fi.jpg" alt="kuvaus" width="600" height="524" /></p>
   
  </div>
 </div>


  </div>
</div>
<!-- End of content -->



<!-- sputnik error page -->
<div id="dialog-sputnik-qrac" style="display: none"></div>
<div id="dialog-sputnik-error" title="Can't communicate with booktype">
  <p>
    <span class="ui-icon ui-icon-circle-check" style="float:left; margin:0 7px 50px 0;"></span>
    There has been error in communication with Booktype server.
    Not sure right now where is the problem.
  </p>
  <p>
    You should refresh this page.
  </p>
</div>


<ul class="strings template">
 <li class="ok">OK</li>
 <li class="back">Back</li>
 <li class="create">Create</li>
 <li class="cancel">Cancel</li>
 <li class="next">Next</li>
 <li class="import">Import</li>
 <li class="savechanges">Save changes</li>
 <li class="errorcreategroup">Couldn't create a group!</li>
 <li class="msgepub">enter epub URL</li>
 <li class="msgarchive">enter Archive.org ID</li>
 <li class="msgwiki">enter Wikibooks URL</li>
 <li class="msgbooktype">enter Booktype URL</li>
 <li class="deletebook">Delete book</li>
</ul>

</body>
</html>

