
<!DOCTYPE HTML>
<html>
 <head>
   

<link type="text/css" href="/site_static/css/booki.css" rel="Stylesheet" >
<link type="text/css" href="/site_static/js/jquery/themes/base/jquery.ui.all.css" rel="Stylesheet" >
<link type="text/css" href="/site_static/js/jquery/themes/smoothness/jquery.ui.all.css" rel="Stylesheet" >
<script type="text/javascript" src="/site_static/js/jquery/jquery-1.4.4.js"></script>
<script type="text/javascript" src="/site_static/js/jquery/ui/jquery-ui-1.8.10.custom.js"></script>
<script type="text/javascript" src="/site_static/js/jquery.json-1.3.js"></script>
<script type="text/javascript" src="/site_static/js/booki.js"></script>
<script src="/site_static/js/messaging.js" type="text/javascript"></script>   
<script type="text/javascript" src="/site_static/js/general.js"></script>
<link href="/site_static/css/jquery.bubblepopup.v2.3.1.css" rel="stylesheet" type="text/css" />
<link type="text/css" href="/site_static/css/jquery-ui_overrides.css" rel="Stylesheet" >
<script src="/site_static/js/jquery.bubblepopup.v2.3.1.min.js" type="text/javascript"></script>

<link rel="SHORTCUT ICON" href="http://write.flossmanuals.net/site_static/images/favicon.ico" type="image/x-icon">
<meta property="og:site_name" content="FLOSS Manuals"/><meta name="description" content="Free Manuals for Freedom"/>

<script type="text/javascript">
  $(function() {
      $.booki.sputnikDispatcherURL = "/_sputnik/";

      $("#dialog-sputnik-error").dialog({
          modal: true,
          autoOpen: false,
          buttons: {
            Ok: function() {
               $(this).dialog('close');
               window.location = '.';
            }
          }
      });
  
      $("FORM.messagefield").messagefield('init', {'view_post': '/messaging/post' });  
  });
</script>


   
 <title>/chapter: Suodattimet / Inkscape suomeksi</title>
 <link type="text/css" href="/site_static/css/draft.css" rel="Stylesheet" />

 <link rel="alternate" type="application/rss+xml" title="RSS feed for Inkscape suomeksi" href="/feeds/rss/book/inkscape-suomeksi/" /> 
 <link rel="alternate" type="application/atom+xml" title="Atom feed for Inkscape suomeksi" href="/feeds/atom/book/inkscape-suomeksi/" /> 

 <link rel="alternate" type="application/rss+xml" title="RSS feed for chapter SUODATTIMET" href="/feeds/rss/chapter/inkscape-suomeksi/inkscape-suomeksi/" /> 
 <link rel="alternate" type="application/atom+xml" title="Atom feed for chapter SUODATTIMET" href="/feeds/atom/chapter/inkscape-suomeksi/inkscape-suomeksi/" /> 
 
 <script type="text/javascript" src="/site_static/js/draft.js"></script>


   <link type="text/css" href="/static/css/_user.css" rel="Stylesheet" >
 </head>
<body>

<div class="topbar"> 
  <div class="logotext"><a href="http://write.flossmanuals.net/">FLOSS Manuals</a> </div>

  <div class="meta-bar">
    
    <ul>
      <li>
        <a href="/accounts/signin/?redirect=/inkscape-suomeksi/_draft/_v/1.0/suodattimet/">Sign In / Create Account</a>
      </li>
    </ul>
    
    <div style="padding-top: 10px; padding-right: 15px;">
      <br/>
      

<script>
  $(function() {
    var $frm = $("FORM[name=changelang]");
	
    $("A[href=#]", $frm).click(function() {
        var lang = $(this).attr("class").substr(4);
	
        $("INPUT[name=language]", $frm).val(lang);
        $frm.submit();
	
        return false;
    });
  });
 </script>

<form name="changelang" method="POST" action="/accounts/i18n/setlang/?language=en-us">
  <input type="hidden" name="language" value="en-us">
  
    &nbsp;English&nbsp;|
  
  
  
    &nbsp;<a class="langes" href="#">Español</a>&nbsp;|
  

  
    &nbsp;<a class="langfr" href="#">Français</a>&nbsp;|
  
	
  
    &nbsp;<a class="langit" href="#">Italiano</a>&nbsp;|
  
	
  
    &nbsp;<a class="langpt" href="#">Português</a>&nbsp;|
  
	
  
    &nbsp;<a class="langru" href="#">Русский</a>&nbsp;|
  
	
  
    &nbsp;<a class="langsq" href="#">Shqip</a>
  	
</form>

    </div>
    
    
  </div><!-- End of .meta-bar -->
</div><!-- End top bar -->

<div class="menubar shadow">
  
  
  <div class="navbox">
    <ul>
      <li><a href="/list-books/">Books</a></li>
      <li><a href="/list-groups/">Groups</a></li>
      <li><a href="/list-people/">People</a></li>
    </ul>      
  </div><!-- End of .navbox -->       
</div>

<div class="content-container">
  <div class="content shadow">
    <!-- Content box and the drop shadow-->
    

<h2>Inkscape suomeksi</h2>
<div class="padded">
 <div id="bookmenu" style="background: url(/site_static/images/draft_bg.png) repeat !important;"> 
  <ul>
   
    
      <li><b>JOHDANTO</b></li>
    
   
    
      <li><a href="/inkscape-suomeksi/_draft/_v/1.0/inkscape-ohje/">INKSCAPE-OHJE</a></li>
    
   
    
      <li><a href="/inkscape-suomeksi/_draft/_v/1.0/svg-vektorigrafiikka/">SVG-VEKTORIGRAFIIKKA</a></li>
    
   
    
      <li><b>ASENNUS</b></li>
    
   
    
      <li><a href="/inkscape-suomeksi/_draft/_v/1.0/asennus-windowsiin/">ASENNUS WINDOWSIIN</a></li>
    
   
    
      <li><b>PERUSTEET</b></li>
    
   
    
      <li><a href="/inkscape-suomeksi/_draft/_v/1.0/kayttoliittyma/">KÄYTTÖLIITTYMÄ</a></li>
    
   
    
      <li><a href="/inkscape-suomeksi/_draft/_v/1.0/tiedostojen-kaytto/">TIEDOSTOJEN KÄYTTÖ</a></li>
    
   
    
      <li><b>PIKAOPAS</b></li>
    
   
    
      <li><a href="/inkscape-suomeksi/_draft/_v/1.0/kuvakkeiden-luominen/">KUVAKKEIDEN LUOMINEN</a></li>
    
   
    
      <li><b>TYÖKALULAATIKKO</b></li>
    
   
    
      <li><a href="/inkscape-suomeksi/_draft/_v/1.0/valinta/">VALINTA</a></li>
    
   
    
      <li><a href="/inkscape-suomeksi/_draft/_v/1.0/solmu/">SOLMU</a></li>
    
   
    
      <li><a href="/inkscape-suomeksi/_draft/_v/1.0/muokkaus/">MUOKKAUS</a></li>
    
   
    
      <li><a href="/inkscape-suomeksi/_draft/_v/1.0/zoomaus/">ZOOMAUS</a></li>
    
   
    
      <li><a href="/inkscape-suomeksi/_draft/_v/1.0/suorakulmio/">SUORAKULMIO</a></li>
    
   
    
      <li><a href="/inkscape-suomeksi/_draft/_v/1.0/kolmiulotteinen-laatikko/">KOLMIULOTTEINEN LAATIKKO</a></li>
    
   
    
      <li><a href="/inkscape-suomeksi/_draft/_v/1.0/ellipsi/">ELLIPSI</a></li>
    
   
    
      <li><a href="/inkscape-suomeksi/_draft/_v/1.0/tahti/">TÄHTI</a></li>
    
   
    
      <li><a href="/inkscape-suomeksi/_draft/_v/1.0/spiraali/">SPIRAALI</a></li>
    
   
    
      <li><a href="/inkscape-suomeksi/_draft/_v/1.0/lyijykyna/">LYIJYKYNÄ</a></li>
    
   
    
      <li><a href="/inkscape-suomeksi/_draft/_v/1.0/bezier/">BÉZIER</a></li>
    
   
    
      <li><a href="/inkscape-suomeksi/_draft/_v/1.0/kalligrafia/">KALLIGRAFIA</a></li>
    
   
    
      <li><a href="/inkscape-suomeksi/_draft/_v/1.0/pyyhekumi/">PYYHEKUMI</a></li>
    
   
    
      <li><a href="/inkscape-suomeksi/_draft/_v/1.0/sankotaytto/">SANKOTÄYTTÖ</a></li>
    
   
    
      <li><a href="/inkscape-suomeksi/_draft/_v/1.0/teksti/">TEKSTI</a></li>
    
   
    
      <li><a href="/inkscape-suomeksi/_draft/_v/1.0/liitin/">LIITIN</a></li>
    
   
    
      <li><a href="/inkscape-suomeksi/_draft/_v/1.0/liukuvari/">LIUKUVÄRI</a></li>
    
   
    
      <li><a href="/inkscape-suomeksi/_draft/_v/1.0/pipetti/">PIPETTI</a></li>
    
   
    
      <li><b>POLUT</b></li>
    
   
    
      <li><a href="/inkscape-suomeksi/_draft/_v/1.0/muuta-polkua/">MUUTA POLKUA</a></li>
    
   
    
      <li><b>TEKSTI</b></li>
    
   
    
      <li><a href="/inkscape-suomeksi/_draft/_v/1.0/tekstin-tyyli/">TEKSTIN TYYLI</a></li>
    
   
    
      <li><a href="/inkscape-suomeksi/_draft/_v/1.0/tekstin-efektit/">TEKSTIN EFEKTIT</a></li>
    
   
    
      <li><a href="/inkscape-suomeksi/_draft/_v/1.0/teksti-ja-polut/">TEKSTI JA POLUT</a></li>
    
   
    
      <li><b>USEAMMAN OBJEKTIN OPERAATIOT</b></li>
    
   
    
      <li><a href="/inkscape-suomeksi/_draft/_v/1.0/kopioi-kloonaa-ja-monista/">KOPIOI, KLOONAA JA MONISTA</a></li>
    
   
    
      <li><a href="/inkscape-suomeksi/_draft/_v/1.0/leikkaus-ja-peitteet/">LEIKKAUS JA PEITTEET</a></li>
    
   
    
      <li><b>KOHTEIDEN SIJOITTELU</b></li>
    
   
    
      <li><a href="/inkscape-suomeksi/_draft/_v/1.0/sijoittelu/">SIJOITTELU</a></li>
    
   
    
      <li><a href="/inkscape-suomeksi/_draft/_v/1.0/jaa-ja-tasaa/">JAA JA TASAA</a></li>
    
   
    
      <li><b>KOHTEIDEN JÄRJESTELY</b></li>
    
   
    
      <li><a href="/inkscape-suomeksi/_draft/_v/1.0/tasot/">TASOT</a></li>
    
   
    
      <li><a href="/inkscape-suomeksi/_draft/_v/1.0/ryhmittely/">RYHMITTELY</a></li>
    
   
    
      <li><b>KOHTEIDEN TYYLI</b></li>
    
   
    
      <li><a href="/inkscape-suomeksi/_draft/_v/1.0/tyyli/">TYYLI</a></li>
    
   
    
      <li><a href="/inkscape-suomeksi/_draft/_v/1.0/taytto-ja-viiva/">TÄYTTÖ JA VIIVA</a></li>
    
   
    
      <li><b>POLKUTEHOSTE</b></li>
    
   
    
      <li><a href="/inkscape-suomeksi/_draft/_v/1.0/polkutehosteet/">POLKUTEHOSTEET</a></li>
    
   
    
      <li><a href="/inkscape-suomeksi/_draft/_v/1.0/hammasrattaat/">HAMMASRATTAAT</a></li>
    
   
    
      <li><a href="/inkscape-suomeksi/_draft/_v/1.0/muoto-polkua-pitkin/">MUOTO POLKUA PITKIN</a></li>
    
   
    
      <li><b>SUODATTIMET</b></li>
    
   
    
      <li><a href="/inkscape-suomeksi/_draft/_v/1.0/suodattimet/">SUODATTIMET</a></li>
    
   
    
      <li><b>ASETUKSET</b></li>
    
   
    
      <li><a href="/inkscape-suomeksi/_draft/_v/1.0/varinhallinta/">VÄRINHALLINTA</a></li>
    
   
    
      <li><b>LIITTEET</b></li>
    
   
    
      <li><a href="/inkscape-suomeksi/_draft/_v/1.0/kayttoohjeesta/">KÄYTTÖOHJEESTA</a></li>
    
   
    
      <li><a href="/inkscape-suomeksi/_draft/_v/1.0/lisenssi/">LISENSSI</a></li>
    
   
  </ul>
 </div>
 <div id="bookcontent"   style="background: url(/site_static/images/draft_bg.png) repeat !important;">
   

  <h1><span style="font-size: 2em;">SVG-suodattimet</span></h1>
<h2>Perusteet</h2>
<p>SVG:n suodattimet eroavat esimerkiksi GIMP:n suodattimista siten, ett&auml; mik&auml; GIMP:ss&auml; on suodatin, on SVG:ss&auml; suodinosa. Suodatin voi SVG:ss&auml; sis&auml;lt&auml;&auml; useita suodinosia. Esimerkiksi SVG-suodatin, joka luo tuliefektin, koostuu suodinosista <em>turbulenssi, v&auml;rimatriisi</em> ja <em>Gauss-sumennus</em>. SVG-suodattimet eiv&auml;t muuta pysyv&auml;sti kohdettaan. Suodattimia voi k&auml;ytt&auml;&auml; SVG-tiedostossa sek&auml; vektori- ett&auml; bittikarttakohteille.</p>
<p>SVG-suodattimia k&auml;ytt&auml;ess&auml; on hyv&auml; muistaa, ett&auml; ne k&auml;sittelev&auml;t aina kuvan bittikarttaesityst&auml;. Muokattaessa kuvaa suodatettu kohde piirret&auml;&auml;n bittikarttakuvaksi, ja suodatin suoritetaan t&auml;lle kuvalle aina alkuper&auml;isen kohteen muuttuessa, tai kun siit&auml; tarvitaan toisen kokoinen versio.</p>
<h2>Suodinosat</h2>
<p>Inkscape tukee seuraavia SVG:n suodinosia:</p>
<ul>
<li><strong>Sekoita</strong> (feBlend) tarjoaa useimmista muistakin kuvank&auml;sittelyohjelmista tuttuja tapoja kuvien yhdist&auml;miseen. N&auml;it&auml; tapoja ovat kertova, rasteri, tummenna ja vaalenna. On hyv&auml; kuitenkin huomata, ett&auml; jos kohde yhdistet&auml;&auml;n osittain l&auml;pin&auml;kyv&auml;n taustan kanssa, tausta yhdistet&auml;&auml;n kuvaan kahdesti, ja suodatetun kohteen ymp&auml;rill&auml; taustasta tulee v&auml;hemm&auml;n l&auml;pin&auml;kyv&auml;. T&auml;m&auml; on rajoitus nykyisess&auml; SVG-versiossa, ei virhe Inkscapessa.</li>
<li><strong>V&auml;rimatriisi</strong> (feColorMatrix) muuntaa jokaisen kuvan pikselin v&auml;riarvon annetulla matriisilla. T&auml;m&auml; mahdollistaa esimerkiksi kuvan muuntamisen harmaas&auml;vyiseksi, v&auml;rikyll&auml;isyyden s&auml;&auml;t&auml;misen ja v&auml;ris&auml;vyn vaihtamisen.</li>
<li><strong>Yhdiste</strong> (feComposite) yhdist&auml;&auml; kaksi kuvaa k&auml;ytt&auml;en jotain Porter-Duff sekoitustilaa tai SVG-standardissa m&auml;&auml;ritelty&auml; aritmeettista tilaa. Porter-Duff sekoitustilat ovat oleellisesti kuville suoritettavia logiikan laskutoimituksia. Esimerkiksi xor eli poissulkeva tai -tilassa n&auml;kyviin j&auml;&auml;v&auml;t ne alueet, jotka ovat l&auml;pin&auml;kym&auml;tt&ouml;mi&auml; jommassa kummassa sy&ouml;tekuvassa, mutta eiv&auml;t molemmissa. Aritmeettisessa tilassa voit m&auml;&auml;ritell&auml; nelj&auml; kerrointa, k1-k4, joiden perusteella lasketaan tuotettavan kuvan kunkin pikselin v&auml;ri seuraavasti: k1 * ensimm&auml;isen kuvan v&auml;ri * toisen kuvan v&auml;ri + k2 * ensimm&auml;isen kuvan v&auml;ri + k3 * toisen kuvan v&auml;ri + k4.</li>
<li><strong>Konvoluutio</strong> (feConvolveMatrix) on suodatin, joka laskee tuotettavan v&auml;rin l&auml;hell&auml; olevien pikseleiden v&auml;rien ja annettujen kertoimien perusteella. Tyypillisi&auml; konvoluutiolla tuotettavia efektej&auml; ovat sumennus, ter&auml;v&ouml;itys, kohokuviointi ja reunantunnistus. Huomaathan, ett&auml; vaikka t&auml;ll&auml; suodinosalla voi luoda Gauss-sumennuksen, sille on oma suodinosansa, joka toimii nopeammin ja ei riipu kuvan resoluutiosta.</li>
<li>Valaistussuotimet <strong>H&auml;m&auml;r&auml; valaistus</strong> (feDiffuseLighting) ja <strong>Heijastusvalo</strong> (feSpecularLighting) luovat valaistuskartan sy&ouml;tekuvalle. Koska SVG:ss&auml; ei ole olemassa kolmatta ulottuvuutta, jonka perusteella valaistuksen voisi laskea, n&auml;m&auml; suodatinosat k&auml;ytt&auml;v&auml;t sy&ouml;tekuvan l&auml;pin&auml;kyvyytt&auml; korkeuskarttana: mit&auml; l&auml;pin&auml;kyv&auml;mpi kuva kohta on, sit&auml; kauempana katsojasta sen kohdan tulkitaan olevan. Inkscape-jakelupaketissa on mukana esimerkkej&auml; n&auml;iden suodattimien k&auml;yt&ouml;st&auml;, sijainnissa share/examples/lighting_filters.svg.</li>
<li><strong>Poikkeutuskartta</strong> (feDisplacementMap) siirt&auml;&auml; ensimm&auml;isen sy&ouml;tekuvan pikseleit&auml; toisen sy&ouml;tteen v&auml;rien mukaan. Tuotettavan kuvan kohdan v&auml;ri valitaan toisen sy&ouml;tekuvan v&auml;rin m&auml;&auml;r&auml;&auml;m&auml;n matkan p&auml;&auml;st&auml; ensimm&auml;isest&auml; sy&ouml;tekuvasta. Tunnettuja esimerkkej&auml; t&auml;st&auml; suodattimesta ovat kuvan kierto ja pullistus, jotka l&ouml;ytyv&auml;tkin useimmista kuvank&auml;sittelyohjelmista, sek&auml; my&ouml;s joistain n&auml;yt&ouml;ns&auml;&auml;st&auml;jist&auml;, joissa kiertym&auml; tai pullistuma liikkuu ymp&auml;ri ty&ouml;p&ouml;yt&auml;&auml;.</li>
<li><strong>T&auml;ytt&ouml;</strong> (feFlood) luo tasaisella v&auml;rill&auml; t&auml;ytetyn kuvan. T&auml;m&auml; on k&auml;ytt&ouml;kelpoinen l&auml;hinn&auml; jonkin muun suodinosan kanssa k&auml;ytettyn&auml;, v&auml;rj&auml;&auml;m&auml;&auml;n tuotettua kuvaa.</li>
<li><strong>Gauss-sumennus</strong> (feGaussianBlur) sumentaa kohdettaan. T&auml;m&auml; mahdollistaa useiden muuten vaikeasti j&auml;ljitelt&auml;vien ilmi&ouml;iden esitt&auml;misen, kuten vapaamuotoiset varjot ja kirkkaat kohdat, depth of field ???, heittovarjot, hehkut jne. Sumennettuja kohteita voi my&ouml;s k&auml;ytt&auml;&auml; maskeina, mik&auml; mahdollistaa maskien h&auml;ivytetyt reunat.</li>
<li><strong>Kuva</strong> (feImage) tuo ulkoisen kuvatiedoston tai osan nykyist&auml; SVG-tiedostoa osaksi suodatinta. T&auml;t&auml; voisi k&auml;ytt&auml;&auml; esimerkiksi tuomaan kuvatiedoston poikkeutuskartta-suodinosan poikkeutuskartaksi tai valaistussuotimien korkeuskartaksi.</li>
<li><strong>Yhdist&auml;</strong> (feMerge) yhdist&auml;&auml; useita suodattimen v&auml;liaikaisia kuvia yhdeksi kuvaksi. T&auml;m&auml; k&auml;ytt&auml;&auml; tavallista alpha-yhdist&auml;mist&auml;, kuten muutenkin asetettaessa kohteita p&auml;&auml;llekk&auml;in SVG-kuvassa. T&auml;m&auml; suodatinosa vastaa useiden Sekoita-suodatinosien k&auml;ytt&ouml;&auml; normaalitilassa tai Yhdiste-suodatinosien k&auml;ytt&ouml;&auml; yli-tilassa.</li>
<li><strong>Morfologia</strong> (feMorphology) tarjoaa toiminnot Kuluta ja Laajenna. Kuluta levitt&auml;&auml; tummia ja l&auml;pin&auml;kyvi&auml; alueita vaaleammille ja v&auml;hemm&auml;n l&auml;pin&auml;kyville alueille, kun taas laajenna levitt&auml;&auml; vaaleita ja l&auml;pin&auml;kym&auml;tt&ouml;mi&auml; alueita. Yksiv&auml;risille kohteille t&auml;m&auml; yksinkertaisesti tarkoittaa, ett&auml; kuluta kutistaa kohdetta ja laajenna laajentaa sit&auml;.</li>
<li><strong>Siirtym&auml;</strong> (feOffset) siirt&auml;&auml; kuvaa k&auml;ytt&auml;j&auml;n antaman m&auml;&auml;r&auml;n. T&auml;m&auml; on hy&ouml;dyllinen esimerkiksi heittovarjon tekemiseen, miss&auml; varjon pit&auml;&auml; olla v&auml;h&auml;n eri paikassa kuin alkuper&auml;isen kohteen.</li>
<li><strong>Turbulenssi</strong> (feTurbulence) luo <span class="external text">Perlin-kohinaa</span>. T&auml;llainen kohina on k&auml;ytt&ouml;kelpoista monien luonnonilmi&ouml;iden j&auml;ljittelyss&auml;, esimerkiksi pilvien, tulen ja savun. Lis&auml;ksi Perlin-kohinalla voi hyvin luoda monimutkaisia kuviointeja, kuten marmoria tai graniittia.</li>
</ul>
<h2>K&auml;ytt&ouml;liittym&auml; suodattimille</h2>
<h3>Suodatintehosteiden muokkausikkunan osat</h3>
<p>Suodatintehosteiden luominen ja muokkaaminen tapahtuu omassa ikkunassaan, joka l&ouml;ytyy Inkscapen valikoista paikasta <span class="menu">Kohde </span>&gt;<span class="menu"> Suodatintehosteet...</span>.</p>
<p><img title="ScreenHunter_07_Jan._10_22.33" src="static/Inkscape-SVGFilterEffects-ScreenHunter_07_Jan-_10_22-33-fi.gif" alt="ScreenHunter_07_Jan._10_22.33" width="428" height="822" />&nbsp;</p>
<p>Ikkunan vasemmalla reunalla on lista tiedostossa t&auml;ll&auml; hetkell&auml; olevista suodattimista.</p>
<h3>Suodattimien hallinta</h3>
<ul>
<li>Uusia suodattimia voi luoda <strong>Uusi</strong>-napista suodatinlistan alla.</li>
<li>Suodattimen voi kahdentaa tai poistaa napsauttamalla sit&auml; hiiren oikealla napilla suodatinlistassa.</li>
<li>Suodattimen kaksoisnapsauttaminen suodatinlistassa asettaa sen k&auml;ytt&ouml;&ouml;n valituille kohteille.</li>
<li>Valittuissa kohteissa k&auml;yt&ouml;ss&auml; olevat suodattimet on merkitty suodatinlistassa. Jos valituissa kohteissa on k&auml;yt&ouml;ss&auml; useita suodattimia, ne kaikki on merkitty.</li>
</ul>
<h3>Suodinosien hallinta</h3>
<p>Toisessa, ikkunan vasemmalla puolen olevassa, listassa n&auml;kyv&auml;t valitun suodattimen sis&auml;lt&auml;m&auml;t <strong>suodatinosat</strong>.</p>
<ul>
<li>Uuden suodatinosan suodattimeen voi lis&auml;t&auml; valitsemalla haluamansa listan alla olevasta alasvetovalikosta ja napsauttamalla sen vieress&auml; olevaa Lis&auml;&auml; tehoste -nappia.</li>
<li>Listassa olevan suodinosan napsauttaminen oikealla napilla mahdollistaa suodinosan kahdentamisen ja poistamisen.</li>
<li>Suodinosia voi uudelleenj&auml;rjestell&auml; raahaamalla niit&auml; listassa uusille paikoille.</li>
<li>Kun suodinosa on valittuna, listan alla oleva Tehosteen parametrit -alue n&auml;ytt&auml;&auml; valittuna olevan suodinosan asetukset. Muutokset asetuksissa n&auml;kyv&auml;t suoraan kuvassa.</li>
<li>Suodinosan sy&ouml;tekuvat ovat my&ouml;s parametreja, mutta ne eiv&auml;t n&auml;y Tehosteen parametrit -alueella, vaan viivoina suodinosien listalla, Yhteydet-sarakkeessa.</li>
<li>Suodinosan ottamat sy&ouml;tekuvat n&auml;kyv&auml;t kolmioina. Yleens&auml; suodinosa ottaa yksi tai kaksi sy&ouml;tekuvaa, muutama ei ota yht&auml;&auml;n ja yhdist&auml; ottaa kuinka monta vain. Mist&auml; sy&ouml;te tulee, voi valita raahaamalla kolmiosta haluttuun l&auml;ht&ouml;paikkaan.</li>
<li>On olemassa kuusi yleist&auml; sy&ouml;tett&auml;, jotka suodinosalle voi antaa: <em>L&auml;hdegrafiikka</em>, <em>L&auml;hde-alpha</em>, <em>Taustakuva</em>, <em>Taustan alpha</em>, <em>T&auml;ytt&ouml;v&auml;ri</em> ja <em>Taustan v&auml;ri</em>. N&auml;m&auml; n&auml;kyv&auml;t pystysuorina palkkeina suodinlistan oikeassa laidassa. Raahaa suodinosan sy&ouml;tekolmiosta haluamaasi n&auml;ist&auml; k&auml;ytt&auml;&auml;ksesi sit&auml;.</li>
<li>Suodinosat voivat ottaa sy&ouml;tteekseen my&ouml;s toisen suodinosan tuloksen. T&auml;m&auml;n voi tehd&auml; raahaamalla suodinosan sy&ouml;tekolmiosta yl&ouml;sp&auml;in haluttuun kuval&auml;hteeseen. Suodinosat eiv&auml;t voi k&auml;ytt&auml;&auml; alempana listassa olevien suodinosien tuloksia sy&ouml;ttein&auml;&auml;n.</li>
<li>Sy&ouml;tekolmion napsauttaminen palauttaa sen oletusl&auml;hteeseens&auml;. <em>Yhdist&auml;</em>-suodinosan sy&ouml;tekolmion napsauttaminen kadottaa sen.</li>
<li>Yhdist&auml;-suodinosalla on aina tyhj&auml; sy&ouml;tekolmio viimeisen&auml;. Siit&auml; raahaamalla voi lis&auml;t&auml; uuden sy&ouml;tteen suodinosalle.</li>
</ul>
   
  </div>
 </div>


  </div>
</div>
<!-- End of content -->



<!-- sputnik error page -->
<div id="dialog-sputnik-qrac" style="display: none"></div>
<div id="dialog-sputnik-error" title="Can't communicate with booktype">
  <p>
    <span class="ui-icon ui-icon-circle-check" style="float:left; margin:0 7px 50px 0;"></span>
    There has been error in communication with Booktype server.
    Not sure right now where is the problem.
  </p>
  <p>
    You should refresh this page.
  </p>
</div>


<ul class="strings template">
 <li class="ok">OK</li>
 <li class="back">Back</li>
 <li class="create">Create</li>
 <li class="cancel">Cancel</li>
 <li class="next">Next</li>
 <li class="import">Import</li>
 <li class="savechanges">Save changes</li>
 <li class="errorcreategroup">Couldn't create a group!</li>
 <li class="msgepub">enter epub URL</li>
 <li class="msgarchive">enter Archive.org ID</li>
 <li class="msgwiki">enter Wikibooks URL</li>
 <li class="msgbooktype">enter Booktype URL</li>
 <li class="deletebook">Delete book</li>
</ul>

</body>
</html>

