
<!DOCTYPE HTML>
<html>
 <head>
   

<link type="text/css" href="/site_static/css/booki.css" rel="Stylesheet" >
<link type="text/css" href="/site_static/js/jquery/themes/base/jquery.ui.all.css" rel="Stylesheet" >
<link type="text/css" href="/site_static/js/jquery/themes/smoothness/jquery.ui.all.css" rel="Stylesheet" >
<script type="text/javascript" src="/site_static/js/jquery/jquery-1.4.4.js"></script>
<script type="text/javascript" src="/site_static/js/jquery/ui/jquery-ui-1.8.10.custom.js"></script>
<script type="text/javascript" src="/site_static/js/jquery.json-1.3.js"></script>
<script type="text/javascript" src="/site_static/js/booki.js"></script>
<script src="/site_static/js/messaging.js" type="text/javascript"></script>   
<script type="text/javascript" src="/site_static/js/general.js"></script>
<link href="/site_static/css/jquery.bubblepopup.v2.3.1.css" rel="stylesheet" type="text/css" />
<link type="text/css" href="/site_static/css/jquery-ui_overrides.css" rel="Stylesheet" >
<script src="/site_static/js/jquery.bubblepopup.v2.3.1.min.js" type="text/javascript"></script>

<link rel="SHORTCUT ICON" href="http://write.flossmanuals.net/site_static/images/favicon.ico" type="image/x-icon">
<meta property="og:site_name" content="FLOSS Manuals"/><meta name="description" content="Free Manuals for Freedom"/>

<script type="text/javascript">
  $(function() {
      $.booki.sputnikDispatcherURL = "/_sputnik/";

      $("#dialog-sputnik-error").dialog({
          modal: true,
          autoOpen: false,
          buttons: {
            Ok: function() {
               $(this).dialog('close');
               window.location = '.';
            }
          }
      });
  
      $("FORM.messagefield").messagefield('init', {'view_post': '/messaging/post' });  
  });
</script>


   
 <title>/chapter: Comprender-El-Enrutamiento / Ardour 4 Es</title>
 <link type="text/css" href="/site_static/css/draft.css" rel="Stylesheet" />

 <link rel="alternate" type="application/rss+xml" title="RSS feed for Ardour 4 Es" href="/feeds/rss/book/ardour-4-es/" /> 
 <link rel="alternate" type="application/atom+xml" title="Atom feed for Ardour 4 Es" href="/feeds/atom/book/ardour-4-es/" /> 

 <link rel="alternate" type="application/rss+xml" title="RSS feed for chapter COMPRENDER EL ENRUTAMIENTO" href="/feeds/rss/chapter/ardour-4-es/ardour-4-es/" /> 
 <link rel="alternate" type="application/atom+xml" title="Atom feed for chapter COMPRENDER EL ENRUTAMIENTO" href="/feeds/atom/chapter/ardour-4-es/ardour-4-es/" /> 
 
 <script type="text/javascript" src="/site_static/js/draft.js"></script>


   <link type="text/css" href="/static/css/_user.css" rel="Stylesheet" >
 </head>
<body>

<div class="topbar"> 
  <div class="logotext"><a href="http://write.flossmanuals.net/">FLOSS Manuals</a> </div>

  <div class="meta-bar">
    
    <ul>
      <li>
        <a href="/accounts/signin/?redirect=/ardour-4-es/_draft/_v/2.0/comprender-el-enrutamiento/">Sign In / Create Account</a>
      </li>
    </ul>
    
    <div style="padding-top: 10px; padding-right: 15px;">
      <br/>
      

<script>
  $(function() {
    var $frm = $("FORM[name=changelang]");
	
    $("A[href=#]", $frm).click(function() {
        var lang = $(this).attr("class").substr(4);
	
        $("INPUT[name=language]", $frm).val(lang);
        $frm.submit();
	
        return false;
    });
  });
 </script>

<form name="changelang" method="POST" action="/accounts/i18n/setlang/?language=en-us">
  <input type="hidden" name="language" value="en-us">
  
    &nbsp;English&nbsp;|
  
  
  
    &nbsp;<a class="langes" href="#">Español</a>&nbsp;|
  

  
    &nbsp;<a class="langfr" href="#">Français</a>&nbsp;|
  
	
  
    &nbsp;<a class="langit" href="#">Italiano</a>&nbsp;|
  
	
  
    &nbsp;<a class="langpt" href="#">Português</a>&nbsp;|
  
	
  
    &nbsp;<a class="langru" href="#">Русский</a>&nbsp;|
  
	
  
    &nbsp;<a class="langsq" href="#">Shqip</a>
  	
</form>

    </div>
    
    
  </div><!-- End of .meta-bar -->
</div><!-- End top bar -->

<div class="menubar shadow">
  
  
  <div class="navbox">
    <ul>
      <li><a href="/list-books/">Books</a></li>
      <li><a href="/list-groups/">Groups</a></li>
      <li><a href="/list-people/">People</a></li>
    </ul>      
  </div><!-- End of .navbox -->       
</div>

<div class="content-container">
  <div class="content shadow">
    <!-- Content box and the drop shadow-->
    

<h2>Ardour 4 Es</h2>
<div class="padded">
 <div id="bookmenu" style="background: url(/site_static/images/draft_bg.png) repeat !important;"> 
  <ul>
   
    
      <li><b>INTRODUCCION</b></li>
    
   
    
      <li><a href="/ardour-4-es/_draft/_v/2.0/introduccion/">INTRODUCCIÓN MANUAL ARDOUR 4</a></li>
    
   
    
      <li><a href="/ardour-4-es/_draft/_v/2.0/acerca-de-este-manual/">ACERCA DE ESTE MANUAL</a></li>
    
   
    
      <li><a href="/ardour-4-es/_draft/_v/2.0/que-es-el-audio-digital/">¿QUE ES EL AUDIO DIGITAL?</a></li>
    
   
    
      <li><a href="/ardour-4-es/_draft/_v/2.0/instalar-ardour/">INSTALAR ARDOUR</a></li>
    
   
    
      <li><b>COMENZANDO</b></li>
    
   
    
      <li><a href="/ardour-4-es/_draft/_v/2.0/iniciar-jack-en-ubuntu/">JACK EN GNU/LINUX</a></li>
    
   
    
      <li><a href="/ardour-4-es/_draft/_v/2.0/iniciar-jackosx-en-osx/">INICIAR JACK</a></li>
    
   
    
      <li><a href="/ardour-4-es/_draft/_v/2.0/iniciar-ardour-en-ubuntu/">INICIAR ARDOUR</a></li>
    
   
    
      <li><a href="/ardour-4-es/_draft/_v/2.0/una-vision-general-de-la-interfaz/">UNA VISION GENERAL DE LA INTERFAZ</a></li>
    
   
    
      <li><a href="/ardour-4-es/_draft/_v/2.0/iniciar-una-sesion/">INICIAR UNA SESION</a></li>
    
   
    
      <li><a href="/ardour-4-es/_draft/_v/2.0/configurar-la-linea-de-tiempo/">CONFIGURAR LA LINEA DE TIEMPO</a></li>
    
   
    
      <li><a href="/ardour-4-es/_draft/_v/2.0/crear-una-pista-o-bus/">CREAR UNA PISTA O BUS</a></li>
    
   
    
      <li><a href="/ardour-4-es/_draft/_v/2.0/importar-audio/">IMPORTAR AUDIO</a></li>
    
   
    
      <li><a href="/ardour-4-es/_draft/_v/2.0/grabar-audio/">GRABAR AUDIO</a></li>
    
   
    
      <li><a href="/ardour-4-es/_draft/_v/2.0/comprender-el-enrutamiento/">COMPRENDER EL ENRUTAMIENTO</a></li>
    
   
    
      <li><a href="/ardour-4-es/_draft/_v/2.0/enrutar-entre-aplicaciones-para-jack/">ENRUTAR ENTRE APLICACIONES</a></li>
    
   
    
      <li><b>EDITAR SESIONES</b></li>
    
   
    
      <li><a href="/ardour-4-es/_draft/_v/2.0/organizar-pistas/">ORGANIZAR PISTAS</a></li>
    
   
    
      <li><a href="/ardour-4-es/_draft/_v/2.0/configurar-la-metrica/">CONFIGURAR LA METRICA</a></li>
    
   
    
      <li><a href="/ardour-4-es/_draft/_v/2.0/utilizar-rangos/">UTILIZAR RANGOS</a></li>
    
   
    
      <li><a href="/ardour-4-es/_draft/_v/2.0/trabajar-con-regiones/">TRABAJAR CON REGIONES</a></li>
    
   
    
      <li><a href="/ardour-4-es/_draft/_v/2.0/mas-operaciones-de-region/">MAS OPERACIONES DE REGION</a></li>
    
   
    
      <li><a href="/ardour-4-es/_draft/_v/2.0/cambiar-modos-de-edicion/">CAMBIAR MODOS DE EDICION</a></li>
    
   
    
      <li><a href="/ardour-4-es/_draft/_v/2.0/crear-secciones-cicladas/">CREAR SECCIONES EN LOOP (BUCLE)</a></li>
    
   
    
      <li><a href="/ardour-4-es/_draft/_v/2.0/expandir-encoger-regiones/">EXPANDIR / ENCOGER REGIONES</a></li>
    
   
    
      <li><b>MEZCLAR SESIONES</b></li>
    
   
    
      <li><a href="/ardour-4-es/_draft/_v/2.0/utilizar-la-banda-de-mezcla/">UTILIZAR LA BANDA DE MEZCLA</a></li>
    
   
    
      <li><a href="/ardour-4-es/_draft/_v/2.0/niveles-de-mezcla/">NIVELES DE MEZCLA</a></li>
    
   
    
      <li><a href="/ardour-4-es/_draft/_v/2.0/panoramizacion/">PANORÁMICOS</a></li>
    
   
    
      <li><a href="/ardour-4-es/_draft/_v/2.0/utilizar-plugins/">UTILIZAR PLUGINS</a></li>
    
   
    
      <li><a href="/ardour-4-es/_draft/_v/2.0/utilizar-envios/">UTILIZAR ENVIOS</a></li>
    
   
    
      <li><a href="/ardour-4-es/_draft/_v/2.0/dinamicas/">DINAMICAS</a></li>
    
   
    
      <li><a href="/ardour-4-es/_draft/_v/2.0/ecualizar/">ECUALIZAR</a></li>
    
   
    
      <li><a href="/ardour-4-es/_draft/_v/2.0/utilizar-automatizaciones/">UTILIZAR AUTOMATIZACIONES</a></li>
    
   
    
      <li><b>EXPORTAR</b></li>
    
   
    
      <li><a href="/ardour-4-es/_draft/_v/2.0/exportar-una-sesion/">EXPORTAR UNA SESION</a></li>
    
   
    
      <li><a href="/ardour-4-es/_draft/_v/2.0/exportar-una-region/">EXPORTAR UNA REGION</a></li>
    
   
    
      <li><a href="/ardour-4-es/_draft/_v/2.0/exportar-un-rango/">EXPORTAR UN RANGO</a></li>
    
   
    
      <li><b>GUARDAR SESIONES</b></li>
    
   
    
      <li><a href="/ardour-4-es/_draft/_v/2.0/guardar-una-sesion/">GUARDAR UNA SESION</a></li>
    
   
    
      <li><a href="/ardour-4-es/_draft/_v/2.0/guardar-una-captura/">GUARDAR UNA CAPTURA</a></li>
    
   
    
      <li><a href="/ardour-4-es/_draft/_v/2.0/guardar-una-plantilla/">GUARDAR UNA PLANTILLA</a></li>
    
   
    
      <li><b>APENDICES</b></li>
    
   
    
      <li><a href="/ardour-4-es/_draft/_v/2.0/mas-ayuda/">MAS AYUDA</a></li>
    
   
    
      <li><a href="/ardour-4-es/_draft/_v/2.0/enlaces/">ENLACES</a></li>
    
   
    
      <li><a href="/ardour-4-es/_draft/_v/2.0/glosario/">GLOSARIO</a></li>
    
   
    
      <li><a href="/ardour-4-es/_draft/_v/2.0/creditos/">CREDITOS</a></li>
    
   
  </ul>
 </div>
 <div id="bookcontent"   style="background: url(/site_static/images/draft_bg.png) repeat !important;">
   

  <h1 class="calibre1">Comprender el enrutamiento</h1>
<p class="calibre2">Enrutar una se&ntilde;al de audio es enviarla desde alg&uacute;n sitio a alg&uacute;n otro sitio m&aacute;s. Adem&aacute;s de conseguir se&ntilde;ales de audio a y desde Ardour, el enrutamiento juega una parte importante dentro de Ardour mismo. Ejemplos de utilizar enrutamiento dentro de Ardour incluyen audio desde Pistas al Bus Maestro o a otros Buses, crear 'env&iacute;os', enrutar las salidas desde los Buses al Bus Maestro, etc. (mira el cap&iacute;tulo <strong class="calibre3">Crear una Pista</strong> para una explicaci&oacute;n sobre Pistas y buses). Todo enrutamiento, tanto interno como externo para Ardour, est&aacute; manejado por JACK.</p>
<h3 class="calibre7">Enrutamiento en Ardour</h3>
<p class="calibre2">El enrutamiento est&aacute;ndar de entradas, pistas y buses en Ardour se determina cuando una Sesi&oacute;n nueva es creada en las Opciones Avanzadas de la caja de di&aacute;logo Sesi&oacute;n Nueva (mira el cap&iacute;tulo <strong class="calibre3">Iniciar una Sesi&oacute;n</strong>). Por defecto, el enrutamiento es como sigue:</p>
<ul class="calibre63">
<li class="calibre64">Las entradas del dispositivo de audio son enrutadas a las entradas de Pistas.</li>
<li class="calibre64">Todas las salidas desde las Pistas y buses son enrutadas a las entradas de bus maestro.</li>
<li class="calibre64">Las salidas del Bus Maestro son enrutadas a las salidas del dispositivo de audio.</li>
</ul>
<p class="calibre2">Observa que cuando se crea un nuevo Bus, nada se enruta a su entrada.</p>
<p>Esta configuraci&oacute;n de enrutamiento es b&aacute;sica y tiene sentido para las sesiones que contienen s&oacute;lo Pistas, pero para hacer uso de los buses (que no sea el bus maestro) o para ser creativo con las se&ntilde;ales de audio dentro de Ardour, tenemos que ser capaces de cambiar el enrutamiento.</p>
<p>La ventana del <strong>Administrador de Conexi&oacute;n de Audio</strong> (tambi&eacute;n conocido como "patchbay") es la principal manera de hacer conexiones hacia, desde y dentro del mezclador de Ardour. Puede abrir esta ventana con el atajo <strong>"Alt" + "N"</strong>, oa trav&eacute;s de la ventana de men&uacute; <strong>Ventana&gt; Audio Connections.</strong></p>
<p><img src="http://brunoruviaro.github.io/ardour4-tutorial/images/Ardour4_Audio_Connection_Manager_Menu.png" alt="Audio Connection Manager" />&nbsp;</p>
<p>El &aacute;rea de control o patchbay&nbsp;presenta dos grupos de puertos; un conjunto de fuentes llamadas <strong>or&iacute;genes</strong> (sources), y uno de <strong>destinos</strong>. Las fuentes-or&iacute;genes y los destinos son organizadas por pesta&ntilde;as. Las fuentes-or&iacute;genes&nbsp;disponibles se visualizan verticalmente en el lado izquierdo, y los destinos se visualizan horizontalmente en la parte inferior.</p>
<p>En la pantalla de abajo, observa que la pesta&ntilde;a <strong>"Hardware"</strong> se selecciona en la parte superior izquierda (que es una fuente u origen), y el <strong>"Ardour pistas (tracks)"</strong> se selecciona como destino en la parte inferior. Esto significa que la matriz muestra las conexiones de las fuentes de sonido del hardware disponible (por ejemplo, un micr&oacute;fono), para las pistas de Ardour existentes.</p>
<p><img src="http://brunoruviaro.github.io/ardour4-tutorial/images/Ardour4_Audio_Connection_Manager_1.png" alt="ACM 1" />&nbsp;</p>
<p>Los puntos verdes representan una conexi&oacute;n. La imagen anterior nos dice que los sonidos entrantes de "sistema: capture_1" (la primera fuente de entrada de la tarjeta de sonido, o el micr&oacute;fono incorporado del equipo port&aacute;til) est&aacute;n entrando en la pista Ardour llamada "Audio 1", y tambi&eacute;n que los sonidos entrantes de "sistema: capture_1" y "sistema: capture_2" van respectivamente a las entradas izquierda y derecha de la pista Ardour nombre "Audio 2."&nbsp;</p>
<p>Podemos ver que "Audio 1" es una pista mono, ya que s&oacute;lo tiene una ranura de conexi&oacute;n, mientras que la pista "Audio 2" es est&eacute;reo, ya que tiene dos ranuras (izquierda y derecha).</p>
<p>La siguiente captura de pantalla muestra la ruta de se&ntilde;al de las pistas de Ardour (pesta&ntilde;a vertical seleccionada) en Ardour buses (pesta&ntilde;a horizontal seleccionada). Como se mencion&oacute; anteriormente, la configuraci&oacute;n predeterminada para todas las pistas Ardour es que su sonido va al bus maestro o salida principal.</p>
<p><img src="http://brunoruviaro.github.io/ardour4-tutorial/images/Ardour4_Audio_Connection_Manager_2.png" alt="ACM 2" /></p>
<p style="padding-left: 30px;"><strong>Nota:</strong> recuerda que "Audio 1" es una pista mono. Lo vimos en la pantalla anterior que "Audio 1" s&oacute;lo tiene una ranura de entrada. Pero ahora en la pantalla de arriba se ve que "Audio 1" tiene dos salidas (izquierda y derecha). Esto es normal: definimos que una pista es mono o est&eacute;reo por s&uacute; n&uacute;mero de entradas, no de salidas. Las pistas mono sostendr&aacute;n un solo canal de audio, pero a&uacute;n as&iacute; se puede optar por colocar el sonido al altavoz izquierdo o al derecho (o en cualquier lugar o en el medio). M&aacute;s sobre este tema en el cap&iacute;tulo "toma panor&aacute;mica".</p>
<p>Por &uacute;ltimo, vamos a explorar un par de pesta&ntilde;as en el Administrador de Conexi&oacute;n de audio para ver el sonido que va desde el bus maestro a las salidas de hardware reales (sus altavoces o auriculares):</p>
<p><img src="http://brunoruviaro.github.io/ardour4-tutorial/images/Ardour4_Audio_Connection_Manager_3.png" alt="ACM 3" /></p>
<p>Como se puede ver, en el origen/sources seleccionado es ahora "Ardour buses" y la pesta&ntilde;a de destino es "hardware". En esta sesi&oacute;n se pasa a tener un &uacute;nico bus, el "maestro" que como dijimos es el seleccionado por defecto. Los puntos verdes muestran que todos los sonidos que salen del bus maestro van a la reproducci&oacute;n del sistema 1 y 2, que son las salidas de la tarjeta de sonido.</p>
<h3 id="how-to-connect-and-disconnect">&iquest;C&oacute;mo conectar y desconectar?</h3>
<p>Para realizar una conexi&oacute;n, haz clic en el cuadrado vac&iacute;o deseado que se encuentra en la matriz; un punto verde aparecer&aacute; para indicar que se realiz&oacute; la conexi&oacute;n.</p>
<p>Para deshacer una conexi&oacute;n, simplemente haz clic en un punto verde existente y este desaparecer&aacute;.</p>
<h3 id="practical-example-of-routing-to-a-bus">Ejemplo pr&aacute;ctico de enrutamiento a buses</h3>
<p>En la siguiente sesi&oacute;n de ejemplo, hay dos pistas de guitarra y un bus no utilizado que se llama Guitar-Bus, todo est&eacute;reo.</p>
<p><img src="http://brunoruviaro.github.io/ardour4-tutorial/images/Ardour4_Ardour_Connection_Manager_4.png" alt="ACM 4" />&nbsp;</p>
<p>Supongamos que deseas enviar la salida de las dos pistas de guitarra al Guitar Bus en lugar de enviar al Bus Master o Maestro. Esto&nbsp;puede ser &uacute;til para controlar el volumen de las dos guitarras con un solo Fader (en este caso el atenuador ser&aacute; el Guitar-Bus). A continuaci&oacute;n, la salida del Guitar-Bus, que es la suma de las dos guitarras, va directamente al maestro de bus.</p>
<p>En la imagen que tienes a continuaci&oacute;n se muestra el enrutamiento que se debe realizar para el caso expuesto anteriormente. Selecciona las "Pistas Ardour - Ardour Tracks" en las pesta&ntilde;as verticales donde est&aacute;n las fuentes de origen o Sources. Y elige "Ardour Buses" en los Destinos que se encuentran en las pesta&ntilde;as inferiores horizontales. Lo primero es deshacer con un clic las conexiones existentes que probablemente lleven las guitarras al Bus master. A continuaci&oacute;n, con un clic sobre los cuadros para que aparezcan las conexiones verdes, crea las conexiones entre las dos pistas de la guitarra (Guitar1 y Guitar2 out) con el Guitar-Bus. El resultado final ser&iacute;a el siguiente:</p>
<p><img src="http://brunoruviaro.github.io/ardour4-tutorial/images/Ardour4_Audio_Connection_Manager_5.png" alt="ACM 5" />&nbsp;</p>
<p>Ahora ambas pistas de guitarras est&aacute;n enrutadas al Guitar-Bus y ya no se conectan directamente al bus maestro. A continuaci&oacute;n, nos aseguramos de que el Guitar-Bus es, por su parte, encaminada al Bus Maestro (el direccionamiento de salida de un Bus se edita en la misma forma que para una pista), de modo que a&uacute;n podemos o&iacute;r el sonido de ambas pistas de guitarra . Y podemos controlar el volumen de ambas pistas juntas al cambiar el deslizador del Guitar-Bus. Lo que es m&aacute;s, ahora podemos a&ntilde;adir plugins para el Guitar - Bus para procesar el sonido de las dos pistas de guitarra juntos.</p>
<h3 id="track--or-bus-specific-views-of-the-patchbay">Vistas espec&iacute;ficas de Track o Bus en el panel de conexiones&nbsp;o Patchbay</h3>
<p>El Administrador de conexi&oacute;n de audio (patchbay) que se abre con "Alt" + "P" muestra la matriz completa de cada fuente de origen de sonido individual y cada destino individual disponible en Ardour. A veces esto es demasiado si lo que se desea es s&oacute;lo cambiar r&aacute;pidamente el encaminamiento de una sola entrada o salida de la pista. Ardour permite acceder a un subconjunto importante de conexiones cuando se hace clic directamente en el bot&oacute;n de entradas o salidas de una pista o bus en el mezclador.</p>
<p>El bot&oacute;n de entradas est&aacute; en la parte superior, y el bot&oacute;n de salidas es similar y se encuentra en la parte inferior del mezclador. Al hacer clic en cualquiera de los dos se mostrar&aacute; un men&uacute; de opciones de conexi&oacute;n. En la pantalla de abajo, por ejemplo, tendr&iacute;as que hacer clic en el bot&oacute;n "1/2" justo debajo del nombre de la pista "Guitarra-1" con el fin de acceder a este men&uacute;:</p>
<p><img src="http://brunoruviaro.github.io/ardour4-tutorial/images/Ardour4_Editor_Mixer_In_Out.png" alt="Editor Mixer In Out" /></p>
<p>Puedes seleccionar una conexi&oacute;n en ese mismo men&uacute;, o elije "Routing Grid" para ver una versi&oacute;n m&aacute;s sencilla del gestor de conexiones de audio que contiene s&oacute;lo las entradas o salidas de la pista o el bus seleccionado.</p>
<h3 id="all-ardour-connections-are-jack-connections">Todas las conexiones Ardour son conecciones JACK</h3>
<p>Es importante entender que cualquier ruta que se conecte o desconecte dentro de Ardour est&aacute; enrut&aacute;ndose en JACK, las cuales se pueden tambi&eacute;n ver desde otras aplicaciones como Qjackctl, Catia, o JackPilot, dependiendo de su sistema operativo. A continuaci&oacute;n se muestra un ejemplo de una ventana de Catia (s&oacute;lo GNU/Linux) que presenta las mismas conexiones JACK que vimos en el ejemplo anterior:</p>
<p><img src="http://brunoruviaro.github.io/ardour4-tutorial/images/Ardour4_Catia_Example.png" alt="Catia" /></p>
<p class="calibre2">&nbsp;</p>
<p class="calibre2">Para entender m&aacute;s sobre JACK y Catia y c&oacute;mo se pueden configurar recomendamos revisar el manual:&nbsp;<br /><a title="&quot;El poderoso e incomprendido JACK&quot;" href="http://liberaturadio.org/article/el-poderoso-e-incomprendido-jack/">"El poderoso e incomprendido JACK"</a>. &nbsp;</p>
<p class="calibre2">&nbsp;</p>
<p class="calibre2"><span style="font-size: 1.5em;">Continuar</span></p>
<p class="calibre2">En este cap&iacute;tulo, cubrimos c&oacute;mo gestionar el Enrutamiento dentro de Ardour, o entre Ardour y la tarjeta de sonido. Aun as&iacute;, uno de las fortalezas de utilizar el sistema JACK es que tambi&eacute;n pueda gestionar conexiones entre aplicaciones en el mismo ordenador. Para obtener un mejor entendimiento de c&oacute;mo funciona esto, por favor contin&uacute;a al cap&iacute;tulo <strong class="calibre3">Enrutamiento entre Aplicaciones</strong>. Si preferir&iacute;as trabajar s&oacute;lo con Ardour, entonces salta adelante hasta la secci&oacute;n <strong class="calibre3">Editar Sesiones</strong>.</p>
   
  </div>
 </div>


  </div>
</div>
<!-- End of content -->



<!-- sputnik error page -->
<div id="dialog-sputnik-qrac" style="display: none"></div>
<div id="dialog-sputnik-error" title="Can't communicate with booktype">
  <p>
    <span class="ui-icon ui-icon-circle-check" style="float:left; margin:0 7px 50px 0;"></span>
    There has been error in communication with Booktype server.
    Not sure right now where is the problem.
  </p>
  <p>
    You should refresh this page.
  </p>
</div>


<ul class="strings template">
 <li class="ok">OK</li>
 <li class="back">Back</li>
 <li class="create">Create</li>
 <li class="cancel">Cancel</li>
 <li class="next">Next</li>
 <li class="import">Import</li>
 <li class="savechanges">Save changes</li>
 <li class="errorcreategroup">Couldn't create a group!</li>
 <li class="msgepub">enter epub URL</li>
 <li class="msgarchive">enter Archive.org ID</li>
 <li class="msgwiki">enter Wikibooks URL</li>
 <li class="msgbooktype">enter Booktype URL</li>
 <li class="deletebook">Delete book</li>
</ul>

</body>
</html>

