
<!DOCTYPE HTML>
<html>
 <head>
   

<link type="text/css" href="/site_static/css/booki.css" rel="Stylesheet" >
<link type="text/css" href="/site_static/js/jquery/themes/base/jquery.ui.all.css" rel="Stylesheet" >
<link type="text/css" href="/site_static/js/jquery/themes/smoothness/jquery.ui.all.css" rel="Stylesheet" >
<script type="text/javascript" src="/site_static/js/jquery/jquery-1.4.4.js"></script>
<script type="text/javascript" src="/site_static/js/jquery/ui/jquery-ui-1.8.10.custom.js"></script>
<script type="text/javascript" src="/site_static/js/jquery.json-1.3.js"></script>
<script type="text/javascript" src="/site_static/js/booki.js"></script>
<script src="/site_static/js/messaging.js" type="text/javascript"></script>   
<script type="text/javascript" src="/site_static/js/general.js"></script>
<link href="/site_static/css/jquery.bubblepopup.v2.3.1.css" rel="stylesheet" type="text/css" />
<link type="text/css" href="/site_static/css/jquery-ui_overrides.css" rel="Stylesheet" >
<script src="/site_static/js/jquery.bubblepopup.v2.3.1.min.js" type="text/javascript"></script>

<link rel="SHORTCUT ICON" href="http://write.flossmanuals.net/site_static/images/favicon.ico" type="image/x-icon">
<meta property="og:site_name" content="FLOSS Manuals"/><meta name="description" content="Free Manuals for Freedom"/>

<script type="text/javascript">
  $(function() {
      $.booki.sputnikDispatcherURL = "/_sputnik/";

      $("#dialog-sputnik-error").dialog({
          modal: true,
          autoOpen: false,
          buttons: {
            Ok: function() {
               $(this).dialog('close');
               window.location = '.';
            }
          }
      });
  
      $("FORM.messagefield").messagefield('init', {'view_post': '/messaging/post' });  
  });
</script>


   
 <title>/chapter: Kayttoliittyma / Blender suomeksi</title>
 <link type="text/css" href="/site_static/css/draft.css" rel="Stylesheet" />

 <link rel="alternate" type="application/rss+xml" title="RSS feed for Blender suomeksi" href="/feeds/rss/book/blender-suomeksi/" /> 
 <link rel="alternate" type="application/atom+xml" title="Atom feed for Blender suomeksi" href="/feeds/atom/book/blender-suomeksi/" /> 

 <link rel="alternate" type="application/rss+xml" title="RSS feed for chapter KÄYTTÖLIITTYMÄ" href="/feeds/rss/chapter/blender-suomeksi/blender-suomeksi/" /> 
 <link rel="alternate" type="application/atom+xml" title="Atom feed for chapter KÄYTTÖLIITTYMÄ" href="/feeds/atom/chapter/blender-suomeksi/blender-suomeksi/" /> 
 
 <script type="text/javascript" src="/site_static/js/draft.js"></script>


   <link type="text/css" href="/static/css/_user.css" rel="Stylesheet" >
 </head>
<body>

<div class="topbar"> 
  <div class="logotext"><a href="http://write.flossmanuals.net/">FLOSS Manuals</a> </div>

  <div class="meta-bar">
    
    <ul>
      <li>
        <a href="/accounts/signin/?redirect=/blender-suomeksi/_draft/_v/1.0/kayttoliittyma/">Sign In / Create Account</a>
      </li>
    </ul>
    
    <div style="padding-top: 10px; padding-right: 15px;">
      <br/>
      

<script>
  $(function() {
    var $frm = $("FORM[name=changelang]");
	
    $("A[href=#]", $frm).click(function() {
        var lang = $(this).attr("class").substr(4);
	
        $("INPUT[name=language]", $frm).val(lang);
        $frm.submit();
	
        return false;
    });
  });
 </script>

<form name="changelang" method="POST" action="/accounts/i18n/setlang/?language=en-us">
  <input type="hidden" name="language" value="en-us">
  
    &nbsp;English&nbsp;|
  
  
  
    &nbsp;<a class="langes" href="#">Español</a>&nbsp;|
  

  
    &nbsp;<a class="langfr" href="#">Français</a>&nbsp;|
  
	
  
    &nbsp;<a class="langit" href="#">Italiano</a>&nbsp;|
  
	
  
    &nbsp;<a class="langpt" href="#">Português</a>&nbsp;|
  
	
  
    &nbsp;<a class="langru" href="#">Русский</a>&nbsp;|
  
	
  
    &nbsp;<a class="langsq" href="#">Shqip</a>
  	
</form>

    </div>
    
    
  </div><!-- End of .meta-bar -->
</div><!-- End top bar -->

<div class="menubar shadow">
  
  
  <div class="navbox">
    <ul>
      <li><a href="/list-books/">Books</a></li>
      <li><a href="/list-groups/">Groups</a></li>
      <li><a href="/list-people/">People</a></li>
    </ul>      
  </div><!-- End of .navbox -->       
</div>

<div class="content-container">
  <div class="content shadow">
    <!-- Content box and the drop shadow-->
    

<h2>Blender suomeksi</h2>
<div class="padded">
 <div id="bookmenu" style="background: url(/site_static/images/draft_bg.png) repeat !important;"> 
  <ul>
   
    
      <li><b>Johdanto</b></li>
    
   
    
      <li><a href="/blender-suomeksi/_draft/_v/1.0/johdanto/">JOHDANTO</a></li>
    
   
    
      <li><b>Asennus</b></li>
    
   
    
      <li><a href="/blender-suomeksi/_draft/_v/1.0/asennus-windowsiin/">ASENNUS WINDOWSIIN</a></li>
    
   
    
      <li><b>Käytännöt</b></li>
    
   
    
      <li><a href="/blender-suomeksi/_draft/_v/1.0/kaytannot/">KÄYTÄNNÖT</a></li>
    
   
    
      <li><b>Käyttöliittymä</b></li>
    
   
    
      <li><a href="/blender-suomeksi/_draft/_v/1.0/kayttoliittyma/">KÄYTTÖLIITTYMÄ</a></li>
    
   
    
      <li><b>Asetukset</b></li>
    
   
    
      <li><a href="/blender-suomeksi/_draft/_v/1.0/asetukset/">ASETUKSET</a></li>
    
   
    
      <li><b>Editointi</b></li>
    
   
    
      <li><a href="/blender-suomeksi/_draft/_v/1.0/editointi/">EDITOINTI</a></li>
    
   
    
      <li><a href="/blender-suomeksi/_draft/_v/1.0/esineen-luominen/">ESINEEN LUOMINEN</a></li>
    
   
    
      <li><b>Tekstuurit</b></li>
    
   
    
      <li><a href="/blender-suomeksi/_draft/_v/1.0/teksturointi/">TEKSTUROINTI</a></li>
    
   
    
      <li><b>Renderöinti</b></li>
    
   
    
      <li><a href="/blender-suomeksi/_draft/_v/1.0/renderointi/">RENDERÖINTI</a></li>
    
   
    
      <li><b>Tekijät</b></li>
    
   
    
      <li><a href="/blender-suomeksi/_draft/_v/1.0/tekijat/">TEKIJÄT</a></li>
    
   
  </ul>
 </div>
 <div id="bookcontent"   style="background: url(/site_static/images/draft_bg.png) repeat !important;">
   

  <h1><span style="font-size: 2em;">BLENDERIN K&Auml;YTT&Ouml;LIITTYM&Auml;</span></h1>
<p>Avattuasi Blenderin sen k&auml;ytt&ouml;liittym&auml; jakautuu oletusarvoisesti useampaan eri osaan. N&auml;it&auml; osia kutsutaan editointitiloiksi.</p>
<p><img src="static/ScreenHunter_54%20Apr.%2018%2013.16.gif" alt="" /></p>
<p>Ikkunan keskell&auml; on kolmiulotteinen n&auml;k&ouml;kulma kohtaukseesi (<strong>3D View</strong>).</p>
<p><img src="static/ScreenHunter_55%20Apr.%2018%2013.18.gif" alt="" /></p>
<p>T&auml;m&auml;n alapuolella on valikkopalkki, jossa on kolmiulotteisen n&auml;kym&auml;n nappulat.</p>
<p><img src="static/ScreenHunter_58%20Apr.%2018%2013.27.gif" alt="" /></p>
<p>Vasemmalla on objektitilan ty&ouml;kalujen valikko.</p>
<p><img src="static/ScreenHunter_60%20Apr.%2018%2013.29.gif" alt="" /></p>
<p>Ikkunan yl&auml;osassa on infotilan (<strong>Info</strong>) valikko, jossa voit esimerkiksi avata ja tallentaa tiedostoja.</p>
<p><img src="static/ScreenHunter_61%20Apr.%2018%2013.31.gif" alt="" width="600" height="34" /></p>
<p>Ruudun alaosassa on aikajana (<strong>Timeline</strong>), jota tarvitset l&auml;hinn&auml; tehdess&auml;si animoituja kohtauksia. Liikkumattomiin kuviin sit&auml; ei tarvita.</p>
<p><img src="static/ScreenHunter_62%20Apr.%2018%2013.32.gif" alt="" /></p>
<p>&nbsp;</p>
<p>Ikkunan oikeassa yl&auml;osassa on kohtauksen yleiskuva (<strong>Outliner</strong>), jossa voit valita eri osia kohtauksestasi, kuten render&ouml;intitasot (<strong>RenderLayers</strong>), maailman (<strong>World</strong>), lampun (<strong>Lamp</strong>), kuution (<strong>Cube</strong>) ja kameran (<strong>Camera</strong>).</p>
<p><img src="static/ScreenHunter_63%20Apr.%2018%2013.36.gif" alt="" /></p>
<p>T&auml;m&auml;n alla on ominaisuudet (<strong>Properties</strong>), jossa voit muuttaa valittuna olevan kohteen ominaisuuksia.</p>
<p><img src="static/ScreenHunter_64%20Apr.%2018%2013.39.gif" alt="" /></p>
<p>Jokaisessa ikkunassa voit siirty&auml; editointitilasta toiseen valikon avulla.</p>
<p><img src="static/ScreenHunter_51%20Apr.%2018%2013.10.gif" alt="" /></p>
<p>Kun valitset t&auml;st&auml; valikosta ikkunatyypin, nykyinen osaikkuna vaihtaa tyyppi&auml;. Esimerkiksi videosekvenssieditorin (<strong>Video Sequence Editor</strong>) napsauttaminen muuttaa ikkunan kolmiulotteisesta kuvaikkunasta ikkunaksi, jossa videoraitoja voi j&auml;rjestell&auml; aikaj&auml;rjestykseen.</p>
<h2>K&auml;ytt&ouml;liittym&auml;n t&auml;rkeit&auml; osia</h2>
<p>Nyt k&auml;ymme l&auml;pi joitain t&auml;rkeit&auml; osia k&auml;ytt&ouml;liittym&auml;st&auml;, jotka on hyv&auml; tuntea jo t&auml;ss&auml; vaiheessa.</p>
<h3>N&auml;kymien akselit</h3>
<p><img src="static/ScreenHunter_65%20Apr.%2018%2013.42.gif" alt="" /></p>
<p>Yll&auml; n&auml;kyv&auml;t kuvaikkunan akselit ovat n&auml;kym&auml;st&auml;, joka on perspektiivitilassa. Huomaa, ett&auml; nuoliakseleita on kolme eik&auml; vain kaksi. N&auml;emme kolme esineen ulottuvuutta, kun k&auml;yt&auml;mme t&auml;t&auml; n&auml;kym&auml;&auml;. Sen sijaan katsoessamme n&auml;kym&auml;&auml; edest&auml; (<strong>Front</strong>), ylh&auml;&auml;lt&auml; (<strong>Top</strong>) tai oikealta (<strong>Right</strong>) n&auml;emme vain kaksi ulottuvuutta.</p>
<p>Toisenlainen n&auml;kym&auml; Blenderiss&auml; on ortograafinen n&auml;kym&auml;, joka ei ole yht&auml; luonnollinen silmillemme (esineet eiv&auml;t muutu t&auml;ss&auml; n&auml;kym&auml;ss&auml; pienemmiksi ollessaan kauempana), mutta se on matemaattisesti oikeampi. Akselit jokaisen kuvaikkunan alaosassa tunnetaan globaaliakseleina, toisin sanoen ne sopivat koko n&auml;kym&auml;&auml;n ja kaikkeen siin&auml; olevaan. Niit&auml; ei voida muuttaa, samaan tapaan kuin it&auml; ja l&auml;nsi eiv&auml;t muuta suuntaa tosimaailmassa.</p>
<h3>Objektin nimi</h3>
<p><img src="static/ScreenHunter_66%20Apr.%2018%2013.45.gif" alt="" /></p>
<p>Kolmiulotteisen n&auml;kym&auml;n vasemmassa alakulmassa n&auml;kyy valittuna olevan objektin nimi.&nbsp; Objektin nimen nopea l&ouml;yt&auml;minen ja jopa uudelleennime&auml;minen tulee t&auml;rke&auml;ksi, kun kohtaustesi monimutkaisuus kasvaa.</p>
<h3>N&auml;kym&auml;n varjostuksen tyyppi</h3>
<h3><img src="static/ScreenHunter_67%20Apr.%2018%2013.48.gif" alt="" /></h3>
<p>N&auml;kym&auml;n varjostus (<strong>Viewport Shading</strong>) -nappulaa napsauttamalla ilmestyy pudotusvalikko, joka antaa meid&auml;n muuttaa tapaa, jolla objekti piirret&auml;&auml;n kuvaikkunassa. Yleens&auml; k&auml;ytetyt piirtotyypit ovat kiinte&auml; (<strong>Solid</strong>) ja rautalankamalli (<strong>Wireframe</strong>). Voit siirty&auml; nopeasti n&auml;iden kahden piirtotavan v&auml;lill&auml; Z-n&auml;pp&auml;imell&auml;.</p>
<p>Huomaa, ett&auml; t&auml;m&auml; ei vaikuta lainkaan muodon render&ouml;intiin elokuvaa tai kuvaa tehdess&auml;. N&auml;m&auml; ovat vain piirtotiloja, jotka auttavat sinua n&auml;kem&auml;&auml;n muotosi paremmin. Rautalankamalli on hy&ouml;dyllinen, koska se auttaa sinua n&auml;kem&auml;&auml;n verkkosi l&auml;pi, jolloin voit valita siit&auml; osia, jotka eiv&auml;t ole tarjolla l&auml;pin&auml;kym&auml;tt&ouml;m&auml;ss&auml; kiinte&auml;ss&auml; tilassa.</p>
<p>Teksturoidussa (<strong>Textured</strong>) piirtotyypiss&auml; n&auml;et objektin tekstuurin. Teksturointia k&auml;sitell&auml;&auml;n my&ouml;hemmin t&auml;ss&auml; oppaassa.</p>
<h3>Manipulaattoritilat</h3>
<h3><img src="static/ScreenHunter_68%20Apr.%2018%2013.51.gif" alt="" /></h3>
<p>Valitsemalla manipulaattorin tilan (<strong>Manipulator Mode</strong>), kuten rotaation (valikossa kaari) ja sen j&auml;lkeen valitsemalla akselin, voidaan valittua objektia kierr&auml;tt&auml;&auml; sen akselin ymp&auml;rill&auml; kuin py&ouml;r&auml;&auml; akselissa.</p>
<p>Vastaavasti, valitsemalla k&auml;&auml;nn&ouml;smanipulaattorin (valikossa nuoli), voimme napsauttaa akselia ja vet&auml;&auml; nykyist&auml; valintaa sit&auml; pitkin, aivan kuin se olisi raide. Kolmiulotteisessa terminologiassa "k&auml;&auml;nn&ouml;s" merkitsee "liikkumista tilan l&auml;pi". T&auml;m&auml; on usein h&auml;mment&auml;v&auml;&auml;, mutta k&auml;&auml;nn&ouml;ksell&auml; t&auml;ss&auml; mieless&auml; ei ole mit&auml;&auml;n tekemist&auml; kielen kanssa.</p>
<p>J&auml;ljelle j&auml;&auml;nyt usein k&auml;ytetty manipulaattori on skaala-manipulaattori (valikossa neli&ouml;&ouml;n p&auml;&auml;ttyv&auml; viiva). T&auml;m&auml; on hy&ouml;dyllinen, jos tahdot nopeasti (mutta ep&auml;tarkasti) skaalata muotoa yht&auml; tai kahta akselia pitkin, eli tehd&auml; ep&auml;yhdenmukaisen skaalauksen.</p>
<h3>Objekti</h3>
<h3><img src="static/ScreenHunter_70%20Apr.%2018%2014.01.gif" alt="" /></h3>
<p>T&auml;ss&auml; on kuutio, muokkaustilassa, n&auml;htyn&auml; perspektiivin&auml;kym&auml;ss&auml;, kolmiulotteisen k&auml;&auml;nn&ouml;ksen manipulaattori p&auml;&auml;ll&auml; ja yksi verteksi valittuna.</p>
<p>T&auml;rke&auml;&auml; on huomata akselit suoraan verteksin p&auml;&auml;ll&auml;. N&auml;m&auml; akselit, vaikkakin "peilaavat" n&auml;k&ouml;ikkunan akseleiden suuntia t&auml;ss&auml; tapauksessa, ovat itse asiassa paikallisia akseleita, eiv&auml;t globaaleja akseleita.</p>
<p>T&auml;ss&auml; tapauksessa ne n&auml;ytt&auml;v&auml;t meille valitsemamme verteksin sijainnin; yhden pisteen kolmiulotteisessa avaruudessa. Yksinkertaisesti sanottuna, jokaisella objektilla - jopa objektien osalla - on oma sijaintinsa ja n&auml;m&auml; sijainnit ovat aina suhteessa maailman pysyviin suuntiin.</p>
<p>T&auml;m&auml; on t&auml;rke&auml;&auml; ymm&auml;rt&auml;&auml;, sill&auml; ero paikallisten ja globaalien akselien v&auml;lill&auml; p&auml;tee kaikkeen geometriaan ja kaikkiin kolmiulotteisiin ohjelmistopaketteihin.</p>
<h2>K&auml;ytt&ouml;liittym&auml;n kaksi ydintilaa</h2>
<p>Yksi parhaista tavoista l&auml;hesty&auml; Blenderi&auml; ensimm&auml;ist&auml; kertaa on sen tilojen k&auml;sittely. Kun vaihdat tilaa, k&auml;ytt&ouml;liittym&auml; muuttuu tilan mukana, ei vain se mit&auml; n&auml;et (hakemistot ja taideteoksesi ulkon&auml;k&ouml;), vaan my&ouml;s k&auml;yt&ouml;ss&auml;si olevat n&auml;pp&auml;inyhdistelm&auml;t.</p>
<p>Jokaisen kolmiulotteisen kuvaikkunan alaosassa on valikko, josta voimme vaihtaa editointiin liittyvi&auml; tiloja. Se n&auml;ytt&auml;&auml; t&auml;lt&auml;:&nbsp;</p>
<p class="c3"><img src="static/ScreenHunter_71%20Apr.%2018%2014.03.gif" alt="" /></p>
<p>N&auml;ist&auml; tiloista kahta k&auml;yt&auml;t paljon: objektitilaa (<strong>Object Mode</strong>) ja editointitilaa (<strong>Edit Mode</strong>). Kumpikin n&auml;ist&auml; tiloista tekee hieman erilaisia asioita.&nbsp;</p>
<h2>Editointitila</h2>
<p>Editointitilaa k&auml;ytet&auml;&auml;n objektin muodon muovaamiseen, sis&auml;lt&auml;en muotoon liittyv&auml;t ominaisuudet. Esimerkkej&auml; t&auml;st&auml; olisivat objektin leikkaaminen kahtia, sen v&auml;&auml;nt&auml;minen kumin tavoin, tai yksityiskohtien lis&auml;&auml;minen kokonaismuodon osaan. Kun tahdot muotoilla objektin uudelleen, manipuloiden sen muotoa, k&auml;yt&auml; editointitilaa.</p>
<p>T&auml;lt&auml; editointitila n&auml;ytt&auml;&auml;. Voit n&auml;hd&auml;, kuinka kolmiulotteinen muoto kuvaikkunassa (jota t&auml;ss&auml; kutsutaan verkoksi), n&auml;ytt&auml;&auml; l&auml;pin&auml;kyv&auml;lt&auml; ja siin&auml; on pisteit&auml; joka nurkassa. N&auml;it&auml; pisteit&auml; sanotaan solmuiksi, niit&auml; yhdist&auml;vi&auml; viivoja sanotaan reunoiksi, ja litteit&auml; kolmen tai useamman solmun muodostamia pintoja kutsutaan tahkoiksi, jotka tunnetaan yleisesti my&ouml;s polygoneina. Nyt valittu elementti t&auml;ss&auml; kuvassa on yksitt&auml;inen solmu, mutta se voisi yht&auml; hyvin olla reuna, tahko tai monta n&auml;ist&auml; samaan aikaan.</p>
<div class="c2">
<p>&nbsp;</p>
<h3><img src="static/ScreenHunter_70%20Apr.%2018%2014.01.gif" alt="" /></h3>
<p>&nbsp;</p>
<h2>Objektitila</h2>
<p>Objektitilassa k&auml;sitell&auml;&auml;n vain objektiin itseens&auml; liittyvi&auml; ominaisuuksia, kuten sen nime&auml;, sen sijaintia, sen kokoa ja sen suhdetta muihin objekteihin (kuten objekteihin, jotka ovat sen vanhempia tai lapsia). Jos tahdot koskaan siirt&auml;&auml; objektia, lis&auml;t&auml; uuden objektin, nimet&auml; objektin uudelleen tai muuttaa muita sen "objektiuteen" liittyvi&auml; ominaisuuksia, k&auml;yt&auml; objektitilaa. T&auml;lt&auml; kuvaikkuna n&auml;ytt&auml;&auml; t&auml;ss&auml; tilassa.</p>
<p><img src="static/ScreenHunter_72%20Apr.%2018%2014.05.gif" alt="" /></p>
<p>Miksi v&auml;rilliset akselit ovat kiinnitettyj&auml; pisteeseen verkon keskell&auml;? T&auml;m&auml; johtuu siit&auml;, ett&auml; koko objekti on valittu, joten ne ovat objektin keskipisteess&auml;.&nbsp;</p>
</div>
<div class="c2">
<p>Nopein tapa liikkua n&auml;iden kohteiden v&auml;lill&auml; on <strong>TAB</strong>-n&auml;pp&auml;in. Sen painaminen siirt&auml;&auml; yksinkertaisesti tilasta toiseen. Laita kursorisi kuvaikkunan p&auml;&auml;lle (n&auml;in kerromme Blenderille mit&auml; kuvaikkunaa tulisi k&auml;ytt&auml;&auml;) ja yrit&auml; painaa <strong>TAB </strong>pari kertaa. Huomaa, kuinka monet muutkin asiat muuttuvat k&auml;ytt&ouml;liittym&auml;ss&auml;. Koko pohjalla oleva n&auml;pp&auml;inpaneeli muuttuu my&ouml;s.</p>
<p>Ei kuitenkaan editoida viel&auml; mit&auml;&auml;n, vaan totutellaan hiiren k&auml;ytt&ouml;&ouml;n Blenderiss&auml;...</p>
</div>
<h2 class="c5">Hiiren k&auml;ytt&ouml;</h2>
<p>Kuten johdannossa mainittiin, Blenderiss&auml; k&auml;ytet&auml;&auml;n kolmea hiiren nappia siten, ett&auml; hiiren py&ouml;r&auml; muutetaan napiksi.</p>
<p>Opetellaanpa ensin k&auml;ytt&auml;m&auml;&auml;n kierityst&auml;, joka on eritt&auml;in keskeinen liikuttaessa kolmiulotteisessa maisemassa.</p>
<blockquote>
<h3>Kieritys</h3>
</blockquote>
<div class="c7">
<blockquote>
<p>Aseta kursori kuvaikkunan p&auml;&auml;lle ja paina <strong>KHN</strong>, kunnes tunnet sen naksahtavan ja ved&auml; hiirt&auml; ymp&auml;riins&auml;. N&auml;et objektin k&auml;&auml;ntyv&auml;n kuvaikkunassa. Itse asiassa objekti ei py&ouml;ri, vaan n&auml;k&ouml;kulma, aivan kuin kamera kiert&auml;isi objektin ymp&auml;rill&auml;. Voi tuntua ep&auml;tavalliselta k&auml;ytt&auml;&auml; hiiren py&ouml;r&auml;&auml; nappina, mutta se on tehokasta, kun totut siihen.</p>
<h3>Panorointi</h3>
<p>Panorointi merkitsee, ett&auml; otat esineen kuvaan ja vierit&auml;t tuota kuvaa, oikealta vasemmalle tai vasemmalta oikealle. Sinun suuntasi objektiin n&auml;hden ei kuitenkaan muutu t&auml;m&auml;n prosessin aikana. T&auml;m&auml; on todella k&auml;tev&auml;&auml; tapa liikkua ymp&auml;ri kohtaustasi.</p>
<p>Panoroidaksesi paina <strong>SHIFT+KHN</strong> ja ved&auml; hiirt&auml;si ymp&auml;riins&auml;. N&auml;et objektin liikkuvan siihen suuntaan, johon ved&auml;t hiirt&auml;.</p>
<h3>Zoomaus</h3>
<p>Zoomaus toimii samoin kuin kameraa k&auml;ytt&auml;ess&auml;si. Kuvan suunta on pysyv&auml;, mutta voit siirt&auml;&auml; n&auml;k&ouml;kulmaa l&auml;hemm&auml;s tai kauemmas esineest&auml;. Voit zoomata k&auml;ytt&auml;en vain py&ouml;r&auml;&auml; aivan kuin normaalisti, mutta jos tahdot todella pehme&auml;n zoomin, yrit&auml; <strong>CTRL+KHN</strong> ja ved&auml; hiirt&auml;si yl&ouml;s ja alas. Hidas zoomaus antaa sinulle paljon paremman kontrollin zoomauset&auml;isyyden suhteen ja siihen kannattaa totutella.</p>
</blockquote>
</div>
<div class="c7">
<h2>Valinta ja siirt&auml;minen</h2>
<p>&nbsp;</p>
</div>
<div class="c7">Yritet&auml;&auml;np&auml; siirt&auml;&auml; kuutiotamme hieman, jotta totumme hiiren ja n&auml;pp&auml;imist&ouml;n k&auml;ytt&auml;miseen yhdess&auml;.</div>
<p class="c4">Kohtauksessasi on t&auml;ll&auml; hetkell&auml; kamera, valo ja kuutio. Kamera on pyramidin muotoinen esine ja valo on viiva, jonka huipulla on ympyr&auml;.&nbsp;</p>
<p>Zoomaa ulos, kunnes n&auml;et kuutiosi kokonaan vasemmalla olevassa kolmiulotteisessa kuvaikkunassa. Varmista objektin ymp&auml;rill&auml; olevan tarpeeksi tilaa. Varmista olevasi objektitilassa. Kuution ymp&auml;rill&auml; pit&auml;isi olla oranssi ymp&auml;rysviiva, kuten yll&auml; olevassa kuvassa. Kun objekti on vaaleanpunainen, se on valittu.</p>
<p>Paina <strong>A-n&auml;pp&auml;int&auml;</strong> kerran ja toisen kerran. Huomaa, kuinka objektin reuna muuttuu oranssiksi ja toisella painalluksella oranssi reuna katoaa. <strong>A-n&auml;pp&auml;in</strong> on oikotie kaiken valitsemiseen ja ei mink&auml;&auml;n valitsemiseen.&nbsp;</p>
<p>Varmista, ett&auml; mit&auml;&auml;n ei ole valittu ja klikkaa kerran <strong>OHN </strong>kuution p&auml;&auml;ll&auml;. T&auml;m&auml;n j&auml;lkeen, kun hiiresi kursori on yh&auml; kuvaikkunan p&auml;&auml;ll&auml;, paina kerran <strong>G-n&auml;pp&auml;int&auml;</strong> ja siirr&auml; hiirt&auml;si ymp&auml;riins&auml;. Objekti seuraa hiirt&auml;. "G"<strong> G-n&auml;pp&auml;imess&auml;</strong> merkitsee "<strong>Grab</strong>" (nappaa). Kun painat t&auml;t&auml; n&auml;pp&auml;int&auml;, k&auml;sket Blenderin lukita nyt valittu objekti hiiren kursoriin. Paina nyt <strong>ESC </strong>tai paina uudestaan <strong>OHN</strong>, objekti palaa takaisin alkuper&auml;iseen sijaintiinsa.&nbsp;</p>
<p>Tehd&auml;&auml;np&auml; t&auml;m&auml; uudestaan, mutta t&auml;ll&auml; kertaa siirret&auml;&auml;n objektia ja annetaan sille uusi sijainti. Tehd&auml;ksesi n&auml;in, toista yll&auml; mainitut askeleet objektin nappaamiseksi, mutta sen sijaan ett&auml; napsauttaisit <strong>OHN </strong>lopuksi, napsauta <strong>VHN</strong>. T&auml;m&auml; kertoo Blenderille: "laita objekti t&auml;h&auml;n ja j&auml;t&auml; se t&auml;h&auml;n."&nbsp;</p>
<p>Voit k&auml;ytt&auml;&auml; my&ouml;s <strong>kursorin&auml;pp&auml;imi&auml; </strong>nappaustilassa hiiren sijasta. Laittaaksesi objektin sinne, minne tahdot sen, paina <strong>rivinvaihton&auml;pp&auml;int&auml;</strong>. Jotkut teist&auml; ovat tutustuneet aiemmin napsahduksen k&auml;sitteeseen, mik&auml; merkitsee objektin siirt&auml;mist&auml; ruudukolla oleviin yksik&ouml;ihin, yksi kerrallaan. T&auml;t&auml; k&auml;ytt&auml;v&auml;t usein ihmiset, jotka tarvitsevat hyvin tarkkoja tuloksia. Siirt&auml;&auml;ksesi objektia ja saadaksesi sen napsahtamaan verkon yksik&ouml;ihin, pitele <strong>CTRL </strong>alhaalla siirt&auml;ess&auml;si objektia. T&auml;m&auml; toimii my&ouml;s loistavasti <strong>kursorin&auml;pp&auml;inten </strong>avulla.</p>
<p>Pid&auml; hiiresi kohdistinta nyt ylh&auml;&auml;lt&auml;-perspektiivist&auml; (<strong>View </strong>&gt; <strong>Top</strong>) kuvatun kuvaikkunan p&auml;&auml;ll&auml;. Paina <strong>VHN</strong> kerran t&auml;ss&auml; kohtauksessa olevan kuution vieress&auml;. Huomaa pieni punainen ympyr&auml;, joka seuraa hiiren klikkausta. Klikkaile ymp&auml;riins&auml;, se seuraa. Se n&auml;ytt&auml;&auml; t&auml;lt&auml;. Voit koska tahansa keskitt&auml;&auml; kolmiulotteisen kursorin painamalla<strong> SHFT+C</strong>-n&auml;pp&auml;int&auml;. Kolmiulotteinen kursori m&auml;&auml;rittelee, mihin uudet objektit lis&auml;t&auml;&auml;n. Sen keskitt&auml;minen sijoittaa sen paikkaan x=0, y=0, z=0.</p>
<div class="c2"><img src="static/ScreenHunter_73%20Apr.%2018%2014.15.gif" alt="" /></div>
<p class="c4">T&auml;m&auml; on t&auml;rke&auml; ty&ouml;kalu, joka tunnetaan kolmiulotteisena kohdistimena. Miss&auml; t&auml;m&auml; kohdistin onkin ruudulla, sinne uudet objektit ilmestyv&auml;t.</p>
<h2 class="c5">Uusien objektien lis&auml;&auml;minen</h2>
<p class="c4">Blender tarjoaa joukon perusobjekteja (joita kutsutaan usein primitiiveiksi). Voimme muokata niit&auml; mallinnuksen kuluessa. Vaikka on varmasti mahdollista tehd&auml; malli tyhj&auml;st&auml; (luoda kolme solmua ja tehd&auml; niist&auml; polygoni) on usein hy&ouml;dyllisemp&auml;&auml; aloittaa objektilla, jossa on ominaisuuksia, joita tarvitsemme rakentaaksemme nopeasti mallimme. Jos olet tekem&auml;ss&auml; tuolia, aloitat luultavasti kuutiolla tai tasolla, jotka ovat primitiivej&auml;. Jos olet mallintamassa p&auml;&auml;ryn&auml;&auml; tai kissan p&auml;&auml;t&auml;, sinun on paras aloittaa palloprimitiivill&auml;.</p>
<p class="c4">Siirr&auml; kolmiulotteinen kohdistin paikkaan, joka on vasemmalla nykyisest&auml; kuutiosta ylh&auml;&auml;lt&auml; katsottuna.</p>
<p class="c4">Tarkasta taas, ett&auml; olet objektitilassa ja hiiren kursori on kuvaikkunassa, jonka n&auml;k&ouml;kulma on ylh&auml;&auml;lt&auml;. Liikuta hiirt&auml; valikon vaihtoehtojen <strong>Add -&gt; Mesh -&gt; Cube</strong> (Lis&auml;&auml; -&gt; Verkko -&gt; Kuutio) yli. Paina nyt <strong>VHN</strong>.</p>
<p class="c4"><img src="static/ScreenHunter_75%20Apr.%2018%2014.19.gif" alt="" /></p>
<p>Sinulla pit&auml;isi olla nyt kaksi kuutiota kohtauksessasi.</p>
<p><img src="static/ScreenHunter_77%20Apr.%2018%2014.22.gif" alt="" /></p>
<p>Huomaa kuitenkin, ett&auml; kuutio, jonka juuri lis&auml;sit, on editointitilassa. Se ei vastaa kuten toinen kuutio ja emme voi siirt&auml;&auml; sit&auml; turvallisesti sen nykyisess&auml; tilassa, voimme vain muokata verkkoa itse&auml;&auml;n. Siirt&auml;&auml;ksemme sit&auml; turvallisesti, mene objektitilaan k&auml;ytt&auml;m&auml;ll&auml; joko itse tilanappulaa kuvaikkunan alaosassa, tai painamalla <strong>TAB</strong>-n&auml;pp&auml;int&auml;.</p>
<p>Huomaa: et voi muokata useamman kuin yhden objektin verkkoa samaan aikaan. Objektin verkkodataa voi muokata vain yksi objekti kerrallaan.</p>
<h2 class="c5">Yksitt&auml;isten objektien valinta</h2>
<p class="c4">Jokainen objekti sis&auml;lt&auml;&auml; oman datansa. Objektin data sis&auml;lt&auml;&auml; sen nimen, sen verkon, sen editointihistorian, sen sijainnin, sen tekstuurit ja enemm&auml;nkin. On t&auml;rke&auml;&auml; muistaa, ett&auml; objektin verkko on vain osa sen objektin dataa. Kun siirr&auml;t verkkoa ymp&auml;riins&auml;, et liikuta objektia ymp&auml;riins&auml;. Vastaavasti, voit tuhota kaiken verkkodatan objektista, mutta objekti on edelleenkin olemassa. Sill&auml; ei vain ole verkkoa.</p>
<p>Kun olet objektitilassa, napsauta <strong>VHN </strong>valitaksesi toisen kahdesta objektista. Paina nyt <strong>G-n&auml;pp&auml;int&auml;</strong>, kuten teit aiemminkin, ja siirr&auml; sit&auml; ymp&auml;riins&auml;. Kuten n&auml;et, objektit t&auml;ytyy valita, ennen kuin niit&auml; voi manipuloida. Huomaa my&ouml;s: kun siirr&auml;t objekteja ymp&auml;riins&auml; ylh&auml;&auml;lt&auml; tai edest&auml; n&auml;k&ouml;kulmissa, ne siirtyv&auml;t samaan aikaan perspektiivin&auml;k&ouml;kulmassa.</p>
<p>Leiki t&auml;ll&auml; v&auml;h&auml;n aikaa, seuraavaksi tarkastelemme editointia eri tekniikoita k&auml;ytt&auml;en.</p>
   
  </div>
 </div>


  </div>
</div>
<!-- End of content -->



<!-- sputnik error page -->
<div id="dialog-sputnik-qrac" style="display: none"></div>
<div id="dialog-sputnik-error" title="Can't communicate with booktype">
  <p>
    <span class="ui-icon ui-icon-circle-check" style="float:left; margin:0 7px 50px 0;"></span>
    There has been error in communication with Booktype server.
    Not sure right now where is the problem.
  </p>
  <p>
    You should refresh this page.
  </p>
</div>


<ul class="strings template">
 <li class="ok">OK</li>
 <li class="back">Back</li>
 <li class="create">Create</li>
 <li class="cancel">Cancel</li>
 <li class="next">Next</li>
 <li class="import">Import</li>
 <li class="savechanges">Save changes</li>
 <li class="errorcreategroup">Couldn't create a group!</li>
 <li class="msgepub">enter epub URL</li>
 <li class="msgarchive">enter Archive.org ID</li>
 <li class="msgwiki">enter Wikibooks URL</li>
 <li class="msgbooktype">enter Booktype URL</li>
 <li class="deletebook">Delete book</li>
</ul>

</body>
</html>

