
<!DOCTYPE HTML>
<html>
 <head>
   

<link type="text/css" href="/site_static/css/booki.css" rel="Stylesheet" >
<link type="text/css" href="/site_static/js/jquery/themes/base/jquery.ui.all.css" rel="Stylesheet" >
<link type="text/css" href="/site_static/js/jquery/themes/smoothness/jquery.ui.all.css" rel="Stylesheet" >
<script type="text/javascript" src="/site_static/js/jquery/jquery-1.4.4.js"></script>
<script type="text/javascript" src="/site_static/js/jquery/ui/jquery-ui-1.8.10.custom.js"></script>
<script type="text/javascript" src="/site_static/js/jquery.json-1.3.js"></script>
<script type="text/javascript" src="/site_static/js/booki.js"></script>
<script src="/site_static/js/messaging.js" type="text/javascript"></script>   
<script type="text/javascript" src="/site_static/js/general.js"></script>
<link href="/site_static/css/jquery.bubblepopup.v2.3.1.css" rel="stylesheet" type="text/css" />
<link type="text/css" href="/site_static/css/jquery-ui_overrides.css" rel="Stylesheet" >
<script src="/site_static/js/jquery.bubblepopup.v2.3.1.min.js" type="text/javascript"></script>

<link rel="SHORTCUT ICON" href="http://write.flossmanuals.net/site_static/images/favicon.ico" type="image/x-icon">
<meta property="og:site_name" content="FLOSS Manuals"/><meta name="description" content="Free Manuals for Freedom"/>

<script type="text/javascript">
  $(function() {
      $.booki.sputnikDispatcherURL = "/_sputnik/";

      $("#dialog-sputnik-error").dialog({
          modal: true,
          autoOpen: false,
          buttons: {
            Ok: function() {
               $(this).dialog('close');
               window.location = '.';
            }
          }
      });
  
      $("FORM.messagefield").messagefield('init', {'view_post': '/messaging/post' });  
  });
</script>


   
 <title>/chapter: Avoimet-Lisenssit-Ja-Vapaat-Sisallot / Avoin mediatuotanto</title>
 <link type="text/css" href="/site_static/css/draft.css" rel="Stylesheet" />

 <link rel="alternate" type="application/rss+xml" title="RSS feed for Avoin mediatuotanto" href="/feeds/rss/book/avoin-mediatuotanto/" /> 
 <link rel="alternate" type="application/atom+xml" title="Atom feed for Avoin mediatuotanto" href="/feeds/atom/book/avoin-mediatuotanto/" /> 

 <link rel="alternate" type="application/rss+xml" title="RSS feed for chapter AVOIMET LISENSSIT JA VAPAAT SISÄLLÖT" href="/feeds/rss/chapter/avoin-mediatuotanto/avoin-mediatuotanto/" /> 
 <link rel="alternate" type="application/atom+xml" title="Atom feed for chapter AVOIMET LISENSSIT JA VAPAAT SISÄLLÖT" href="/feeds/atom/chapter/avoin-mediatuotanto/avoin-mediatuotanto/" /> 
 
 <script type="text/javascript" src="/site_static/js/draft.js"></script>


   <link type="text/css" href="/static/css/_user.css" rel="Stylesheet" >
 </head>
<body>

<div class="topbar"> 
  <div class="logotext"><a href="http://write.flossmanuals.net/">FLOSS Manuals</a> </div>

  <div class="meta-bar">
    
    <ul>
      <li>
        <a href="/accounts/signin/?redirect=/avoin-mediatuotanto/_draft/_v/1.0/avoimet-lisenssit-ja-vapaat-sisallot/">Sign In / Create Account</a>
      </li>
    </ul>
    
    <div style="padding-top: 10px; padding-right: 15px;">
      <br/>
      

<script>
  $(function() {
    var $frm = $("FORM[name=changelang]");
	
    $("A[href=#]", $frm).click(function() {
        var lang = $(this).attr("class").substr(4);
	
        $("INPUT[name=language]", $frm).val(lang);
        $frm.submit();
	
        return false;
    });
  });
 </script>

<form name="changelang" method="POST" action="/accounts/i18n/setlang/?language=en-us">
  <input type="hidden" name="language" value="en-us">
  
    &nbsp;English&nbsp;|
  
  
  
    &nbsp;<a class="langes" href="#">Español</a>&nbsp;|
  

  
    &nbsp;<a class="langfr" href="#">Français</a>&nbsp;|
  
	
  
    &nbsp;<a class="langit" href="#">Italiano</a>&nbsp;|
  
	
  
    &nbsp;<a class="langpt" href="#">Português</a>&nbsp;|
  
	
  
    &nbsp;<a class="langru" href="#">Русский</a>&nbsp;|
  
	
  
    &nbsp;<a class="langsq" href="#">Shqip</a>
  	
</form>

    </div>
    
    
  </div><!-- End of .meta-bar -->
</div><!-- End top bar -->

<div class="menubar shadow">
  
  
  <div class="navbox">
    <ul>
      <li><a href="/list-books/">Books</a></li>
      <li><a href="/list-groups/">Groups</a></li>
      <li><a href="/list-people/">People</a></li>
    </ul>      
  </div><!-- End of .navbox -->       
</div>

<div class="content-container">
  <div class="content shadow">
    <!-- Content box and the drop shadow-->
    

<h2>Avoin mediatuotanto</h2>
<div class="padded">
 <div id="bookmenu" style="background: url(/site_static/images/draft_bg.png) repeat !important;"> 
  <ul>
   
    
      <li><b>Johdanto</b></li>
    
   
    
      <li><a href="/avoin-mediatuotanto/_draft/_v/1.0/aluksi/">ALUKSI</a></li>
    
   
    
      <li><b>Yhteisömedian maisema</b></li>
    
   
    
      <li><a href="/avoin-mediatuotanto/_draft/_v/1.0/verkko-ja-yhteisomedia/">VERKKO- JA YHTEISÖMEDIA</a></li>
    
   
    
      <li><a href="/avoin-mediatuotanto/_draft/_v/1.0/kevyt-tuotantotapa/">KEVYT TUOTANTOTAPA</a></li>
    
   
    
      <li><a href="/avoin-mediatuotanto/_draft/_v/1.0/avoimen-lahdekoodin-ohjelmistot/">AVOIMEN LÄHDEKOODIN OHJELMISTOT</a></li>
    
   
    
      <li><a href="/avoin-mediatuotanto/_draft/_v/1.0/avoimet-lisenssit-ja-vapaat-sisallot/">AVOIMET LISENSSIT JA VAPAAT SISÄLLÖT</a></li>
    
   
    
      <li><a href="/avoin-mediatuotanto/_draft/_v/1.0/julkaisupalvelut/">JULKAISUPALVELUT</a></li>
    
   
    
      <li><b>Tuotanto</b></li>
    
   
    
      <li><a href="/avoin-mediatuotanto/_draft/_v/1.0/tuotantokalusto/">TUOTANTOKALUSTO</a></li>
    
   
    
      <li><a href="/avoin-mediatuotanto/_draft/_v/1.0/ohjelman-suunnittelu/">OHJELMAN SUUNNITTELU</a></li>
    
   
    
      <li><a href="/avoin-mediatuotanto/_draft/_v/1.0/kuvaukset/">KUVAUKSET</a></li>
    
   
    
      <li><a href="/avoin-mediatuotanto/_draft/_v/1.0/leikkaus/">LEIKKAUS</a></li>
    
   
    
      <li><b>Julkaisu</b></li>
    
   
    
      <li><a href="/avoin-mediatuotanto/_draft/_v/1.0/julkaiseminen-verkossa/">JULKAISEMINEN VERKOSSA</a></li>
    
   
    
      <li><a href="/avoin-mediatuotanto/_draft/_v/1.0/jakelu-ja-jakaminen/">JAKELU JA JAKAMINEN</a></li>
    
   
    
      <li><b>Liitteet</b></li>
    
   
    
      <li><a href="/avoin-mediatuotanto/_draft/_v/1.0/oppaasta/">OPPAASTA</a></li>
    
   
    
      <li><a href="/avoin-mediatuotanto/_draft/_v/1.0/lisenssi/">LISENSSI</a></li>
    
   
  </ul>
 </div>
 <div id="bookcontent"   style="background: url(/site_static/images/draft_bg.png) repeat !important;">
   

  <h1><span style="font-size: 2em;">AVOIMET LISENSSIT JA VAPAAT SIS&Auml;LL&Ouml;T</span></h1>
<p>&nbsp;</p>
<p>Video-ohjelmia tekiess&auml;si t&ouml;rm&auml;&auml;t tekij&auml;noikeuskysymyksiin kahdella tasolla. Ensinn&auml;kin sinun tulee huomioida tekij&auml;noikeudet, jos k&auml;yt&auml;t ohjelmassasi jonkun muun tekem&auml;&auml; materiaalia kuten musiikkia, kuvia tai teksti&auml;. Toisaalta tekij&auml;noikeudet koskevat my&ouml;s omaa ohjelmaasi kun se on valmis.&nbsp;</p>
<h2>TEKIJ&Auml;NOIKEUS JA AVOIMET LISENSSIT</h2>
<p>&nbsp;</p>
<p>Suomessa ja useissa muissa maissa kaikki luovan ty&ouml;n tuloksena syntyneet teokset eli esimerkiksi tekstit, musiikki, ohjelmat, elokuvat, valokuvat, tietokoneohjelmat, pelit ja taideteokset on l&auml;ht&ouml;kohtaisesti suojattu tekij&auml;noikeudella. Tekij&auml;noikeus syntyy automaattisesti teosta luotaessa. Lain m&auml;&auml;rittelem&auml; tekij&auml;noikeus on hyvin kattava, mutta samalla rajoittava: kaikenlainen teoksen levitt&auml;minen, kopioiminen, hy&ouml;dynt&auml;minen, muokkaaminen ja j&auml;lleenmyymyinen on kielletty&auml; ilman tekij&auml;n lupaa.</p>
<p>Useissa tapauksissa toisen teoksen k&auml;ytt&ouml;&ouml;n tarvittavan luvan pyyt&auml;minen tekij&auml;lt&auml; on kuitenkin k&auml;yt&auml;nn&ouml;ss&auml; ty&ouml;l&auml;st&auml;, ellei mahdotonta. Monet tekij&auml;t my&ouml;s toivovat, ett&auml; heid&auml;n ty&ouml;ns&auml; levi&auml;&auml; ja sit&auml; hy&ouml;dynnet&auml;&auml;n uusissa yhteyksiss&auml; mahdollisimman vapaasti. Tekij&auml;noikeuslains&auml;&auml;d&auml;nn&ouml;st&auml; on er&auml;iden toimijoiden mielest&auml; tullut my&ouml;s taakka ja este ideoiden ja luovan ty&ouml;n vapaalle levi&auml;miselle.</p>
<p>Perinteisen tekij&auml;noikeusk&auml;yt&auml;nn&ouml;n rinnalle on luotu joukko avoimia lisenssej&auml; ja k&auml;yt&auml;nt&ouml;j&auml;, joilla tekij&auml; voi rajoittaa tekij&auml;noikeuksiaan ja sit&auml; kautta varmistaa mahdollisimman suuren avoimuuden ja vapauden oman ty&ouml;ns&auml; levitt&auml;miselle ja hy&ouml;dynt&auml;miselle. Vapailla lisensseill&auml; viitataan kulttuurisis&auml;lt&ouml;jen yhteydess&auml; esimerkiksi Creative Commonsiin, ohjelmistopuolella vastaava lisenssi on GNU GPL. Tekij&auml; voi lisensoinnin sijaan my&ouml;s luopua tekij&auml;noikeuksistaan kokonaan, jolloin h&auml;n antaa ty&ouml;ns&auml; t&auml;ysin avoimesti muiden k&auml;ytt&ouml;&ouml;n, yleiseksi hy&ouml;dyksi. T&auml;llaiset teokset kuuluvat Public Domainiin, kuten my&ouml;s teokset, joiden lisenssi on vanhentunut.</p>
<p>Jos haluat k&auml;ytt&auml;&auml; jonkun toisen tekem&auml;&auml; materiaalia ohjelmassasi, ota ensiksi selv&auml;&auml;, mink&auml;laiset tekij&auml;noikeudet teosta koskevat. Avoin sis&auml;lt&ouml; on yleens&auml; julkaistu Creative Commons -lisenssill&auml; tai se kuuluu Public Domainiin. T&auml;llaista sis&auml;lt&ouml;&auml; voit kierr&auml;tt&auml;&auml; omassa videojulkaisussasi laillisesti ja ilman korvausta, kunhan noudatat lisenssien mainitsemia ehtoja.</p>
<p>Jos haluat julkaista oman ohjelmasi avoimella lisenssill&auml;, Creative Commons-lisenssi on hyv&auml; vaihtoehto. Muista, ett&auml; sinun tulee tehd&auml; lisensointi erikseen, sill&auml; kuten edell&auml; jo sanottiin, t&auml;ysi tekij&auml;noikeus syntyy kaikille teoksille automaattisesti.</p>
<p>Huomaa, ett&auml; Teostoon kuuluvien s&auml;velt&auml;jien musiikista t&auml;ytyy aina maksaa, vaikka saisit henkil&ouml;kohtaisesti luvan s&auml;velt&auml;j&auml;lt&auml;.</p>
<h2>MIT&Auml; ON VAPAA SIS&Auml;LT&Ouml;?</h2>
<p>&nbsp;</p>
<p>Avointen lisenssien ja Public Domainin yhteydess&auml; puhutaan vapaasta sis&auml;ll&ouml;st&auml;. Vapaan kulttuurin teosten m&auml;&auml;rittely (<a href="http://freedomdefined.org/Definition/Fi" target="_blank">http://freedomdefined.org/Definition/Fi</a>) tunnistaa seuraavat perusvapaudet, jotka mink&auml; tahansa lisenssin t&auml;ytyy tarjota, jotta ty&ouml;t&auml; voidaan pit&auml;&auml; "vapaana sis&auml;lt&ouml;n&auml;":</p>
<ul>
<li>
<p><strong>Vapautta k&auml;ytt&auml;&auml;</strong> teosta ja nauttia sen k&auml;ytt&auml;misen hy&ouml;dyist&auml;.</p>
</li>
<li>
<p><strong>Vapautta tutkia</strong> teosta ja soveltaa siit&auml; hankittua tietoa.</p>
</li>
<li>
<p><strong>Vapautta tehd&auml; ja levitt&auml;&auml; kopioita</strong>, osaksi tai kokonaisuudessaan, sen sis&auml;ll&ouml;st&auml; ja ilmaisusta.</p>
</li>
<li>
<p><strong>Vapautta tehd&auml; muutoksia ja parannuksia</strong> ja levitt&auml;&auml; johdettuja teoksia.</p>
</li>
</ul>
<p>Vain kolmea rajoitusta pidet&auml;&auml;n sallittuina:</p>
<ul>
<li>
<p><strong>Tekij&auml;t pit&auml;&auml; mainita </strong>(alkuper&auml;isteoksen tekij&auml;t on mainittava).</p>
</li>
<li>
<p><strong>Lisenssin vapaudet pit&auml;&auml; siirt&auml;&auml; teoksen mukana</strong> (johdannaisteos pit&auml;&auml; julkaista vastaavalla lisenssill&auml;).</p>
</li>
<li>
<p><strong>Vapaudet voidaan suojata </strong>(esimerkiksi p&auml;&auml;sy&auml; l&auml;hdekoodiin vaaditaan, kun teoksen johdannaisteoksia jaellaan uudelleen).</p>
</li>
</ul>
<p>Vapaallakin sis&auml;ll&ouml;ll&auml; on kuitenkin aina tekij&auml;. Tekijyys s&auml;ilyy teoksen tekij&auml;ll&auml;, vaikka sis&auml;lt&ouml; on m&auml;&auml;ritelty vapaasti k&auml;ytett&auml;v&auml;ksi. Tekij&auml;n ja teoksen nimen mainitseminen, jos tiedossa, ja materiaalin k&auml;ytt&auml;minen reilussa hengess&auml; sis&auml;ltyy vapauden ja avoimuuden ideaan. Alla kerrotaan tarkemmin edell&auml; esitellyist&auml; lisensseist&auml;.</p>
<h3>Public domain</h3>
<p><img title="sample1" src="static/Mediatuotanto-resized_150x150_sample1-fi.jpg" alt="sample1" name="graphics1" width="150" height="150" border="0" /></p>
<p>&nbsp;</p>
<p><strong>Public domain</strong> on englanninkielinen termi, jolla tarkoitetaan vapaasti yleiseen k&auml;ytt&ouml;&ouml;n asetettujen teosten joukkoa. Usein public domainista k&auml;ytet&auml;&auml;n lyhennett&auml; <strong>PD</strong>. Public domainissa olevan teoksen tekij&auml; on luopunut tekij&auml;noikeuksistaan siin&auml; m&auml;&auml;rin kuin se on lains&auml;&auml;d&auml;nn&ouml;n mukaan mahdollista, ja teoksen k&auml;yt&ouml;lle on mahdollisimman v&auml;h&auml;n rajoituksia.</p>
<p>Useimmissa maissa tekij&auml;noikeuslaki sallii teoksen tai sen osan levitt&auml;misen esimerkiksi tietyn ajan kuluttua tekij&auml;n kuolemasta. Kaikki teokset siirtyv&auml;t public domainiin n&auml;in my&ouml;s vanhetessaan.</p>
<p>&nbsp;</p>
<h3>Creative Commons</h3>
<p><img title="CreativeCommond_logo_trademark" src="static/Mediatuotanto-CreativeCommond_logo_trademark-fi.png" alt="CreativeCommond_logo_trademark" width="268" height="64" /></p>
<p>Creative Commons on Yhdysvalloissa vuonna 2001 perustettu voittoa tavoittelematon yhteis&ouml;, joka pyrkii edist&auml;m&auml;&auml;n luovan ty&ouml;n tuotteiden levitt&auml;mist&auml; laillisesti. Creative Commons eli CC on yksi tunnetuimmista ja laajimmin k&auml;ytetyist&auml; lisenssointij&auml;rjestelmist&auml;, jossa tekij&auml; voi itse m&auml;&auml;ritell&auml; tekij&auml;noikeuksiensa laajuuden valitsemalla erilaisista lisenssivaihtoehdoista. Samalla Creative Commons kokoaa verkkoon helposti etsitt&auml;v&auml;&auml;n muotoon t&auml;llaisia vapaasti levitett&auml;vi&auml; teoksia.</p>
<p>Creative Commons -lisenssit on suomennettu vuonna 2004. Suomessa Creative Commons -sivuista ja lisensseist&auml; vastaavat Taideteollinen korkeakoulu sek&auml; Tietotekniikan tutkimuslaitos HIIT.</p>
<p>Creative Commonsista l&ouml;yd&auml;t lis&auml;tietoa suomenkielisilt&auml; sivuilta osoitteessa: <a href="http://creativecommons.fi/" target="_blank">http://creativecommons.fi/</a></p>
<p><strong>Creative Commons -lisenssiehdot </strong></p>
<p>Creative Commonsilla on nelj&auml; vapaasti valittavaa lisenssiehtoa:</p>
<p><strong>Nimi mainittava (englanniksi Attribution, lyhenne by)</strong></p>
<p><img title="attrib" src="static/Mediatuotanto-attrib-fi.gif" alt="attrib" width="32" height="32" /></p>
<p>Annat muiden kopioida, jaella, n&auml;ytt&auml;&auml; ja esitt&auml;&auml; sinun tekij&auml;noikeuksiisi kuuluvaa teosta sek&auml; sen pohjalta tehtyj&auml; muokattuja versioita teoksestasi vain, jos he mainitsevat nimesi alkuper&auml;isen&auml; tekij&auml;n&auml;.</p>
<p><strong>Sama lisenssi (englanniksi ShareAlike, lyhenne sa)</strong></p>
<p><img title="standard" src="static/Mediatuotanto-standard-fi.gif" alt="standard" width="32" height="32" /></p>
<p>Annat muiden levitt&auml;&auml; muokattuja teoksia vain samalla lisenssill&auml;, jolla oma teoksesi on julkaistu.</p>
<p><strong>Ei kaupalliseen k&auml;ytt&ouml;&ouml;n (englanniksi NonCommercial, lyhenne nc)</strong></p>
<p><img title="noncomm" src="static/Mediatuotanto-noncomm-fi.gif" alt="noncomm" width="32" height="32" />&nbsp;</p>
<p>Annat muiden kopioida, jaella, n&auml;ytt&auml;&auml; ja esitt&auml;&auml; sinun tekij&auml;noikeuksiisi kuuluvaa teosta sek&auml; sen pohjalta tehtyj&auml; muokattuja versioita vain ei-kaupallisessa k&auml;yt&ouml;ss&auml;.</p>
<p><strong>Ei j&auml;lkiper&auml;isi&auml; (englanniksi NoDerivatives, lyhenne nd)</strong></p>
<p><img title="nomod" src="static/Mediatuotanto-nomod-fi.gif" alt="nomod" width="32" height="32" /></p>
<p>Annat muiden kopioida, jaella, n&auml;ytt&auml;&auml; ja esitt&auml;&auml; sinun tekij&auml;noikeuksiisi kuuluvaa alkuper&auml;ist&auml; teosta, mutta et salli muokattujen versioiden tekemist&auml; teoksesta.</p>
<p>Erilaiset Creative Commons -lisenssit muodostuvat n&auml;iden nelj&auml;n ehdon yhdistelmist&auml;. Suomenkielisi&auml; Creative Commons -lisenssej&auml; on 11.</p>
<p>Esimerkiksi merkint&auml; <strong>nc-sa</strong> tarkoittaa, ett&auml; teosta ei saa k&auml;ytt&auml;&auml; kaupallisiin tarkoituksiin ja kaikki teoksesta muokatut versiot tai teosta hy&ouml;dynt&auml;v&auml;t uudet teokset pit&auml;&auml; julkaista samalla <strong>nc-sa</strong> -lisensill&auml;.</p>
<p>Pelkk&auml; <strong>by </strong>merkint&auml; taas tarkoittaa, ett&auml; teosta saa k&auml;ytt&auml;&auml; ja hy&ouml;dynt&auml;&auml; miten tahansa kunhan mainitsee alkuper&auml;isen tekij&auml;n nimen. L&auml;hes kaikki lisenssin k&auml;ytt&auml;j&auml;t valitsevat ainakin vaihtoehdon <strong>by</strong>.</p>
<h3>GNU General Public Licence</h3>
<p><img title="gnu_head" src="static/Mediatuotanto-resized_130x122_gnu_head-fi.jpg" alt="gnu_head" name="graphics7" width="130" height="122" border="0" /></p>
<p>&nbsp;</p>
<p>GNU General Public License<strong> </strong>eli lyhennettyn&auml; GNU&nbsp;GPL tai pelkk&auml;&nbsp;GPL on vapaiden ohjelmistojen julkaisemiseen tarkoitettu lisenssi, joka antaa kenelle tahansa oikeuden tutkia, k&auml;ytt&auml;&auml;, kopioida, muuttaa ja jakaa edelleen ohjelmia ja niiden l&auml;hdekoodia. Lisenssi takaa, ett&auml; n&auml;m&auml; vapaudet s&auml;ilyv&auml;t my&ouml;s GPL-koodiin pohjautuvissa muunnelluissa ohjelmissa. Mik&auml;li GPL-ohjelmaa tai sen muunnelmaa levitet&auml;&auml;n edelleen, l&auml;hdekoodi on julkaistava samalla lisenssill&auml;, eik&auml; ohjelman k&auml;yt&ouml;lle tai levitykselle saa asettaa lis&auml;rajoituksia.</p>
<p>GPL-lisenssi ei est&auml; ohjelmien kaupallista k&auml;ytt&ouml;&auml;. Ohjelman muokkaaja saa myyd&auml; tuotteen kopioita tai muunnelmia, kunhan noudattaa lisenssin asettamia ehtoja. GPL-ohjelmiin perustuvia muunnoksia voidaan my&ouml;s ohjelmoida kaupallisesti, ja jos muunneltua ohjelmaa ei levitet&auml; eteenp&auml;in, l&auml;hdekoodiakaan ei ole pakko julkaista. On olemassa monia yrityksi&auml;, joiden liiketoimintamalli perustuu siihen, ett&auml; ne muokkaavat ja yhdistelev&auml;t GPL-ohjelmia muiden yritysten tarpeisiin.</p>
<p>GPL on selv&auml;sti k&auml;ytetyin vapaiden ohjelmistojen lisenssi, ja muun muassa lukemattomat erilaiset GNU/Linux-k&auml;ytt&ouml;j&auml;rjestelm&auml;n versiot koostuvat p&auml;&auml;osin GPL-ohjelmista. Vaikka GPL-lisenssi&auml; k&auml;ytet&auml;&auml;n p&auml;&auml;asiassa ohjelmien lisensointiin, on esimerkiksi FLOSS Manualsin k&auml;ytt&ouml;oppaat julkaistu GPL-lisenssin alaisuudessa. Videoiden tapainen materiaali kannattaa kuitenkin julkaista Creative Commons -lisenssill&auml;.</p>
<p>GNU GPL -lisenssist&auml; l&ouml;yd&auml;t lis&auml;tietoa osoitteesta: <a href="http://www.gnu.org/licenses/gpl.html" target="_blank">http://www.gnu.org/licenses/gpl.html </a></p>
<h2>ESIMERKKEJ&Auml; VAPAASTA SIS&Auml;LL&Ouml;ST&Auml;</h2>
<p>&nbsp;</p>
<p>Avoimilla lisensseill&auml; on julkaistu verkossa avoimen l&auml;hdekoodin ohjelmistojen lis&auml;ksi vapaasti erilaisiin tuotantoihin tai uudelleenmiksaukseen k&auml;ytett&auml;viss&auml; olevaa sis&auml;lt&ouml;&auml;.</p>
<p>Creative Commons yll&auml;pit&auml;&auml; listaa CC-lisensoidusta aineistosta osoitteessa <a href="http://wiki.creativecommons.org/Content_Curators." target="_blank">http://wiki.creativecommons.org/Content_Curators.</a> Alla esitell&auml;&auml;n muutamia avoimen sis&auml;ll&ouml;n l&auml;hteit&auml;, joista voi olla apua tuotannossasi.</p>
<p>&nbsp;</p>
<h3>ccMixter</h3>
<p><img title="cc" src="static/cc-fi.png" alt="cc" width="163" height="120" /></p>
<p>ccMixter (<a href="http://www.ccmixter.org/" target="_blank">http://www.ccmixter.org</a>) on Creative Commonsin luoma yhteis&ouml;llinen musiikkikirjasto, jossa kaikki kappaleet on lisensoitu avoimella cc-lisenssill&auml;. ccMixterist&auml; voit etsi&auml; musiikkia ohjelmaasi erilaisilla hakutoiminnoilla, ladata ne koneellesi ja tuoda leikkausohjelmaan. Voit my&ouml;s uudelleenmiksata kappaleita ja jakaa omia biisej&auml;si muiden k&auml;ytett&auml;v&auml;ksi lataamalla ja lisensoimalla ne ccMixteriin. Musiikin lataaminen omalle koneelle ei vaadi rekister&ouml;itymist&auml;, mutta oman musiikin lis&auml;&auml;minen sivuille kyll&auml;.</p>
<p>&nbsp;</p>
<h3>Freesound</h3>
<p><img title="freesound_logo_small" src="static/resized_200x69_freesound_logo_small-fi.png" alt="freesound_logo_small" width="200" height="69" /></p>
<p>Freesound (<a href="http://www.freesound.org/" target="_blank">www.freesound.org</a>) on &auml;&auml;niin erikoistunut avoin tietokanta. Voit hakea esimerkiksi liikenteen &auml;&auml;nt&auml; tai tuulen huminaa ja ladata tiedostot koneellesi. Ladataksesi &auml;&auml;ni&auml; sinun tulee rekister&ouml;ity&auml; k&auml;ytt&auml;j&auml;ksi.</p>
<h3>Internet Archive</h3>
<p><img title="logo" src="static/Archive-logo-fi.jpg" alt="logo" width="84" height="70" /></p>
<p>Internet Archiven l&ouml;yd&auml;t osoitteesta <a href="http://www.archive.org/" target="_blank">http://www.archive.org/</a></p>
<p>Internet Archiven tavoitteena on internetin ja digitaalisen tiedon tallentaminen, arkistointi ja s&auml;ilytt&auml;minen. Internet Archive lataa ajoittain miltei kaikki mahdolliset verkkosivut, sek&auml; indeksoi ja arkistoi ne. T&auml;t&auml; palvelua kutsutaan nimell&auml; <strong>WayBack Machine</strong> (<a href="http://www.archive.org/web/web.php" target="_blank">http://www.archive.org/web/web.php</a>) ja sen arkistoa on helppo k&auml;ytt&auml;&auml;. Voit n&auml;hd&auml; oman sivustosi vanhemmat versiot tai lukea verkosta poistuneiden sivujen sis&auml;lt&ouml;&auml;.&nbsp;</p>
<p>T&auml;m&auml;n lis&auml;ksi Internet Archive tarjoaa varastointitilaa miltei mille tahansa tiedolle, jonka tahdot ladata arkistoon. Voit tallentaa ohjelmistoja, videota, teksti&auml;, &auml;&auml;nt&auml;, mit&auml; tahansa. On olemassa tiettyj&auml; vaatimuksia, joista olennaisin on se, ett&auml; sinun tulisi omistaa teokset, tai ainakin saada lupa niiden lataamiseen. Sinun t&auml;ytyy my&ouml;s lisensoida ty&ouml;t <strong>Creative Commons</strong> -lisenssill&auml; (tai vastaavalla). T&auml;m&auml; ei yleens&auml; ole ongelma, mik&auml;li kyseess&auml; on itse tekem&auml;si teos, mutta se voi olla ongelmallista, mik&auml;li k&auml;ytit tekij&auml;noikeusten alaista materiaalia (esimerkiksi musiikkia videossa) ty&ouml;si sis&auml;ll&auml;, tai jos lataat jotain jonkun muun tekem&auml;&auml;. Internet Archive sis&auml;lt&auml;&auml; my&ouml;s valtavan m&auml;&auml;r&auml;n public domainiin kuuluvaa materiaalia, esimerkiksi vanhoja dokumenttifilmej&auml;, joita voi k&auml;ytt&auml;&auml; oman teoksen kuvamateriaalina.</p>
<p>&nbsp;</p>
<h3>Wikimedia Commons</h3>
<p><img title="Commons-logo-en_1" src="static/Mediatuotanto-resized_120x160_Commons-logo-en_1-fi.gif" alt="Commons-logo-en_1" width="120" height="160" /></p>
<p>Wikimedia Commonsin l&ouml;yd&auml;t osoitteesta <a href="http://fi.wikipedia.org/wiki/Wikimedia_Commons" target="_blank">http://fi.wikipedia.org/wiki/Wikimedia_Commons</a></p>
<p><em>Wikimedia Commons</em>ia yll&auml;pit&auml;&auml; <em>Wikimedia Foundation</em>, voittoa tuottamaton s&auml;&auml;ti&ouml;, joka yll&auml;pit&auml;&auml; my&ouml;s Wikipediaa. Se on mediatiedostojen tietokanta, jota kuka tahansa voi k&auml;ytt&auml;&auml; mihin tahansa tarkoitukseen. Avoimelle verkkosivulle voi lis&auml;t&auml; tiedostojaan vapaasti.</p>
<p>Sivustoa yll&auml;pit&auml;v&auml;t vapaaehtoiset toimittajat, jotka luovat my&ouml;s suurimman osan sis&auml;ll&ouml;st&auml; lis&auml;&auml;m&auml;ll&auml; omia t&ouml;it&auml;&auml;n. Yhteis&ouml; on monikielinen, k&auml;&auml;nt&auml;ji&auml; on saatavilla kymmenille eri kielille. Se ker&auml;&auml; vain materiaalia, joka on vapaiden sis&auml;lt&ouml;lisenssien alaista tai public domainissa. Se perustettiin syyskuussa 2004, vuoden 2010 alussa sivuilla on l&auml;hes 6 miljoonaa tiedostoa.</p>
<p>Wikipedia on k&auml;ynnist&auml;nyt my&ouml;s <em>Let's get video on Wikipedia</em>-projektin (<a href="http://videoonwikipedia.org" target="_blank">http://videoonwikipedia.org</a>), jolla ensyklopediaan haetaan artikkeleja havainnollistavaa videosis&auml;lt&ouml;&auml;.</p>
   
  </div>
 </div>


  </div>
</div>
<!-- End of content -->



<!-- sputnik error page -->
<div id="dialog-sputnik-qrac" style="display: none"></div>
<div id="dialog-sputnik-error" title="Can't communicate with booktype">
  <p>
    <span class="ui-icon ui-icon-circle-check" style="float:left; margin:0 7px 50px 0;"></span>
    There has been error in communication with Booktype server.
    Not sure right now where is the problem.
  </p>
  <p>
    You should refresh this page.
  </p>
</div>


<ul class="strings template">
 <li class="ok">OK</li>
 <li class="back">Back</li>
 <li class="create">Create</li>
 <li class="cancel">Cancel</li>
 <li class="next">Next</li>
 <li class="import">Import</li>
 <li class="savechanges">Save changes</li>
 <li class="errorcreategroup">Couldn't create a group!</li>
 <li class="msgepub">enter epub URL</li>
 <li class="msgarchive">enter Archive.org ID</li>
 <li class="msgwiki">enter Wikibooks URL</li>
 <li class="msgbooktype">enter Booktype URL</li>
 <li class="deletebook">Delete book</li>
</ul>

</body>
</html>

