
<!DOCTYPE HTML>
<html>
 <head>
   

<link type="text/css" href="/site_static/css/booki.css" rel="Stylesheet" >
<link type="text/css" href="/site_static/js/jquery/themes/base/jquery.ui.all.css" rel="Stylesheet" >
<link type="text/css" href="/site_static/js/jquery/themes/smoothness/jquery.ui.all.css" rel="Stylesheet" >
<script type="text/javascript" src="/site_static/js/jquery/jquery-1.4.4.js"></script>
<script type="text/javascript" src="/site_static/js/jquery/ui/jquery-ui-1.8.10.custom.js"></script>
<script type="text/javascript" src="/site_static/js/jquery.json-1.3.js"></script>
<script type="text/javascript" src="/site_static/js/booki.js"></script>
<script src="/site_static/js/messaging.js" type="text/javascript"></script>   
<script type="text/javascript" src="/site_static/js/general.js"></script>
<link href="/site_static/css/jquery.bubblepopup.v2.3.1.css" rel="stylesheet" type="text/css" />
<link type="text/css" href="/site_static/css/jquery-ui_overrides.css" rel="Stylesheet" >
<script src="/site_static/js/jquery.bubblepopup.v2.3.1.min.js" type="text/javascript"></script>

<link rel="SHORTCUT ICON" href="http://write.flossmanuals.net/site_static/images/favicon.ico" type="image/x-icon">
<meta property="og:site_name" content="FLOSS Manuals"/><meta name="description" content="Free Manuals for Freedom"/>

<script type="text/javascript">
  $(function() {
      $.booki.sputnikDispatcherURL = "/_sputnik/";

      $("#dialog-sputnik-error").dialog({
          modal: true,
          autoOpen: false,
          buttons: {
            Ok: function() {
               $(this).dialog('close');
               window.location = '.';
            }
          }
      });
  
      $("FORM.messagefield").messagefield('init', {'view_post': '/messaging/post' });  
  });
</script>


   
 <title>/chapter: Leikkaus / Avoin mediatuotanto</title>
 <link type="text/css" href="/site_static/css/draft.css" rel="Stylesheet" />

 <link rel="alternate" type="application/rss+xml" title="RSS feed for Avoin mediatuotanto" href="/feeds/rss/book/avoin-mediatuotanto/" /> 
 <link rel="alternate" type="application/atom+xml" title="Atom feed for Avoin mediatuotanto" href="/feeds/atom/book/avoin-mediatuotanto/" /> 

 <link rel="alternate" type="application/rss+xml" title="RSS feed for chapter LEIKKAUS" href="/feeds/rss/chapter/avoin-mediatuotanto/avoin-mediatuotanto/" /> 
 <link rel="alternate" type="application/atom+xml" title="Atom feed for chapter LEIKKAUS" href="/feeds/atom/chapter/avoin-mediatuotanto/avoin-mediatuotanto/" /> 
 
 <script type="text/javascript" src="/site_static/js/draft.js"></script>


   <link type="text/css" href="/static/css/_user.css" rel="Stylesheet" >
 </head>
<body>

<div class="topbar"> 
  <div class="logotext"><a href="http://write.flossmanuals.net/">FLOSS Manuals</a> </div>

  <div class="meta-bar">
    
    <ul>
      <li>
        <a href="/accounts/signin/?redirect=/avoin-mediatuotanto/_draft/_v/1.0/leikkaus/">Sign In / Create Account</a>
      </li>
    </ul>
    
    <div style="padding-top: 10px; padding-right: 15px;">
      <br/>
      

<script>
  $(function() {
    var $frm = $("FORM[name=changelang]");
	
    $("A[href=#]", $frm).click(function() {
        var lang = $(this).attr("class").substr(4);
	
        $("INPUT[name=language]", $frm).val(lang);
        $frm.submit();
	
        return false;
    });
  });
 </script>

<form name="changelang" method="POST" action="/accounts/i18n/setlang/?language=en-us">
  <input type="hidden" name="language" value="en-us">
  
    &nbsp;English&nbsp;|
  
  
  
    &nbsp;<a class="langes" href="#">Español</a>&nbsp;|
  

  
    &nbsp;<a class="langfr" href="#">Français</a>&nbsp;|
  
	
  
    &nbsp;<a class="langit" href="#">Italiano</a>&nbsp;|
  
	
  
    &nbsp;<a class="langpt" href="#">Português</a>&nbsp;|
  
	
  
    &nbsp;<a class="langru" href="#">Русский</a>&nbsp;|
  
	
  
    &nbsp;<a class="langsq" href="#">Shqip</a>
  	
</form>

    </div>
    
    
  </div><!-- End of .meta-bar -->
</div><!-- End top bar -->

<div class="menubar shadow">
  
  
  <div class="navbox">
    <ul>
      <li><a href="/list-books/">Books</a></li>
      <li><a href="/list-groups/">Groups</a></li>
      <li><a href="/list-people/">People</a></li>
    </ul>      
  </div><!-- End of .navbox -->       
</div>

<div class="content-container">
  <div class="content shadow">
    <!-- Content box and the drop shadow-->
    

<h2>Avoin mediatuotanto</h2>
<div class="padded">
 <div id="bookmenu" style="background: url(/site_static/images/draft_bg.png) repeat !important;"> 
  <ul>
   
    
      <li><b>Johdanto</b></li>
    
   
    
      <li><a href="/avoin-mediatuotanto/_draft/_v/1.0/aluksi/">ALUKSI</a></li>
    
   
    
      <li><b>Yhteisömedian maisema</b></li>
    
   
    
      <li><a href="/avoin-mediatuotanto/_draft/_v/1.0/verkko-ja-yhteisomedia/">VERKKO- JA YHTEISÖMEDIA</a></li>
    
   
    
      <li><a href="/avoin-mediatuotanto/_draft/_v/1.0/kevyt-tuotantotapa/">KEVYT TUOTANTOTAPA</a></li>
    
   
    
      <li><a href="/avoin-mediatuotanto/_draft/_v/1.0/avoimen-lahdekoodin-ohjelmistot/">AVOIMEN LÄHDEKOODIN OHJELMISTOT</a></li>
    
   
    
      <li><a href="/avoin-mediatuotanto/_draft/_v/1.0/avoimet-lisenssit-ja-vapaat-sisallot/">AVOIMET LISENSSIT JA VAPAAT SISÄLLÖT</a></li>
    
   
    
      <li><a href="/avoin-mediatuotanto/_draft/_v/1.0/julkaisupalvelut/">JULKAISUPALVELUT</a></li>
    
   
    
      <li><b>Tuotanto</b></li>
    
   
    
      <li><a href="/avoin-mediatuotanto/_draft/_v/1.0/tuotantokalusto/">TUOTANTOKALUSTO</a></li>
    
   
    
      <li><a href="/avoin-mediatuotanto/_draft/_v/1.0/ohjelman-suunnittelu/">OHJELMAN SUUNNITTELU</a></li>
    
   
    
      <li><a href="/avoin-mediatuotanto/_draft/_v/1.0/kuvaukset/">KUVAUKSET</a></li>
    
   
    
      <li><a href="/avoin-mediatuotanto/_draft/_v/1.0/leikkaus/">LEIKKAUS</a></li>
    
   
    
      <li><b>Julkaisu</b></li>
    
   
    
      <li><a href="/avoin-mediatuotanto/_draft/_v/1.0/julkaiseminen-verkossa/">JULKAISEMINEN VERKOSSA</a></li>
    
   
    
      <li><a href="/avoin-mediatuotanto/_draft/_v/1.0/jakelu-ja-jakaminen/">JAKELU JA JAKAMINEN</a></li>
    
   
    
      <li><b>Liitteet</b></li>
    
   
    
      <li><a href="/avoin-mediatuotanto/_draft/_v/1.0/oppaasta/">OPPAASTA</a></li>
    
   
    
      <li><a href="/avoin-mediatuotanto/_draft/_v/1.0/lisenssi/">LISENSSI</a></li>
    
   
  </ul>
 </div>
 <div id="bookcontent"   style="background: url(/site_static/images/draft_bg.png) repeat !important;">
   

  <h1><span style="font-size: 2em;">LEIKKAUS</span></h1>
<p>&nbsp;</p>
<p>Leikkaamisella vaikutetaan suuresti video-ohjelman lopputulokseen kokonaisuutena. Hyv&auml;ll&auml; leikkauksella voit v&auml;litt&auml;&auml; haluamasi viestin tai vaikuttaa ohjelmasi yleistunnelmaan erilaisilla rytmityksill&auml; ja montaaseilla. Yhdist&auml;m&auml;ll&auml; erilaisia kuvia per&auml;kk&auml;in luot mielikuvia ja assosiaatioita. Leikkaaminen on my&ouml;s ajan hallintaa: lyhyess&auml;kin ajassa voit kertoa suuren m&auml;&auml;r&auml;n tapahtumia ja asioita.</p>
<p>Yleisohjeina leikkaamisessa voit k&auml;ytt&auml;&auml; kuvien <strong>keston </strong>vaihtelua sek&auml; <strong>kuvakokojen</strong> hy&ouml;dynt&auml;mist&auml;. Pitk&auml;&auml;n kest&auml;v&auml;t rauhalliset kuvat ja toisaalta lyhyet v&auml;l&auml;hdykset luovat vaihtelevan <strong>rytmin</strong>. Eri kuvakokoja kannattaa yhdistell&auml; siten, ett&auml; kuvakoon muutos on per&auml;kk&auml;isiss&auml; kuvissa tarpeeksi suuri. K&auml;yt&auml;nn&ouml;ss&auml; t&auml;m&auml; tarkoittaa, ett&auml; esimerkiksi haastateltavasta kannattaa laittaa per&auml;kk&auml;in kokokuva ja l&auml;hikuva, mieluummin kuin puolikuva ja puolil&auml;hikuva.</p>
<p><img title="sekvenssit" src="static/resized_600x385_sekvenssit-fi.jpg" alt="sekvenssit" width="600" height="385" /></p>
<p><em>Leikkaaminen tarkoittaa kuvien j&auml;rjest&auml;mist&auml; kerronnalliseksi kokonaisuudeksi. Kuvien kestoa vaihtelemalla syntyy leikkausrytmi.</em></p>
<h2>OPENSHOTIN ASENNUS UBUNTUUN</h2>
<p>&nbsp;</p>
<p>T&auml;ss&auml; oppaassa keskityt&auml;&auml;n p&auml;&auml;s&auml;&auml;nt&ouml;isesti leikkaamiseen OpenShotilla.</p>
<p>OpenShot vaatii 600 MHz prosessorin, 256 MB muistia ja 1 GB kiintolevytilaa. T&auml;m&auml; merkitsee, ett&auml; voi k&auml;ytt&auml;&auml; OpenShottia melko vanhassa koneessa.</p>
<p>Helpoin tapa asentaa OpenShot Ubuntu Linuxiin on asentaa se komentorivilt&auml;.</p>
<p>Voit asentaa OpenShotin Lucid Lynxiss&auml; (10.04 LTS) ajamalla komentorivilt&auml; seuraavan komennon:</p>
<pre id="sources-list-entries" class="wrap"><span>&nbsp;sudo apt-get install openshot</span></pre>
<p>Huomaa, ett&auml; joudut antamaan sudo-komennon vaatiman p&auml;&auml;k&auml;ytt&auml;j&auml;n salasanan.</p>
<h2>DV-MATERIAALIN KAAPPAAMINEN KINOLLA</h2>
<p>&nbsp;</p>
<p>Koska OpenShot ei tarjoa mahdollisuutta kaapata materiaalia suoraan minidv-nauhalta, voit k&auml;ytt&auml;&auml; kaappaamiseen Kino -ohjelmaa. Kaappaamista varten tarvitset kameran (tai nauhurin) sek&auml; Linux-tietokoneen, joissa on firewire-liitin.</p>
<p>Jos koneessasi ei ole Kinoa, voit asentaa sen ajamalla komentorivilt&auml; seuraavan komennon:</p>
<pre id="sources-list-entries" class="wrap"><span>&nbsp;sudo apt-get install kino</span> </pre>
<p>Kytke kamera dv-firewire-kaapelilla koneeseen ja t&auml;m&auml;n j&auml;lkeen k&auml;ynnist&auml; kamera. DV-Firewire -piuhan liitin l&ouml;ytyy useimmista kameroista.</p>
<p>Jos koneessasi ei ole Firewire (IEEE 1394) porttia, voit ostaa siihen firewire-videokortin, jollaisen saa kaupasta noin 15 eurolla.</p>
<p>-Avaa tietokoneen firewire-portti komentorivilt&auml; alla olevalla komennolla&nbsp; ja anna j&auml;rjestelm&auml;nvalvojan salasana.</p>
<pre id="sources-list-entries" class="wrap"><span>&nbsp;</span>sudo chmod 777 /dev/raw1394 </pre>
<ul>
<li>Avaa Kino ja m&auml;&auml;rittele asetukset:</li>
<li>Valitse normalisointi PAL, &auml;&auml;ni 48 kHz stereo, kuvasuhde 16:9 tai 4:3 (riippuen kameran kuvausasetuksista, ts. mill&auml; kuvasuhteella olet kuvannut)</li>
<li>M&auml;&auml;rittele kaappauskansio ja valitse tiedostotyyppi AVI DV Type 2. Jos laitat ruksin kohtaan "Jaa tiedostot automaattisesti kahtia", Kino tekee aina uuden videotiedoston alkaen siit&auml; kohdin, milloin kamera on laitettu nauhoittamaan.</li>
<li>Kaappaa materiaali. Voit ohjata kameraa (tai nauhuria) Kinon ohjainpainikeilla.</li>
<li>Voit avata kaapatut avi-tiedostot suoraan OpenShotissa. Mutta jos on tarpeen, voit t&auml;ss&auml; v&auml;liss&auml; tehd&auml; &auml;&auml;nentasojen s&auml;&auml;d&ouml;n, johon tarvitaan Audacity-ohjelmaa.</li>
</ul>
<h2>PROJEKTIN ALOITTAMINEN OPENSHOTILLA</h2>
<p>&nbsp;</p>
<p>Valikon alla on nelj&auml; projektinappulaa.</p>
<p><img title="n__pp__imet" src="static/OpenShot-n__pp__imet-fi.png" alt="n__pp__imet" width="157" height="39" /></p>
<p>N&auml;m&auml; nappulat ovat <strong>Uusi projekti</strong>, <strong>Tallenna projekti</strong>, <strong>Lis&auml;&auml; tiedosto</strong> ja <strong>Vie video</strong>.</p>
<p>Aloita painamalla uusi projekti -painiketta ja m&auml;&auml;rit&auml; projektillesi nimi, tallennuskansio, kesto (viitteellinen) sek&auml; profiili (esim. DV PAL widescreen, jos olet kuvannut dv-kameralla 16:9 -kuvasuhteella).</p>
<p>T&auml;m&auml;n j&auml;lkeen voit tuoda projektiin Kinossa kaapatut avi-tiedostot, sek&auml; muita video-, kuva- ja &auml;&auml;nitiedostoja, joita haluat k&auml;ytt&auml;&auml; projektissasi, lis&auml;&auml; tiedosto -painikkeella. Stillkuvat kannattaa skaalata (esimerkiksi Gimpill&auml;) valmiiksi samaan resoluutioon, jota k&auml;yt&auml;t videoissasi. PAL-resoluutio kuvasuhteessa 4:3 (vanhan tv-kuvan muotoinen kuva) on 720x576 px, 72 dpi ja kuvasuhteessa 16:9 (nyky&auml;&auml;n yleisempi, suorakaiteen muotoinen laajakuva) 1024&times;768 px. Kaikki ohjelmaan tuodut materiaalit sek&auml; tekstiplanssit n&auml;kyv&auml;t ohjelman vasemmassa yl&auml;laidassa listana ja niit&auml; voi muokata aikajanalla miten tahansa ilman, ett&auml; muutokset vaikuttavat listalla oleviin alkuper&auml;isiin materiaaleihin.</p>
<p>OpenShotilla leikatessa projekti kannattaa tehd&auml; valmiiksi kronologisesti eli aloita alusta -logiikalla. T&auml;m&auml; siit&auml; syyst&auml;, ett&auml; toistaiseksi OpenShotissa ei ole mahdollista k&auml;yt&auml;nn&ouml;llisell&auml; tavalla valita ja siirt&auml;&auml; useita leikkeit&auml; samanaikaisesti aikajanalla eri kohtiin. T&auml;st&auml; johtuen projekti kannattaa aloittaa alkuteksteist&auml;.</p>
<p>Tekstityksiin voit k&auml;ytt&auml;&auml; OpenShotin yksinkertaista otsikkoeditoria, joka l&ouml;ytyy yl&auml;laidan tiputusvalikosta <strong>title/otsikko</strong>. Valitse <strong>Uusi</strong> ja aloita tekstin luominen seuraamalla oikeassa laidassa olevia painikkaita vaiheittain ylh&auml;&auml;lt&auml; alas.</p>
<p>Huom! K&auml;yt&auml; laajempaa editoria -nappula vie sinut Inkscapeen, joka on astetta monimutkaisempi graafisen suunnittelun ty&ouml;kalu ja varsinkin alottelijoille suhteellisen haastava k&auml;ytt&auml;&auml;, mutta harjaantuneemmille k&auml;ytt&auml;jille hyv&auml; v&auml;line.</p>
<h3>Esikatseluruutu</h3>
<p>OpenShot-ikkunan oikeassa yl&auml;osassa on videon esikatseluruutu, jossa voit katsoa yksitt&auml;isi&auml; leikkeit&auml; sek&auml; aikajanalle valmistuvaa video-ohjelmaasi.</p>
<p>Ruudun alla on vierityspalkki, jonka avulla voit siirty&auml; eri paikkoihin videossa.</p>
<p>Vierityspalkin alla n&auml;et ohjainn&auml;pp&auml;imet, jotka ovat samanlaisia kuin DVD-soittimessa.</p>
<p><img title="videonauhurinappulat" src="static/OpenShot-videonauhurinappulat-fi.png" alt="videonauhurinappulat" width="360" height="48" /></p>
<p>N&auml;m&auml; nappulat ovat <strong>Siirry alkuun</strong>, <strong>Edellinen merkki</strong>, <strong>Siirry taaksep&auml;in</strong>, <strong>Toista</strong>, <strong>Siirry eteenp&auml;in</strong>, <strong>Seuraava merkki</strong> ja <strong>Siirry loppuun</strong>.</p>
<p>Vihje: Voit k&auml;ytt&auml;&auml; n&auml;pp&auml;imist&ouml;n nuolin&auml;pp&auml;imi&auml; tarkkaan liikkumiseen aikajanalla tai leikkeen sis&auml;ll&auml;. V&auml;lily&ouml;nti-n&auml;pp&auml;in k&auml;ynnist&auml;&auml; ja pys&auml;ytt&auml;&auml; toiston.</p>
<h3>Aikajana</h3>
<p>Video-ohjelma rakennetaan aikajanalla oleville raidoille. Aikajana alkaa nollasta minuutista ja jatkuu horisontaalisesti vasemmalta oikealle. Punainen pystyviiva on toistok&auml;rki, jota voit liikuttaa hiirell&auml; tai esikatseluruudun ohjaimilla sek&auml; nuoli- ja v&auml;lily&ouml;ntin&auml;pp&auml;imill&auml;.</p>
<p>Luo projektiisi riitt&auml;v&auml; m&auml;&auml;r&auml; raitoja. Oletusarvoisesti raitoja on kaksi, mutta voit lis&auml;t&auml; niit&auml; tarpeesi mukaan. Kukin raita on samanaikaisesti video- ja &auml;&auml;niraita, mutta voit my&ouml;s ruksia raidan pelk&auml;ksi &auml;&auml;ni- tai videoraidaksi painikkeista raidan vasemmassa p&auml;&auml;ss&auml;. Jos k&auml;yt&auml;t musiikkia tai jotain muuta yhten&auml;ist&auml; &auml;&auml;nitaustaa, ty&ouml;skentelyn kannalta on selke&auml;mp&auml;&auml;, jos sijoitat &auml;&auml;niraidat videoraitojen alapuolelle.</p>
<p><img title="kuvajaaani" src="static/OpenShot-kuvajaaani-fi.png" alt="kuvajaaani" width="49" height="48" /></p>
<p>Aikajanan komentonappulat ovat <strong>Lis&auml;&auml; raita</strong>, <strong>Nuolity&ouml;kalu</strong>, <strong>Leikkausty&ouml;kalu</strong>, <strong>Venytysty&ouml;kalu</strong>, <strong>Tarrausty&ouml;kalu</strong> ja <strong>Lis&auml;&auml; merkki</strong>.</p>
<p><img title="aikajanannappaimet" src="static/OpenShot-resized_324x180_aikajanannappaimet-fi.png" alt="aikajanannappaimet" width="324" height="180" /></p>
<p>Videoraitojen zoomausta voit s&auml;&auml;dell&auml; zoomauspalkin avulla. T&auml;m&auml; m&auml;&auml;rittelee, kuinka monta sekuntia on kahden videoraidan pisteen v&auml;lill&auml;. Arvot voivat olla 1-200 sekuntia.&nbsp; <img title="zoomaus" src="static/OpenShot-zoomaus-fi.png" alt="zoomaus" width="333" height="38" /></p>
<p>Jos laitat videokuvaa samaan kohtaan kahdelle tai useammalle raidalle, ylin videoraidoista toistuu. Huomaa kuitenkin, ett&auml; kaikkien p&auml;&auml;llekk&auml;isten raitojen &auml;&auml;net toistuvat, ellei niit&auml; ole mykistetty. Kustakin aikajanalle viedyst&auml; leikkeest&auml; voit - kuvaketta napsauttamalla tai hiiren oikealla n&auml;pp&auml;imell&auml; - erikseen valita k&auml;ytet&auml;&auml;nk&ouml; siit&auml; pelk&auml;st&auml;&auml;n video tai &auml;&auml;ni vaiko molemmat.</p>
<p>Huom! Jos laitat samalle raidalle kaksi leikett&auml; p&auml;&auml;llek&auml;in, toistuu aikaisempi (alle j&auml;&auml;nyt) leike (vaikka aikajanalla n&auml;kyykin nyt my&ouml;hemmin lis&auml;tyn leikkeen kuvake) - pyri v&auml;ltt&auml;m&auml;&auml;n t&auml;t&auml; p&auml;&auml;llek&auml;isyytt&auml;.</p>
<p>Napsauttamalla <strong>hiiren oikealla n&auml;pp&auml;imell&auml;</strong> leikkeen p&auml;&auml;ll&auml;, voit muuttaa leikkeen kuva- ja &auml;&auml;niasetuksia (esim. m&auml;&auml;ritt&auml;&auml; h&auml;ivytyksi&auml;), tai poistaa leikkeen.</p>
<h3>Ty&ouml;kalut</h3>
<p><img title="nuolity__kalu" src="static/OpenShot-nuolity__kalu-fi.png" alt="nuolity__kalu" width="46" height="45" /></p>
<p>Kun <strong>nuolity&ouml;kalu</strong> on valittuna, voit siirt&auml;&auml; projektisi leikkeit&auml; aikajanan raidoille sek&auml; vaihtaa niiden sijaintia aikajanalla.</p>
<p><img title="aikajanalla" src="static/OpenShot-resized_400x168_aikajanalla-fi.png" alt="aikajanalla" width="400" height="168" /></p>
<p><img title="leikkausty__kalu" src="static/OpenShot-leikkausty__kalu-fi.png" alt="leikkausty__kalu" width="53" height="47" /></p>
<p>Valittuasi <strong>leikkausty&ouml;kalun</strong> voit napsauttaa leikkeen p&auml;&auml;ll&auml;, jolloin se leikkaantuu kahteen osaan.</p>
<p><img title="leikattu" src="static/OpenShot-leikattu-fi.png" alt="leikattu" width="282" height="186" /></p>
<p>T&auml;m&auml;n j&auml;lkeen voit taas valita nuolity&ouml;kalun ja vet&auml;&auml; videop&auml;tk&auml;t erilleen.</p>
<p><img title="erotettu" src="static/OpenShot-erotettu-fi.png" alt="erotettu" width="330" height="181" /></p>
<p><img title="venytysty__kalu" src="static/OpenShot-venytysty__kalu-fi.png" alt="venytysty__kalu" width="48" height="47" /></p>
<p><strong>Venytysty&ouml;kalun</strong> avulla voit venytt&auml;&auml; videoleikkeen ajallista kestoa, eli muuttaa aikajanalla olevan leikkeen alku- tai loppukohtaa. T&auml;ll&auml; ty&ouml;kalulla on helppo poistaa leikkeiden turhat h&auml;nn&auml;t.</p>
<p>Vihje: Voit etsi&auml; soittok&auml;rjell&auml; (punainen pystyviiva) haluamasi leikkauskohdan ruudun (framen) tarkkuudella k&auml;ytt&auml;m&auml;ll&auml; nuolin&auml;pp&auml;imi&auml;. Sen j&auml;lkeen voit venytysty&ouml;kalulla poistaa h&auml;nn&auml;n, mutta varmista ett&auml; tarrausty&ouml;kalu on valittuna.</p>
<p><img title="tarrausty__kalu" src="static/OpenShot-tarrausty__kalu-fi.png" alt="tarrausty__kalu" width="48" height="44" /></p>
<p><strong>Tarrausty&ouml;kalun</strong> avulla videop&auml;tk&auml;t tarttuvat toisiinsa. Milk&auml;li tarrausty&ouml;kalu ei ole valittuna, on videoleikkeit&auml; vaikeaa saada alkamaan t&auml;sm&auml;lleen edellisen leikkeen lopusta.Tavallisesti tarrausty&ouml;kalu siis kannattaa pit&auml;&auml; aina valittuna.</p>
<p>Huom! Voit halutessasi kokeilla my&ouml;s ohjelman tarjoamia erilaisia siirtymi&auml; ja tehosteita.</p>
<h2>MUSIIKIN TAI &Auml;&Auml;NEN LIS&Auml;&Auml;MINEN CCMIXTERIST&Auml; JA FREESOUNDISTA</h2>
<p>&nbsp;</p>
<p>Helpoin tapa aloittaa musiikin etsiminen on menn&auml; osoitteeseen <a title="http://fi.flossmanuals.net/inkscape/" href="http://www.dig.ccmixter.org/">www.dig.ccmixter.org</a>&nbsp; ja valita linkki <em>Instrumental Music for Film, YouTube&trade; Videos and Soundtracks</em>. Voit hakea musiikkia englanninkielisill&auml; hakusanoilla tai k&auml;ytt&auml;m&auml;ll&auml; <strong>advanced dig</strong> -toimintoa, jossa voit rajata hakuja erilaisilla m&auml;&auml;reill&auml;, kuten genre, instrumentti jne. Voit kuunnella kappaleita napsauttamalla hiirell&auml; kappaleen nime&auml;. Lataaminen onnistuu painamalla kappaleen nimen edess&auml; olevaa alasp&auml;in osoittavaa nuolta, josta avautuu latausikkuna. Latausikkunassa on uudestaan kappaleen nimi ja voit ladata sen pit&auml;m&auml;ll&auml; pohjassa hiiren oikeaa n&auml;pp&auml;int&auml; nimen kohdalla ja valitsemalla<strong> save link as</strong>. Kappale latautuu koneesi ty&ouml;p&ouml;yd&auml;lle tai downloads/lataukset kansioon. Kappaleet ovat useimmiten mp3, wav tai aiff -muodossa, ja ne voi tuoda sellaisinaan OpenShotiin. Tuominen tapahtuu samalla tavalla kuin videon tuominen eli <strong>Lis&auml;&auml; tiedosto</strong> -toiminnon avulla (katso edell&auml;).</p>
<p>Muista, ett&auml; ccMixterin musiikkia voi k&auml;ytt&auml;&auml; p&auml;&auml;s&auml;&auml;nt&ouml;isesti vain ep&auml;kaupallisissa tarkoituksissa ja kappaleiden nimet, tekij&auml;t ja lisenssit (esim. NonCommercial Sampling Plus 1.0) tulee mainita ohjelman lopputeksteiss&auml;. Lisenssin nimen ja tarkat tiedot saat n&auml;kyviin napsauttamalla kappaleen per&auml;ss&auml; olevaa cc-lisenssin ikonia.</p>
<p><img src="static/resized_300x226_cc2_1-fi.png" alt="cc2_1.png" width="300" height="226" /></p>
<p><em>OpenShotin tekstity&ouml;kalusta l&ouml;ytyy valmis lopputekstiplanssi, johon voi t&auml;ydent&auml;&auml; musiikin tiedot. </em></p>
<p><strong>Freesound.org</strong> etusivun vasemmassa laidassa l&ouml;ytyy linkki <strong>search</strong>, joka avaa hakutoiminnon. Kirjoita kent&auml;&auml;n englanniksi hakusana, esim. traffic. Kannattaa kokeilla erilaisia hakusanoja. Voit kuunnella &auml;&auml;nen pienest&auml; <strong>play</strong>-nappulasta joka l&ouml;ytyy haettujen &auml;&auml;nitiedostojen yl&auml;puolelta. Napsauttamalla &auml;&auml;niteidoston nime&auml; p&auml;&auml;set lataussivulle ja viimeist&auml;&auml;n t&auml;ss&auml; vaiheessa sinun tulee rekister&ouml;ity&auml; tai kirjautua sis&auml;&auml;n sivulle. Lataaminen onnistuu lataussivun oikeassa yl&auml;kulmassa olevasta linkist&auml; <strong>download</strong>. Paina hiiren oikeaa n&auml;pp&auml;int&auml; ja valitse <strong>save link as</strong>. Mainitse nettisivun osoite, &auml;&auml;nin&auml;ytteiden nimet ja tekij&auml;t lopputeksteiss&auml;.</p>
<h2>VIE VIDEO</h2>
<p>&nbsp;</p>
<p>Kun video-ohjelmasi on leikkauksen osalta valmis, sinun pit&auml;&auml; viel&auml; vied&auml; eli exportoida video.</p>
<p>Paina punaista <strong>Vie video</strong> -nappulaa.</p>
<p><img src="static/resized_219x300_vie-fi.png" alt="vie.png" width="219" height="300" /></p>
<p>M&auml;&auml;rit&auml; tiedostolle ensin nimi ja tallennuskansio. Sen j&auml;lkeen sinun tulee m&auml;&auml;ritt&auml;&auml; videon profiili, tiedostop&auml;&auml;te ja pakkaustapa. <strong>Yksinkertainen</strong> -valikossa on valittavana muutamia vaihtoehtoja, joista voit valita esimerkiksi kuvassa (yll&auml;) n&auml;kyv&auml;t vaihtoehdot. Yksi suositeltava formaatti on uusi HTML5:een suunniteltu avoin <strong>webM</strong><em>, </em>jonka asetukset l&ouml;ytyv&auml;t uusimmassa OpenShotin versiossa 1.3 suoraan yksinkertainen-valikosta. Esimerkiksi Youtube k&auml;ytt&auml;&auml; t&auml;t&auml; Googlen sponsoroimaa laadukasta formaattia, mutta ihan kaikkialle webM-p&auml;&auml;tteiset tiedostot eiv&auml;t v&auml;ltt&auml;m&auml;tt&auml; viel&auml; kelpaa. WebM edellytt&auml;&auml; v&auml;hint&auml;&auml;n 0.6 versiota FFMpeg-koodausohjelmasta, joka uusimmissa Ubuntuissa (10.10 alkaen) tulee mukana.</p>
<p>Paina lopuksi <strong>Vie videoksi</strong>, ja OpenShot tekee videon tiedostoksi, jota voit katsella videosoitinohjelmilla ja jonka voit ladata verkkoon.</p>
<h2>VINKKEJ&Auml; PIDEMM&Auml;LLE EHTINEILLE</h2>
<p>&nbsp;</p>
<p>Koska Kinon sek&auml; OpenShotin &auml;&auml;nenk&auml;sittelyominaisuudet ovat hyvin rajalliset, kannattaa mahdolliset &auml;&auml;nity&ouml;t tehd&auml; Audacity-ohjelmalla. Voit tallentaa Kinosta kaapatun videon &auml;&auml;niraidan wav-tiedostona ja avata sen muokattavaksi Audacityss&auml;. Huomaa ettei t&auml;ll&ouml;in kannata muuttaa &auml;&auml;nitiedoston kestoa, jos siis haluat liitt&auml;&auml; &auml;&auml;nen takaisin kuvaan. Voit tuoda muokatun, wav-muotoon tallennetun &auml;&auml;nitiedoston projektiisi Kinon &auml;&auml;nisuotimen dubbaus-toiminnon avulla, joka l&ouml;ytyy tehosteista. T&auml;m&auml;n j&auml;lkeen sinun on viel&auml; tallennettava elokuva uuden &auml;&auml;niraidan kanssa.</p>
<p>&Auml;&auml;nen ty&ouml;st&auml;minen Audacityssa on hy&ouml;dyllist&auml; silloin jos haluat nostaa &auml;&auml;nen tasoja tai tehd&auml; vaativamman mixauksen esimerkiksi musiikista, tehoste&auml;&auml;nist&auml; ja puheesta. Huomaa, ett&auml; voit vied&auml; Audacityss&auml; ty&ouml;st&auml;m&auml;si &auml;&auml;nen my&ouml;s OpenShotiin. K&auml;yt&auml;nn&ouml;ss&auml; t&auml;m&auml; tarkoitaa sit&auml;, ett&auml; k&auml;yt&ouml;ss&auml;si on erillinen &auml;&auml;niraita, joka sinun tulee uudelleen synkata kuvan kanssa. Ty&ouml;prosessi on jossain m&auml;&auml;rin ty&ouml;l&auml;s, mutta ei mahdoton.</p>
<p>Video-ohjelman lopputulokseen vaikuttaa kuvan ja &auml;&auml;nen lis&auml;ksi my&ouml;s paljon graafinen ilme (tekstin fontit, logot, graafiset esitykset jne). Voit halutessasi ty&ouml;st&auml;&auml; grafiikoita <strong>Gimpill&auml;</strong> tai <strong>Inkscapell&auml;</strong>. Inkscape on integroitu OpenShotiin ja p&auml;&auml;set ohjelmaan suoraan kun valitset yksinkertaisesta otsikkoeditorista kohdan <strong>k&auml;yt&auml; laajempaa editoria</strong>. Inkscapen oppaan l&ouml;yd&auml;t FLOSS manualsin sivulta <a title="http://fi.flossmanuals.net/inkscape/" href="http://fi.flossmanuals.net/inkscape/">http://fi.flossmanuals.net/inkscape/</a>.</p>
   
  </div>
 </div>


  </div>
</div>
<!-- End of content -->



<!-- sputnik error page -->
<div id="dialog-sputnik-qrac" style="display: none"></div>
<div id="dialog-sputnik-error" title="Can't communicate with booktype">
  <p>
    <span class="ui-icon ui-icon-circle-check" style="float:left; margin:0 7px 50px 0;"></span>
    There has been error in communication with Booktype server.
    Not sure right now where is the problem.
  </p>
  <p>
    You should refresh this page.
  </p>
</div>


<ul class="strings template">
 <li class="ok">OK</li>
 <li class="back">Back</li>
 <li class="create">Create</li>
 <li class="cancel">Cancel</li>
 <li class="next">Next</li>
 <li class="import">Import</li>
 <li class="savechanges">Save changes</li>
 <li class="errorcreategroup">Couldn't create a group!</li>
 <li class="msgepub">enter epub URL</li>
 <li class="msgarchive">enter Archive.org ID</li>
 <li class="msgwiki">enter Wikibooks URL</li>
 <li class="msgbooktype">enter Booktype URL</li>
 <li class="deletebook">Delete book</li>
</ul>

</body>
</html>

