
<!DOCTYPE HTML>
<html>
 <head>
   

<link type="text/css" href="/site_static/css/booki.css" rel="Stylesheet" >
<link type="text/css" href="/site_static/js/jquery/themes/base/jquery.ui.all.css" rel="Stylesheet" >
<link type="text/css" href="/site_static/js/jquery/themes/smoothness/jquery.ui.all.css" rel="Stylesheet" >
<script type="text/javascript" src="/site_static/js/jquery/jquery-1.4.4.js"></script>
<script type="text/javascript" src="/site_static/js/jquery/ui/jquery-ui-1.8.10.custom.js"></script>
<script type="text/javascript" src="/site_static/js/jquery.json-1.3.js"></script>
<script type="text/javascript" src="/site_static/js/booki.js"></script>
<script src="/site_static/js/messaging.js" type="text/javascript"></script>   
<script type="text/javascript" src="/site_static/js/general.js"></script>
<link href="/site_static/css/jquery.bubblepopup.v2.3.1.css" rel="stylesheet" type="text/css" />
<link type="text/css" href="/site_static/css/jquery-ui_overrides.css" rel="Stylesheet" >
<script src="/site_static/js/jquery.bubblepopup.v2.3.1.min.js" type="text/javascript"></script>

<link rel="SHORTCUT ICON" href="http://write.flossmanuals.net/site_static/images/favicon.ico" type="image/x-icon">
<meta property="og:site_name" content="FLOSS Manuals"/><meta name="description" content="Free Manuals for Freedom"/>

<script type="text/javascript">
  $(function() {
      $.booki.sputnikDispatcherURL = "/_sputnik/";

      $("#dialog-sputnik-error").dialog({
          modal: true,
          autoOpen: false,
          buttons: {
            Ok: function() {
               $(this).dialog('close');
               window.location = '.';
            }
          }
      });
  
      $("FORM.messagefield").messagefield('init', {'view_post': '/messaging/post' });  
  });
</script>


   
 <title>/chapter: Johdanto / Firefox suomeksi</title>
 <link type="text/css" href="/site_static/css/draft.css" rel="Stylesheet" />

 <link rel="alternate" type="application/rss+xml" title="RSS feed for Firefox suomeksi" href="/feeds/rss/book/firefox-suomeksi/" /> 
 <link rel="alternate" type="application/atom+xml" title="Atom feed for Firefox suomeksi" href="/feeds/atom/book/firefox-suomeksi/" /> 

 <link rel="alternate" type="application/rss+xml" title="RSS feed for chapter Johdanto" href="/feeds/rss/chapter/firefox-suomeksi/firefox-suomeksi/" /> 
 <link rel="alternate" type="application/atom+xml" title="Atom feed for chapter Johdanto" href="/feeds/atom/chapter/firefox-suomeksi/firefox-suomeksi/" /> 
 
 <script type="text/javascript" src="/site_static/js/draft.js"></script>


   <link type="text/css" href="/static/css/_user.css" rel="Stylesheet" >
 </head>
<body>

<div class="topbar"> 
  <div class="logotext"><a href="http://write.flossmanuals.net/">FLOSS Manuals</a> </div>

  <div class="meta-bar">
    
    <ul>
      <li>
        <a href="/accounts/signin/?redirect=/firefox-suomeksi/_draft/_v/1.0/johdanto/">Sign In / Create Account</a>
      </li>
    </ul>
    
    <div style="padding-top: 10px; padding-right: 15px;">
      <br/>
      

<script>
  $(function() {
    var $frm = $("FORM[name=changelang]");
	
    $("A[href=#]", $frm).click(function() {
        var lang = $(this).attr("class").substr(4);
	
        $("INPUT[name=language]", $frm).val(lang);
        $frm.submit();
	
        return false;
    });
  });
 </script>

<form name="changelang" method="POST" action="/accounts/i18n/setlang/?language=en-us">
  <input type="hidden" name="language" value="en-us">
  
    &nbsp;English&nbsp;|
  
  
  
    &nbsp;<a class="langes" href="#">Español</a>&nbsp;|
  

  
    &nbsp;<a class="langfr" href="#">Français</a>&nbsp;|
  
	
  
    &nbsp;<a class="langit" href="#">Italiano</a>&nbsp;|
  
	
  
    &nbsp;<a class="langpt" href="#">Português</a>&nbsp;|
  
	
  
    &nbsp;<a class="langru" href="#">Русский</a>&nbsp;|
  
	
  
    &nbsp;<a class="langsq" href="#">Shqip</a>
  	
</form>

    </div>
    
    
  </div><!-- End of .meta-bar -->
</div><!-- End top bar -->

<div class="menubar shadow">
  
  
  <div class="navbox">
    <ul>
      <li><a href="/list-books/">Books</a></li>
      <li><a href="/list-groups/">Groups</a></li>
      <li><a href="/list-people/">People</a></li>
    </ul>      
  </div><!-- End of .navbox -->       
</div>

<div class="content-container">
  <div class="content shadow">
    <!-- Content box and the drop shadow-->
    

<h2>Firefox suomeksi</h2>
<div class="padded">
 <div id="bookmenu" style="background: url(/site_static/images/draft_bg.png) repeat !important;"> 
  <ul>
   
    
      <li><a href="/firefox-suomeksi/_draft/_v/1.0/johdanto/">Johdanto</a></li>
    
   
    
      <li><a href="/firefox-suomeksi/_draft/_v/1.0/tasta-kayttooppaasta/">Tästä käyttöoppaasta</a></li>
    
   
    
      <li><a href="/firefox-suomeksi/_draft/_v/1.0/ennen-kuin-aloitat/">Ennen kuin aloitat</a></li>
    
   
    
      <li><a href="/firefox-suomeksi/_draft/_v/1.0/avoimen-lahdekoodin-esittely/">Avoimen lähdekoodin esittely</a></li>
    
   
    
      <li><a href="/firefox-suomeksi/_draft/_v/1.0/kuinka-verkko-toimii/">Kuinka verkko toimii</a></li>
    
   
    
      <li><a href="/firefox-suomeksi/_draft/_v/1.0/asennus/">Asennus</a></li>
    
   
    
      <li><a href="/firefox-suomeksi/_draft/_v/1.0/asennus-windowsiin/">Asennus Windowsiin</a></li>
    
   
    
      <li><a href="/firefox-suomeksi/_draft/_v/1.0/asennus-ubuntuun/">Asennus Ubuntuun</a></li>
    
   
    
      <li><a href="/firefox-suomeksi/_draft/_v/1.0/firefoxin-paivittaminen/">Firefoxin päivittäminen</a></li>
    
   
    
      <li><a href="/firefox-suomeksi/_draft/_v/1.0/peruskaytto/">Peruskäyttö</a></li>
    
   
    
      <li><a href="/firefox-suomeksi/_draft/_v/1.0/kayttoliittyma/">Käyttöliittymä</a></li>
    
   
    
      <li><a href="/firefox-suomeksi/_draft/_v/1.0/osoiterivi/">Osoiterivi</a></li>
    
   
    
      <li><a href="/firefox-suomeksi/_draft/_v/1.0/tiedostojen-lataaminen/">Tiedostojen lataaminen</a></li>
    
   
    
      <li><a href="/firefox-suomeksi/_draft/_v/1.0/sivujen-kopiointi-lataaminen-ja-tulostaminen/">Sivujen kopiointi, lataaminen ja tulostaminen</a></li>
    
   
    
      <li><a href="/firefox-suomeksi/_draft/_v/1.0/muokkaa-tyokalupalkkia/">Muokkaa työkalupalkkia</a></li>
    
   
    
      <li><a href="/firefox-suomeksi/_draft/_v/1.0/ominaisuudet/">Ominaisuudet</a></li>
    
   
    
      <li><a href="/firefox-suomeksi/_draft/_v/1.0/lisaosat/">Lisäosat</a></li>
    
   
    
      <li><a href="/firefox-suomeksi/_draft/_v/1.0/lisaosien-hallinta/">Lisäosien hallinta</a></li>
    
   
    
      <li><a href="/firefox-suomeksi/_draft/_v/1.0/firefoxin-teemat/">Firefoxin teemat</a></li>
    
   
    
      <li><a href="/firefox-suomeksi/_draft/_v/1.0/sivupalkkien-kaytto/">Sivupalkkien käyttö</a></li>
    
   
    
      <li><a href="/firefox-suomeksi/_draft/_v/1.0/yksityisyys-ja-turvallisuus/">Yksityisyys ja turvallisuus</a></li>
    
   
    
      <li><a href="/firefox-suomeksi/_draft/_v/1.0/yksityisyys-firefoxissa/">Yksityisyys Firefoxissa</a></li>
    
   
    
      <li><a href="/firefox-suomeksi/_draft/_v/1.0/tekijat/">Tekijät</a></li>
    
   
    
      <li><a href="/firefox-suomeksi/_draft/_v/1.0/tekijat/">Tekijät</a></li>
    
   
  </ul>
 </div>
 <div id="bookcontent"   style="background: url(/site_static/images/draft_bg.png) repeat !important;">
   

  <html lang="fi"><head><title>Johdanto</title></head><body><h1>Johdatus Firefoxiin</h1>
<div id="content">
<p>Oletamme, ett&#228; et lukisi t&#228;t&#228; opasta, ellet jo tiet&#228;isi mik&#228; nettiselain oikein on. Jos et kuitenkaan tied&#228;, kyse on ohjelmistosta, jonka avulla voit katsella ja selata nettisivuja internetiss&#228;.</p>
<p>Internet on massiivinen toisiinsa liittyneist&#228; tietokoneista koostuva verkosto. Se on kehittynyt alunperin vuonna 1969 toisiinsa yhdistetyist&#228; nelj&#228;st&#228; tietokoneesta yli miljardi j&#228;rjestelm&#228;&#228; kattavaksi verkoksi, jonka kasvu jatkuu edelleen.</p>
<p>Osaa internetiin yhdistetyist&#228; tietokoneista kutsutaan "verkkopalvelimiksi". N&#228;m&#228; erikoistuneet tietokoneet suorittavat&#160; palvelinohjelmistoja, joiden avulla ne toimittavat nettisivuja muille tietokoneille. Internetin laajan verkkopalvelinten verkoston ansiosta k&#228;ytt&#228;jien ulottuvilla on yli kymmenen miljardia erilaista nettisivua sek&#228; suuri joukko jatkuvasti kasvavia ja kehittyvi&#228; sis&#228;lt&#246;j&#228; ja palveluja. Jos haluat hy&#246;dynt&#228;&#228; n&#228;it&#228; sivustoja omalla tietokoneellasi, kannettavallasi tai k&#228;nnyk&#228;ll&#228;si, tarvitset tietokoneohjelman, joka osaa avata ne. Se tietokoneohjelma on nettiselain.</p>
<p><img src="http://fi.flossmanuals.net/kirjoita/firefox/_draft/_v/1.0/static/Firefox-Introduction-one_fi-fi.png" alt="one_fi.png" width="462" height="186">&#160;</p>
<h2>Nettiselailun historia</h2>
<p>&#160;</p>
<p>Selaimilla on ollut yksi julkisimmista ja mielenkiintoisimmista kehityskaarista tietokoneohjelmistojen historiassa.</p>
<p>Nettiselaamisen historian voidaan katsoa alkavan vuonna 1993 ilmestyneest&#228; Mosaicista, joka oli ensimm&#228;inen tekstin ohella my&#246;s kuvien n&#228;ytt&#228;miseen kykenev&#228; selain. T&#228;st&#228; innovaatiosta alkoi World Wide Webin nousu kohti nykyaikaista interneti&#228;, joten Mosaic todellakin muutti maailmaa.</p>
<p>Vuonna 1994 Marc Andreessen sek&#228; joukko Mosaicin alkuper&#228;isi&#228; kehitt&#228;ji&#228; perusti yhdess&#228; liikemies Jim Clarkin kanssa Netscapen, joka oli ensimm&#228;isi&#228; internet-liiketoimintaan keskittyvi&#228; yrityksi&#228;. Kasvava internet houkutteli monia muitakin yritt&#228;ji&#228;, ja pian internetiin keskittyvi&#228; yrityksi&#228; alkoi synty&#228; enemm&#228;nkin. N&#228;it&#228; internetin ja kaupallisen selainkehityksen alkuaikoja kuvastivatkin kehitt&#228;jien suuri innostus sek&#228; useat innovaatiot, jotka jatkuvasti laajensivat ja paransivat internetin tarjoamaa informaatiota. Tuloksena uusia internet-sivustoja nousi julkisuuteen l&#228;hes joka viikko ja selaimiin lis&#228;ttiin jatkuvasti uusia ominaisuuksia. Er&#228;s Wired Magazine -lehden artikkeli (<a href="http://www.wired.com/wired/archive/2.10/mosaic.html" target="_top">http://www.wired.com/wired/archive/2.10/mosaic.html</a>) onnistui kuvaamaan t&#228;t&#228; selainten ja internetin nopean kehityksen alkuaikojen aikaansaamaa innostusta.</p>
<p>&#160;</p>
<p>&#160;</p>
<p>Mosaic ja my&#246;hemmin sen seuraaja Netscape Navigator olivat markkinoiden ensimm&#228;iset nettiselaimet, mutta ne eiv&#228;t kuitenkaan onnistuneet valtaamaan nopeasti kasvavia selainmarkkinoita. Suhteellisen lyhyen ja aggressiivisen "selainsodan" j&#228;lkeen selainten markkinajohtajaksi nousikin Microsoftin Internet Explorer (IE). Microsoftin aggressiiviset liiketoimintaratkaisut sek&#228; yli 100 miljoonan dollarin panostus Explorerin kehitykseen ja markkinointiin toivat t&#228;lle aikaisemmin k&#228;ytt&#246;j&#228;rjestelmist&#228;&#228;n tunnetulle ohjelmistoj&#228;tille noin 96 % osuuden selainmarkkinoista. Saavutettuaan markkinajohdon Microsoft ei pit&#228;nyt selaimen kehitt&#228;mist&#228; en&#228;&#228; kannattavana, joten Internet Explorerin kehitysty&#246;t&#228; alettiin v&#228;hent&#228;&#228; vuosina 2002 ja 2003. Vuonna 2003 Microsoft ilmoitti, ettei Internet Explorerista en&#228;&#228; julkaistaisi uusia itsen&#228;isi&#228; versioita (<a href="http://www.usdoj.gov/atr/cases/ms_index.htm" target="_top">http://www.usdoj.gov/atr/cases/ms_index.htm</a>).</p>
<p>&#160;</p>
<p>Vaikka osa Microsoftin "selainsotien" aikana k&#228;ytt&#228;mist&#228; keinoista tuomittiin my&#246;hemmin kartellilakien vastaisiksi (<a href="http://www.usdoj.gov/atr/cases/ms_index.htm" target="_top">http://www.usdoj.gov/atr/cases/ms_index.htm</a>), Internet Explorerin asema vaikutti ylivoimaiselta. Kun Microsoft lopetti selaimensa kehityksen, Netscape oli ly&#246;ty ja monet verkkosivut k&#228;yttiv&#228;t ponnahdusikkunoihin perustuvia mainoksia ja kohdistamattomia mainoskampanjoita. Jotkut pitiv&#228;t vuosia 2001-2004 internetin ja selainten kehityksen pime&#228;n&#228; keskiaikana.</p>
<h2>Firefoxin kehitys</h2>
<p>&#160;</p>
<p>&#160;</p>
<p>Uuden luvun selainten tarinaan lis&#228;si kuitenkin Firefox, jota voidaan pit&#228;&#228; Mosaicin ja Netscapen kaukaisena j&#228;lkel&#228;isen&#228;.</p>
<p>Vuonna 1998 Netscape perusti Mozilla Projectin ja antoi kokeellisena liikestrategiana selaimensa l&#228;hdekoodin vapaaseen levitykseen saavuttaakseen kilpailuedun Microsoftia vastaan. Tuloksena ohjelmoijat ymp&#228;ri maailman p&#228;&#228;siv&#228;t paitsi tutkimaan Mozillan koodia ja seuraamaan sen kehityst&#228;, my&#246;s osallistumaan itse sen kehitt&#228;miseen. My&#246;s Netscape ja AOL (joka oli hankkinut Netscapen) jatkoivat tiiviisti Mozilla-selaimen kehityst&#228; ja julkaisivat useita Netscape- ja AOL-tuotteita, jotka hy&#246;dynsiv&#228;t sen koodia. AOL:n kiinnostus selainkehityst&#228; kohtaan kuitenkin hiipui, ja vuoden 2003 alussa yhti&#246; p&#228;&#228;ttikin v&#228;hent&#228;&#228; omaa sitoutumistaan, mink&#228; johdosta Mozilla projekti vapautui omille urilleen.</p>
<p>&#160;</p>
<p>Vuonna 2003 luotiin Mozilla Foundation, yleishy&#246;dyllinen ja t&#228;ysin itsen&#228;inen organisaatio, jonka p&#228;&#228;m&#228;&#228;r&#228;n&#228; oli tukea Mozilla-hankkeen kehityst&#228;. Tuloksena Mozillan ymp&#228;rille kasvaneen yhteis&#246;n oli viimein mahdollista hy&#246;dynt&#228;&#228; Netscapen aikaisempaa panostusta selainkehitykseen ja j&#228;tt&#228;&#228; n&#228;in oma j&#228;lkens&#228; nettiselainten historiaan.</p>
<p>Ensit&#246;ikseen intohimoinen Mozilla-yhteis&#246; keskittyi luomaan uuden sukupolven selaimen, joka sai nimekseen Firefox. Firefoxin tavoite oli yksinkertainen: luoda kevyt selain, jota oli nopea ja helppo k&#228;ytt&#228;&#228;. Se asettaisi k&#228;ytt&#228;j&#228;n uudelleen nettisurffauskokemuksen ohjaajaksi. Se ei vaarantaisi selaimen k&#228;ytt&#246;kokemusta turhilla &#228;rsytt&#228;vyyksill&#228;. Siihen lis&#228;tt&#228;isiin my&#246;s laajennusj&#228;rjestelm&#228;, jonka avulla k&#228;ytt&#228;j&#228;t voisivat muokata, testata ja viritt&#228;&#228; selainta tuhansilla erilaisilla tavoilla.</p>
<p>&#160;</p>
<p><img src="http://fi.flossmanuals.net/kirjoita/firefox/_draft/_v/1.0/static/Firefox-Introduction-all_web_update_notes_1_fi-fi.png" alt="all_web_update_notes_1_fi.png" width="899" height="590"></p>
<p>&#160;</p>
<p>&#160;</p>
<p>Firefox 1.0 julkaistiin vuonna 2004, mist&#228; l&#228;htien sen k&#228;ytt&#228;jien m&#228;&#228;r&#228; on kasvanut tasaisesti. Vuoteen 2009 menness&#228; Firefox oli saavuttanut noin 23 prosentin osuuden maailmanlaajuisista selainmarkkinoista, eli maailman 1,2 miljardista internetin k&#228;ytt&#228;j&#228;st&#228; yli 300 miljoonaa k&#228;ytti selaimenaan Firefoxia. Firefox 3:n julkaisup&#228;iv&#228;n&#228; yli 8 miljoonaa k&#228;ytt&#228;j&#228;&#228; latasi uuden version yhden p&#228;iv&#228;n aikana.</p>
<p>&#160;</p>
<p>Firefox jatkaa edelleen innovointia. Firefox auttaa sinua itse ohjaamaan&#160;miten vuorovaikutat internetin kanssa. T&#228;m&#228;n mahdollistavat lukuisat ominaisuudet, kuten helppo tapa tilata automaattisesti p&#228;ivittyvi&#228; uutisotsikoita; kotisivuv&#228;lilehdet, jotka auttavat p&#228;&#228;sem&#228;&#228;n netin sis&#228;lt&#246;ihin nopeammin; sis&#228;&#228;nrakennettu ponnahdusikkunoiden torjunta; sek&#228; alati laajeneva joukko lis&#228;osia, joilla voit muokata selainta oman makusi mukaan. Firefox on her&#228;tt&#228;nyt uudelleen henkiin kiinnostuksen nettiselainten kehityst&#228; kohtaan.</p>
<p>&#160;</p>
<p>Vastauksena Firefoxille Microsoft muutti suunnitelmiaan, k&#228;ynnisti selainkehityksens&#228; uudelleen &#160;ja julkaisi Internet Explorer 7:n ja hiljattain IE8:n. My&#246;s Apple ja Google ovat alkaneet kehitt&#228;&#228; omia selaimiaan (Safari ja Chrome). Innovaatio ja valinnanvapaus ovat palaamassa selainten ja internetin maailmaan.</p>
<p>Firefox toimii miss&#228; tahansa k&#228;ytt&#246;j&#228;rjestelm&#228;ss&#228;, ja se on lokalisoitu yli 75:lle eri kielelle. Sen on rakentanut maailmanlaajuinen kehitt&#228;jien yhteis&#246;, joka suhtautuu selainten kehitykseen ja internetiin intohimoisesti. Ja mik&#228; parasta, Firefox on <em><strong>vapaa</strong></em>!&#160;</p>
</div></body></html>
   
  </div>
 </div>


  </div>
</div>
<!-- End of content -->



<!-- sputnik error page -->
<div id="dialog-sputnik-qrac" style="display: none"></div>
<div id="dialog-sputnik-error" title="Can't communicate with booktype">
  <p>
    <span class="ui-icon ui-icon-circle-check" style="float:left; margin:0 7px 50px 0;"></span>
    There has been error in communication with Booktype server.
    Not sure right now where is the problem.
  </p>
  <p>
    You should refresh this page.
  </p>
</div>


<ul class="strings template">
 <li class="ok">OK</li>
 <li class="back">Back</li>
 <li class="create">Create</li>
 <li class="cancel">Cancel</li>
 <li class="next">Next</li>
 <li class="import">Import</li>
 <li class="savechanges">Save changes</li>
 <li class="errorcreategroup">Couldn't create a group!</li>
 <li class="msgepub">enter epub URL</li>
 <li class="msgarchive">enter Archive.org ID</li>
 <li class="msgwiki">enter Wikibooks URL</li>
 <li class="msgbooktype">enter Booktype URL</li>
 <li class="deletebook">Delete book</li>
</ul>

</body>
</html>

