
<!DOCTYPE HTML>
<html>
 <head>
   

<link type="text/css" href="/site_static/css/booki.css" rel="Stylesheet" >
<link type="text/css" href="/site_static/js/jquery/themes/base/jquery.ui.all.css" rel="Stylesheet" >
<link type="text/css" href="/site_static/js/jquery/themes/smoothness/jquery.ui.all.css" rel="Stylesheet" >
<script type="text/javascript" src="/site_static/js/jquery/jquery-1.4.4.js"></script>
<script type="text/javascript" src="/site_static/js/jquery/ui/jquery-ui-1.8.10.custom.js"></script>
<script type="text/javascript" src="/site_static/js/jquery.json-1.3.js"></script>
<script type="text/javascript" src="/site_static/js/booki.js"></script>
<script src="/site_static/js/messaging.js" type="text/javascript"></script>   
<script type="text/javascript" src="/site_static/js/general.js"></script>
<link href="/site_static/css/jquery.bubblepopup.v2.3.1.css" rel="stylesheet" type="text/css" />
<link type="text/css" href="/site_static/css/jquery-ui_overrides.css" rel="Stylesheet" >
<script src="/site_static/js/jquery.bubblepopup.v2.3.1.min.js" type="text/javascript"></script>

<link rel="SHORTCUT ICON" href="http://write.flossmanuals.net/site_static/images/favicon.ico" type="image/x-icon">
<meta property="og:site_name" content="FLOSS Manuals"/><meta name="description" content="Free Manuals for Freedom"/>

<script type="text/javascript">
  $(function() {
      $.booki.sputnikDispatcherURL = "/_sputnik/";

      $("#dialog-sputnik-error").dialog({
          modal: true,
          autoOpen: false,
          buttons: {
            Ok: function() {
               $(this).dialog('close');
               window.location = '.';
            }
          }
      });
  
      $("FORM.messagefield").messagefield('init', {'view_post': '/messaging/post' });  
  });
</script>


   
 <title>/chapter: Teksturointi / Blender suomeksi</title>
 <link type="text/css" href="/site_static/css/draft.css" rel="Stylesheet" />

 <link rel="alternate" type="application/rss+xml" title="RSS feed for Blender suomeksi" href="/feeds/rss/book/blender-suomeksi/" /> 
 <link rel="alternate" type="application/atom+xml" title="Atom feed for Blender suomeksi" href="/feeds/atom/book/blender-suomeksi/" /> 

 <link rel="alternate" type="application/rss+xml" title="RSS feed for chapter TEKSTUROINTI" href="/feeds/rss/chapter/blender-suomeksi/blender-suomeksi/" /> 
 <link rel="alternate" type="application/atom+xml" title="Atom feed for chapter TEKSTUROINTI" href="/feeds/atom/chapter/blender-suomeksi/blender-suomeksi/" /> 
 
 <script type="text/javascript" src="/site_static/js/draft.js"></script>


   <link type="text/css" href="/static/css/_user.css" rel="Stylesheet" >
 </head>
<body>

<div class="topbar"> 
  <div class="logotext"><a href="http://write.flossmanuals.net/">FLOSS Manuals</a> </div>

  <div class="meta-bar">
    
    <ul>
      <li>
        <a href="/accounts/signin/?redirect=/blender-suomeksi/_draft/_v/1.0/teksturointi/">Sign In / Create Account</a>
      </li>
    </ul>
    
    <div style="padding-top: 10px; padding-right: 15px;">
      <br/>
      

<script>
  $(function() {
    var $frm = $("FORM[name=changelang]");
	
    $("A[href=#]", $frm).click(function() {
        var lang = $(this).attr("class").substr(4);
	
        $("INPUT[name=language]", $frm).val(lang);
        $frm.submit();
	
        return false;
    });
  });
 </script>

<form name="changelang" method="POST" action="/accounts/i18n/setlang/?language=en-us">
  <input type="hidden" name="language" value="en-us">
  
    &nbsp;English&nbsp;|
  
  
  
    &nbsp;<a class="langes" href="#">Español</a>&nbsp;|
  

  
    &nbsp;<a class="langfr" href="#">Français</a>&nbsp;|
  
	
  
    &nbsp;<a class="langit" href="#">Italiano</a>&nbsp;|
  
	
  
    &nbsp;<a class="langpt" href="#">Português</a>&nbsp;|
  
	
  
    &nbsp;<a class="langru" href="#">Русский</a>&nbsp;|
  
	
  
    &nbsp;<a class="langsq" href="#">Shqip</a>
  	
</form>

    </div>
    
    
  </div><!-- End of .meta-bar -->
</div><!-- End top bar -->

<div class="menubar shadow">
  
  
  <div class="navbox">
    <ul>
      <li><a href="/list-books/">Books</a></li>
      <li><a href="/list-groups/">Groups</a></li>
      <li><a href="/list-people/">People</a></li>
    </ul>      
  </div><!-- End of .navbox -->       
</div>

<div class="content-container">
  <div class="content shadow">
    <!-- Content box and the drop shadow-->
    

<h2>Blender suomeksi</h2>
<div class="padded">
 <div id="bookmenu" style="background: url(/site_static/images/draft_bg.png) repeat !important;"> 
  <ul>
   
    
      <li><b>Johdanto</b></li>
    
   
    
      <li><a href="/blender-suomeksi/_draft/_v/1.0/johdanto/">JOHDANTO</a></li>
    
   
    
      <li><b>Asennus</b></li>
    
   
    
      <li><a href="/blender-suomeksi/_draft/_v/1.0/asennus-windowsiin/">ASENNUS WINDOWSIIN</a></li>
    
   
    
      <li><b>Käytännöt</b></li>
    
   
    
      <li><a href="/blender-suomeksi/_draft/_v/1.0/kaytannot/">KÄYTÄNNÖT</a></li>
    
   
    
      <li><b>Käyttöliittymä</b></li>
    
   
    
      <li><a href="/blender-suomeksi/_draft/_v/1.0/kayttoliittyma/">KÄYTTÖLIITTYMÄ</a></li>
    
   
    
      <li><b>Asetukset</b></li>
    
   
    
      <li><a href="/blender-suomeksi/_draft/_v/1.0/asetukset/">ASETUKSET</a></li>
    
   
    
      <li><b>Editointi</b></li>
    
   
    
      <li><a href="/blender-suomeksi/_draft/_v/1.0/editointi/">EDITOINTI</a></li>
    
   
    
      <li><a href="/blender-suomeksi/_draft/_v/1.0/esineen-luominen/">ESINEEN LUOMINEN</a></li>
    
   
    
      <li><b>Tekstuurit</b></li>
    
   
    
      <li><a href="/blender-suomeksi/_draft/_v/1.0/teksturointi/">TEKSTUROINTI</a></li>
    
   
    
      <li><b>Renderöinti</b></li>
    
   
    
      <li><a href="/blender-suomeksi/_draft/_v/1.0/renderointi/">RENDERÖINTI</a></li>
    
   
    
      <li><b>Tekijät</b></li>
    
   
    
      <li><a href="/blender-suomeksi/_draft/_v/1.0/tekijat/">TEKIJÄT</a></li>
    
   
  </ul>
 </div>
 <div id="bookcontent"   style="background: url(/site_static/images/draft_bg.png) repeat !important;">
   

  <h1><span style="font-size: 2em;">TEKSTUURIT BLENDERISS&Auml;</span></h1>
<p>T&auml;ss&auml; luvussa opimme Blenderin tekstuurien perusteet. T&auml;m&auml; luku ei keskity lainkaan materiaaleihin. Sen sijaan keskitymme ainoastaan raakojen kuvien asettamiseen verkkosi tahkoihin, verkon valaistukseen ja lopputuloksen render&ouml;intiin. T&auml;h&auml;n on kaksi syyt&auml;: materiaalit ovat monimutkainen aihe ja t&auml;ss&auml; tekem&auml;mme asiat ovat riitt&auml;vi&auml; k&auml;ytett&auml;v&auml;ksi reaaliaikaisissa kolmiulotteisissa projekteissa - kuten Blenderin pelimoottorissa. Seuraava luku keskittyy materiaalien kanssa ty&ouml;skentelyyn ja kehittyneemp&auml;&auml;n render&ouml;intiin.</p>
<p>Tahkoilla on muoto, koko, sijainti avaruudessa ja jopa paikallinen orientaatio. Yksik&auml;&auml;n n&auml;ist&auml; asioista ei kuitenkaan auta meit&auml; m&auml;&auml;rittelem&auml;&auml;n kuinka tekstuurit piirret&auml;&auml;n n&auml;iden tahkojen pinnalle. T&auml;t&auml; varten tarvitsemme j&auml;rjestelm&auml;n, joka on tarkoitettu kartoittamaan tekstuuridataa verkon pinnalle. T&auml;m&auml;n vuoksi keksittiin UV-kartoitus. Kartoitusta on paras ajatella kuvitteellisena kaksi- tai kolmiulotteisena muotona, jonka p&auml;&auml;lle tekstuuri projisoidaan ennen kuin sit&auml; sovelletaan verkkoon itseens&auml;. Ajattelemalla projisointityyppi&auml; muutamme tapaa, jolla tekstuurit piirret&auml;&auml;n pinnalle. Kun olemme valinneet UV-kartoituksen voimme manipuloida sit&auml; (skaalata, kieritt&auml;&auml;, editoida jne.) riippumatta verkosta, joten muutamme tapaa, jolla tekstuuri piirret&auml;&auml;n varsinaiselle verkkopinnalle.&nbsp;</p>
<p>Yksinkertaisin tapa ymm&auml;rt&auml;&auml; t&auml;m&auml; on ett&auml; "U" ja "V" "UV-kartoituksessa" ovat erikoisarvoja, jotka viittaavat sijaintiin annetun verkon pinnalla, aivan kuin X ja Y ovat sijainteja kuvitteellisella tasolla kolmiulotteisessa maailmassa itsess&auml;&auml;n. Yksinkertaisimmillaan UV-kartoitus on kartoitusta tahko kerrallaan, jossa tekstuuri yksinkertaisesti piirret&auml;&auml;n jokaiselle verkon tahkolle; t&auml;m&auml; on oletusarvo Blenderiss&auml;. Muut UV-kartoituksen tyypit kuvataan alla.</p>
<p>Verkon asettaminen valmiiksi tekstuuria varten vaatii ymm&auml;rt&auml;m&auml;&auml;n tekstuuriv&auml;lilehte&auml; editointipaneelissa. UV-asetukset m&auml;&auml;ritell&auml;&auml;n editointipaneelissa, koska editoimme verkon ominaisuutta, sen UV-dataa.</p>
<h2>Tahkojen valitseminen</h2>
<p>Katso aluksi, ett&auml; editointitilassa (<strong>Edit Mode</strong>) ollessasi kaikki tahkosi ovat valittuna.</p>
<p><img src="static/ScreenHunter_01%20Apr.%2017%2019.35.gif" alt="" /></p>
<p>Siirry nyt <strong>UV/Image Editor</strong> -muokkaustilaantilaan.</p>
<p><img src="static/ScreenHunter_02%20Apr.%2017%2019.38.gif" alt="" /></p>
<p>Lataa alla oleva kuvatiedosto ja tallenna se samaan kansioon, johon olet laittanut tuolisi .blend-tiedoston.</p>
<p class="c2"><img class="c1" src="static/Blender-Texturing-wood1_sml_en-fi.png" alt="wood1_sml.png" width="320" height="245" /></p>
<p>Valitse oikealla olevasta tekstuurin tyyppi -valikosta tekstuurityyppi Image or Movie (kuva tai elokuva).</p>
<p><img src="static/ScreenHunter_05%20Apr.%2017%2019.45.gif" alt="" /></p>
<p>Alempana kohdassa Image on Open-nappi, josta voit avata &auml;sken kovalevyllesi tallentamasi kuvatiedoston.</p>
<p>&nbsp;</p>
<p><img src="static/ScreenHunter_06%20Apr.%2017%2019.46.gif" alt="" />&nbsp;</p>
<p>Avautuu tiedostoselain, josta voit valita tallentamasi tekstuuritiedoston.</p>
<p>Nyt voit valita kuvaikkunan alapuolella olevasta napista &auml;sken valitsemasi tiedoston tekstuuriksi.</p>
<p><img src="static/ScreenHunter_07%20Apr.%2017%2019.53.gif" alt="" /></p>
<p>Siirry valikosta takaisin kolmiulotteiseen n&auml;kym&auml;&auml;n (<strong>3D View</strong>).</p>
<p><img src="static/ScreenHunter_13%20Apr.%2017%2019.56.gif" alt="" /></p>
<p>&nbsp;</p>
<p>Nyt voit siirt&auml;&auml; tekstuurit n&auml;kym&auml;&auml;n kolmiulotteisessa n&auml;kym&auml;ss&auml; valitsemalla valikosta <strong>Viewport Shading</strong> (n&auml;k&ouml;ikkunan varjostus) valinnan <strong>Textured </strong>(teksturoitu).</p>
<p>&nbsp;</p>
<p><img src="static/ScreenHunter_14%20Apr.%2017%2019.59.gif" alt="" />&nbsp;</p>
<p>Nyt tuolisi pit&auml;isi olla teksturoitu.</p>
<p><img src="static/ScreenHunter_15%20Apr.%2017%2020.02.gif" alt="" /></p>
<p><img src="file:///C:/Users/TOMITO~1/AppData/Local/Temp/moz-screenshot.png" alt="" /></p>
<h2>UV-projektiotyypit</h2>
<p>Kun olet muokkaustilassa, voit helposti ottaa k&auml;ytt&ouml;&ouml;n uuden projektion k&auml;ytt&auml;en UV-kartoitusvalikkoa (UV Mapping), johon p&auml;&auml;set U-n&auml;pp&auml;imell&auml;.</p>
<p>&nbsp;<img src="static/ScreenHunter_16%20Apr.%2017%2021.09.gif" alt="" /></p>
<p>Sielt&auml; l&ouml;yd&auml;t joukon erilaisia projektiotyyppej&auml;:</p>
<p><strong>Unwrap (Poista k&auml;&auml;riminen)</strong></p>
<blockquote>
<blockquote>
<p>Projektiopinta on kuvitteellinen "k&auml;&auml;rim&auml;t&ouml;n" versio verkosta. K&auml;&auml;rim&auml;tt&ouml;m&auml;ss&auml; verkossa tahkot jaetaan kaksiulotteiselle tasolle, jossa on mahdollisimman v&auml;h&auml;n h&auml;iri&ouml;it&auml; tai p&auml;&auml;llekk&auml;isyyksi&auml;, riippuen laskentatehosta. Tekstuuri projisoidaan sitten t&auml;lle pinnalle. T&auml;m&auml; on menetelm&auml;, jota k&auml;ytet&auml;&auml;n hyvin tarkkaan teksturointity&ouml;h&ouml;n.</p>
</blockquote>
<blockquote>
<p>Hyv&auml; tapa "k&auml;&auml;reiden poiston" kuvittelemiseen on ajatella maapallon paljasta karttaa, joka on k&auml;&auml;rim&auml;t&ouml;n pallo, jossa on niin v&auml;h&auml;n v&auml;&auml;ristymi&auml; kuin matemaattisesti mahdollista. T&auml;t&auml; tietty&auml; k&auml;&auml;rim&auml;tt&ouml;myytt&auml; kutsutaan nimell&auml; Goodes Interrupted Homolosine Projection.</p>
<p>&nbsp;</p>
</blockquote>
</blockquote>
<p><strong>Cube Projektion (kuutioprojektio) <br /></strong></p>
<blockquote>
<blockquote>
<p>Projisoi tekstuurin kuvitteellisen kuution p&auml;&auml;lle. Kuutio on linjassa globaaliakselien X, Y ja Z kanssa. Etsii sen j&auml;lkeen kaikki tahkot todellisessa verkossa, jotka ovat l&auml;himp&auml;n&auml; t&auml;m&auml;n kuutio-objektin kuutta sivua, ja piirt&auml;&auml; tekstuurin tahkoille vastaavasti.</p>
</blockquote>
</blockquote>
<p><strong>Cylinder Projection (lieri&ouml;projektio)</strong></p>
<blockquote>
<blockquote>
<p>Lieri&ouml;projektio kartoittaa ensin tekstuurin lieri&ouml;n p&auml;&auml;lle, jolla on sama orientaatio kuin kuvaikkunalla, ennen kuin projisoi sen aktiiviselle tahkolle.&nbsp;</p>
</blockquote>
</blockquote>
<p><strong>Sphere Projection (palloprojektio) <br /></strong></p>
<blockquote>
<blockquote>
<p>Pelloprojektio kartoittaa ensin tekstuurin pallolle, jolla on sama orientaatio kuin kuvaikkunalla, ennen kuin projisoi sen aktiiviselle tahkolle.</p>
</blockquote>
</blockquote>
<p><strong>Project From View (projisointi n&auml;k&ouml;kulmasta) <br /></strong></p>
<blockquote>
<blockquote>
<p>Projisointi n&auml;k&ouml;kulmasta (Project from View) kartoittaa tekstuurin n&auml;k&ouml;tasolle jokaiselle toistuvalle tiilelle ja projisoi sen sitten suoraan aktiiviselle tahkolle.</p>
</blockquote>
</blockquote>
<p>Huomaa, ett&auml; projektiotyypit projisoidaan verkkoon kohtisuoraan n&auml;k&ouml;tasoa vasten. Kuvittele kuvaikkunan olevan kuin katsoisit suoraan kameran linssin l&auml;pi. N&auml;kym&auml;n taso on loputtoman suuri kuvitteellinen taso, joka on samalla tasolla linssin pinnan kanssa. Eli taso on yhdensuuntainen kuvaikkunan tangentin kanssa.</p>
<h2>UV-kartoituksien muokkaaminen</h2>
<p><strong>UV/Image Editor </strong>-tilassa (UV/kuvaeditorissa) tahkoja manipuloidaan paljolti samalla tavalla kuin verkkojakin: niiss&auml; on verteksej&auml;, jotka voidaan valita yksitt&auml;in ja siirt&auml;&auml; ymp&auml;riins&auml; <strong>G-n&auml;pp&auml;imell&auml;</strong>, tahkoja voidaan kieritt&auml;&auml;<strong> R-n&auml;pp&auml;imell&auml;</strong>, skaalata <strong>S-n&auml;pp&auml;imell&auml;</strong> ja niin edelleen.</p>
<p><img src="static/ScreenHunter_17%20Apr.%2017%2022.00.gif" alt="" width="515" height="396" /></p>
<p>UV-tahkojen muutokset p&auml;ivitet&auml;&auml;n v&auml;litt&ouml;m&auml;sti verkkoihin kuvaikkunassa.</p>
<h2>UV-tekstuurieditorin navigointi</h2>
<p>Vaikka et (tietenk&auml;&auml;n) voi kieritt&auml;&auml; n&auml;k&ouml;kulmaa, voit vet&auml;&auml; n&auml;k&ouml;kulmaa ymp&auml;riins&auml; ja jopa zoomata. K&auml;yt&auml; t&auml;h&auml;n samoja ohjaimia kuin kolmiulotteisessa n&auml;kym&auml;ss&auml; (<strong>3D View</strong>).</p>
<h2>Tekstuurien p&auml;&auml;lle maalaaminen</h2>
<p>Mene <strong>3D View</strong> -editoriinja muuta tila tekstuurimaalaukseksi (<strong>Texture Paint</strong>).</p>
<div class="c4"><img src="static/ScreenHunter_18%20Apr.%2017%2022.04.gif" alt="" /></div>
<p>T&auml;m&auml; tilassa vasemmalla k&auml;ytt&ouml;liittym&auml;ss&auml; on esill&auml; sivupaneeli, jossa on mahdollista muuttaa sivellint&auml; ja muita asetuksia.</p>
<div class="c4">
<p><img src="static/ScreenHunter_19%20Apr.%2017%2022.16.gif" alt="" /></p>
<p class="c5">T&auml;ss&auml; voit muuttaa k&auml;ytetyn siveltimen kokoa, v&auml;ri&auml; ja tyyppi&auml;. Voit maalata suoraan teksturoidun verkon p&auml;&auml;lle kuvaikkunassa tai tekstuurin p&auml;&auml;lle UV/kuvaeditori-ikkunassa.</p>
</div>
<h2>Verteksin v&auml;rit&nbsp;</h2>
<p>Verteksien v&auml;ritt&auml;minen on eritt&auml;in resursseja kuluttamaton tapa lis&auml;t&auml; v&auml;ri&auml; verkkoosi. Kun verteksi on v&auml;ritetty, tahko v&auml;ritet&auml;&auml;n tuosta verteksist&auml;. Jos sinulla on tahko, jossa on kolme verteksi&auml;, joista jokainen on eri v&auml;rinen. V&auml;rien sekoitus perustuu siihen, kuinka kaukana verteksi on toisesta verteksist&auml;.</p>
<p>Verteksien v&auml;rej&auml; ei tallenneta grafiikkakorttisi muistiin, toisin kuin tekstuureja. Sen sijaan verteksien v&auml;rit vain lasketaan ja piirret&auml;&auml;n tarvittaessa. Laskutoimitus itsess&auml;&auml;n tehd&auml;&auml;n nykyaikaisen grafiikkakortin grafiikan prosessointiyksik&ouml;ss&auml;, ja se on itsess&auml;&auml;n laskennallisesti vaatimaton: verteksit - ja niihin kiinnitetyt tahkot - ovat joka tapauksessa v&auml;rillisi&auml; (ja ne t&auml;ytyy piirt&auml;&auml; jonkun v&auml;risiksi), yleens&auml; harmaita kolmiulotteisissa ohjelmissa, joten on vain tarpeen antaa niille uusi sopiva v&auml;ri. Verteksien maalausta voidaan k&auml;ytt&auml;&auml; lis&auml;&auml;m&auml;&auml;n yksityiskohtia v&auml;ritykseen tai korostamaan jotain yksityiskohtaa, jopa tekstuuridatan puuttuessa kokonaan.</p>
<p>T&auml;st&auml; syyst&auml; sinun ei tarvitse tehd&auml; punaista tekstuuria, jos tahdot osan verkostasi punaiseksi. V&auml;rit&auml; vain tarpeelliset verteksit punaiseksi ja tahkot seuraavat per&auml;ss&auml;.</p>
<p>Verteksien v&auml;ritystilaan p&auml;&auml;set valitsemalla valikosta vaihtoehdon <strong>Vertex Paint</strong>.</p>
<p><img src="static/ScreenHunter_21%20Apr.%2017%2022.26.gif" alt="" /></p>
<p>Asettaaksesi verteksin v&auml;rin tahkolle, varmista ett&auml; se on aktiivinen tahkonvalintatilassa ja valitse v&auml;ripaletista uusi v&auml;ri.</p>
<div class="c4">
<p><img src="static/ScreenHunter_22%20Apr.%2017%2023.02.gif" alt="" /></p>
<p>Napsauta seuraavaksi <strong>Paint</strong>-valikosta <strong>Set Vertex Colors</strong> asettaaksesi v&auml;rin kaikkiin vertekseihin tahkossasi. Voit my&ouml;s painaa <strong>SHIFT-K</strong>.</p>
<p>&nbsp;<img src="static/ScreenHunter_25%20Apr.%2017%2023.17.gif" alt="" />e</p>
</div>
<p>Vaihtoehtoisesti voit "maalata" verteksiv&auml;rej&auml; suoraan verkollesi. Painaessasi VHN verteksin kohdalla sit&auml; maalataan valitsemallasi v&auml;rill&auml;.</p>
<div class="c4">&nbsp;</div>
<p><strong>Huomaa:</strong> voit yhdist&auml;&auml; verteksin v&auml;rej&auml; ja tekstuureja ty&ouml;ss&auml;si, yksi toisen "p&auml;&auml;ll&auml;". Jos esimerkiksi tahdot yhden teksturoidun verkon osan olevan hieman keltainen, voit v&auml;ritt&auml;&auml; verteksit sill&auml; alueella. Tekstuurin data ja verteksin data sekoitetaan riippuen miksaustilasta, jonka olet valinnut.</p>
<h2>Kuvan pakkaaminen (tai &auml;&auml;nen tai videon)</h2>
<p>Yleinen ongelma multimediaprojektien kehitt&auml;misess&auml; on monien eri tiedostojen tilan valvominen. Multimediaprojekti vaatii v&auml;ltt&auml;m&auml;tt&auml; lukuisia tiedostoja. Blender tarjoaa t&auml;h&auml;n oivan ratkaisun.</p>
<p>Jokainen Blender-tiedosto (nimelt&auml;&auml;n <strong>*.blend</strong>) voidaan ymm&auml;rt&auml;&auml; arkistona - hieman kuin ZIP-tiedosto. Kun lis&auml;&auml;t ulkoista dataa Blender-projektiisi (tekstuurin, &auml;&auml;nen tai videon), sinulla on mahdollisuus "pakata" se Blender-tiedostoosi, jotta et joudu jakelemaan sit&auml; tiedostoa erikseen. Voit sitten luottavaisesti jaella Blender-projektisi tiet&auml;en, ett&auml; kun joku muu avaa tiedoston jossain muualla, t&auml;m&auml; data ei puutu kohtauksestasi. Miss&auml; tahansa vaiheessa voit my&ouml;s "purkaa" n&auml;m&auml; tiedostot, ty&ouml;skennell&auml; niiden parissa ja pakata ne uudelleen.</p>
   
  </div>
 </div>


  </div>
</div>
<!-- End of content -->



<!-- sputnik error page -->
<div id="dialog-sputnik-qrac" style="display: none"></div>
<div id="dialog-sputnik-error" title="Can't communicate with booktype">
  <p>
    <span class="ui-icon ui-icon-circle-check" style="float:left; margin:0 7px 50px 0;"></span>
    There has been error in communication with Booktype server.
    Not sure right now where is the problem.
  </p>
  <p>
    You should refresh this page.
  </p>
</div>


<ul class="strings template">
 <li class="ok">OK</li>
 <li class="back">Back</li>
 <li class="create">Create</li>
 <li class="cancel">Cancel</li>
 <li class="next">Next</li>
 <li class="import">Import</li>
 <li class="savechanges">Save changes</li>
 <li class="errorcreategroup">Couldn't create a group!</li>
 <li class="msgepub">enter epub URL</li>
 <li class="msgarchive">enter Archive.org ID</li>
 <li class="msgwiki">enter Wikibooks URL</li>
 <li class="msgbooktype">enter Booktype URL</li>
 <li class="deletebook">Delete book</li>
</ul>

</body>
</html>

